[
    {
        "message": "Since the US coup attempt began in January 2019, an estimated $24 billion of Venezuelan public money has been looted -- and the Trump administration has used at least $601 million of it to construct a militarized wall on the US-Mexico border.\n\nDuring his 2016 presidential campaign, Trump insisted countless times that he would “make Mexico pay” to build a gargantuan wall covering all of the roughly 2,000 miles (3,145 kilometers) of the border.\n\nUnable to force the country to fund his $18 billion pet project, which has already cost an estimated $30 million per mile in southern Texas, Trump has resorted to stealing that money from the Venezuelan people.\n\nhttps://thegrayzone.com/2020/06/29/trump-stolen-venezuelan-money-border-wall-mexico/",
        "timestamp": "2020-06-30 16:28:41"
    },
    {
        "message": "Did you know the first alleged \"ISIS attack\" in the US was instigated by the FBI?\n\nAn undercover FBI agent encouraged an extremist in Garland to “tear up Texas,” and was even present at the attack, mere feet away from the shooters.\n\n(From @TheGrayzoneNews 2017 archive)\n\nhttps://thegrayzone.com/2017/03/28/fbi-isis-garland-texas-shooting-undercover-agent/",
        "timestamp": "2020-06-29 13:39:01"
    },
    {
        "message": "This is huge: Spanish scientists have found traces of the new coronavirus in a sample of Barcelona waste water collected in March 2019, nine months before COVID-19 was first identified in China.\n\nThis is more evidence suggesting the virus did not originate in China. \nhttps://www.reuters.com/article/us-health-coronavirus-spain-science-idUSKBN23X2HQ",
        "timestamp": "2020-06-27 20:14:46"
    },
    {
        "message": "This is jaw-dropping and needs way more attention:\n\nThe mass murderer behind the largest shooting in Canada's history—who dressed as a cop and drove a replica police car as he killed 22 people—was apparently an agent or informant of the federal police RCMP\nhttps://www.macleans.ca/news/canada/the-nova-scotia-shooter-case-has-hallmarks-of-an-undercover-operation/",
        "timestamp": "2020-06-25 18:38:35"
    },
    {
        "message": "This is part two of our @TheGrayzoneNews investigation, looking into the bizarre Trump-like Mexican oligarch who is leading a coalition of corporate leaders and far-right fanatics called FRENA to try to overthrow democratically elected progressive President Andrés Manuel López Obrador (AMLO).\n\nThis cast of fascistic characters is hilariously absurd -- but also very dangerous, considering they are ultra-rich capitalists with vast economic resources and friends in high places. \n\nAnd they look to Bolsonaro's Brazil and the coup regime in Bolivia as models for what they want to replicate in Mexico.\n\nhttps://thegrayzone.com/2020/06/25/frena-gilberto-lozano-mexico-coup-amlo/",
        "timestamp": "2020-06-25 16:03:28"
    },
    {
        "message": "",
        "timestamp": "2020-06-18 22:02:10"
    },
    {
        "message": "",
        "timestamp": "2020-06-18 22:02:10"
    },
    {
        "message": "",
        "timestamp": "2020-06-18 22:02:10"
    },
    {
        "message": "",
        "timestamp": "2020-06-18 22:02:10"
    },
    {
        "message": "",
        "timestamp": "2020-06-18 22:02:10"
    },
    {
        "message": "This is absolutely amazing 😂 \nDonald Trump retweeted Max Blumenthal's criticism of John Bolton today... so Max changed his display name so all of the following messages appeared on Trump's Twitter profile:\n-Viva Chávez, Hands off Venezuela\n-US Sanctions Kill Kids\n-Free Palestine, Fire Jared\n-Free Julian Assange\n-Defund the Police\n-Prosecute Pompeo at ICC\n\nThen, around 530 pm EST, Trump un-retweeted him. 😂\n\nMasterful trolling of the garbage US president.",
        "timestamp": "2020-06-18 22:02:10"
    },
    {
        "message": "En español: El guerrillero nicaragüense Edén Pastora, uno de los principales líderes militares de la Revolución Sandinista, conocido como el Comandante Cero, ha fallecido.\n\nEn el 40 aniversario de la revolución, Max Blumenthal y yo hicimos esta entrevista con él, para un documental de Grayzone.\n\nDijo: Tenemos \"40 años luchando contra el imperialismo, que nos ha atacado siempre... desde que nos invadieron tres veces, y impusieron a Somoza a matar a Sandino, y hicieron barbaridades, siempre hemos tenido que luchar.\"\n\nhttps://twitter.com/BenjaminNorton/status/1272929813993578497",
        "timestamp": "2020-06-16 17:02:54"
    },
    {
        "message": "Documentary: Nicaragua’s Sandinista Revolution is still thriving, after 40 years\nhttps://thegrayzone.com/2019/08/22/nicaragua-sandinista-revolution-40th-anniversary/",
        "timestamp": "2020-06-16 17:02:26"
    },
    {
        "message": "(español abajo) One of the top military leaders of Nicaragua's Sandinista Revolution, Edén Pastora, known as Comandante Cero, has just passed away.\n\nLast July, on the 40th anniversary of the revolution, Max Blumenthal and I interviewed him for this @TheGrayzoneNews documentary.\n\nHe said: \"We have 40 years fighting against [US] imperialism, which has always attacked us... Since they invaded us 3 times, and used Somoza to kill Sandino, and carried out acts of barbarism... We have always had to fight.\"\n\nhttps://twitter.com/BenjaminNorton/status/1272926664088043520",
        "timestamp": "2020-06-16 17:02:12"
    },
    {
        "message": "In parts of the United States and the bottomless pit of the internet, today, June 14, is considered “Barack Obama Day.” On social media, the hashtag #ObamaDayJune14th is going viral.\n\nSo I thought I would commemorate this day by listing some of the Democratic former president's many accomplishments.\n\nAfter all, as his supporters so keenly remind us, Obama only had one major scandal: wearing a tan suit... well aside from all the wars, coups, destruction of entire nations, bringing slavery back to Libya, murderous sanctions, supporting al-Qaeda, and colonialism he oversaw.\n\nhttps://bennorton.com/obama-day-wars-coups-colonialism/",
        "timestamp": "2020-06-14 17:39:56"
    },
    {
        "message": "Protesters in the authoritarian US police state face LIFE IN PRISON for allegedly setting a police car on fire in New York.\n\nThe USA has one of the most authoritarian regimes on Earth. Never, ever listen to media propaganda about foreign \"dictatorships\" https://t.co/ewmV0uHLOK",
        "timestamp": "2020-06-13 03:05:19"
    },
    {
        "message": "I wrote about how on Wikipedia is a deeply undemocratic platform, dominated by Western state-backed actors and corporate public relations flacks, easily manipulated by powerful forces.\n\nA staggering 80 percent of edits on Wikipedia are made by just 1 percent of users.\n\nGovernments, intelligence agencies, and large corporations maintain significant influence over Wikipedia, editing the encyclopedia to push their agendas, while carefully monitoring articles and policing new edits.\n\nLarge corporations hire PR firms of Wikipedia editors to sanitize entries about themselves.\n\nAnd a small group of regime-change advocates and right-wing Venezuelan opposition supporters have blacklisted independent media outlets like @TheGrayzoneNews on explicitly political grounds, violating the encyclopedia’s own guidelines – which it has no mechanisms to enforce even if it wanted to.\n\nhttps://thegrayzone.com/2020/06/10/wikipedia-formally-censors-the-grayzone-as-regime-change-advocates-monopolize-editing/",
        "timestamp": "2020-06-11 16:36:31"
    },
    {
        "message": "Under FBI orders, Facebook and Google removed an independent media website that published writers critical of US foreign policy.\n\nThe FBI's justification for the removal was extremely dubious, and it sets a troubling precedent for censorship of other critical outlets.\n\nhttps://thegrayzone.com/2020/06/05/the-fbi-launches-open-attack-on-foreign-alternative-media-outlets-challenging-u-s-foreign-policy/",
        "timestamp": "2020-06-07 16:40:24"
    },
    {
        "message": "Another big @TheGrayzoneNews exclusive: We published photos that were surreptitiously taken inside a British courtroom, which show political prisoner Julian Assange, visibly disoriented, confined to a glass cage and unable to communicate with his lawyers.\n\nNazi war criminal Adolph Eichmann was guaranteed more rights in court than journalist Julian Assange.\n\nhttps://thegrayzone.com/2020/05/29/british-court-assanges-physical-deterioration/",
        "timestamp": "2020-05-29 18:08:53"
    },
    {
        "message": "The founder and editor of Jacobin, the pro-imperialist “socialist” magazine that humbly dubbed itself “a leading voice of the American left,” just published an op-ed in the New York Times endorsing right-wing demented predatorial war criminal Joe Biden.\n\nMany people criticized me for supposedly being “too harsh” on Jacobin.\n\nYou now have no excuse to deny the obvious: Jacobin’s role is to construct a Respectable Left that is pro-imperialist, anti-communist, and just a social-democratic arm of the Democratic Party.\n\nhttps://t.co/4Kvz3BEHhz",
        "timestamp": "2020-05-28 20:29:43"
    },
    {
        "message": "A lot of my work as a journalist has been dedicated to exposing the role of so-called “human rights” groups and “non-governmental organizations” (NGOs) as tools of US imperialism. But rarely is their status as an arm of Washington’s imperial power openly acknowledged.\n\nBack in October 2001, war criminal Colin Powell, a former top US military commander and then secretary of state under George W. Bush, gathered leaders of prominent NGOs in Washington to butter them up and emphasize the crucial supplementary role that they would be playing in the US government’s post-9/11 war efforts.\n\nPowell heaped praise on NGOs that “shed light on human rights.” He noted that they were a key part of US military efforts, a “force multiplier” in Washington’s wars, and “such an important part of our combat team.”\n\nPowell dispelled any pretense that American NGOs do work around the world in the interest of vague notions like “human rights.” Rather, he gloated, these NGOs serve the United States’ imperial interests, and it is in fact the illusion of their ostensible “independence” from the US government that is precisely what “makes [them] so valuable.”\n\nhttps://bennorton.com/colin-powell-ngos-force-multipliers-us-military-combat-team/",
        "timestamp": "2020-05-26 17:22:58"
    },
    {
        "message": "via @TheGrayzoneNews:\n\nThere is a shocking update in this massive corruption scandal: A US judge just approved moving forward with the liquidation of Venezuela's most valuable foreign asset, Citgo, which is worth billions of dollars.\n\nVenezuela's real, elected government used this publicly owned company to fund social programs for the Venezuelan people. But the Trump administration illegally stole Citgo in order to fund the coup gang of Juan Guaidó.\n\nNow a US judge is going to sell Citgo off to oil corporations, and then use that money to pay a Canadian mining company. Other US oil corporations will take some of the money as well.\n\nThis is textbook vulture capitalism. These corporate vultures are going to work together to pick apart their prey -- and the Venezuelan people are the ones who suffer greatly because of it.\n\nhttps://thegrayzone.com/2019/09/03/the-citgo-conspiracy-opposition-figures-accuse-guaido-officials-of-scam-to-liquidate-venezuelas-most-prized-international-asset/",
        "timestamp": "2020-05-23 18:17:27"
    },
    {
        "message": "",
        "timestamp": "2020-05-22 13:40:45"
    },
    {
        "message": "American capitalism in two images:\nThe US is truly a barbaric country, where the government only exists to serve the interests of capitalist oligarchs and wage war, and it exploits historic crises to extract wealth from the poor and give it to the rich.\nCapitalism is suicidal",
        "timestamp": "2020-05-22 13:40:45"
    },
    {
        "message": "The Intercept has burnt at least three sources now. And its Russiagate story that landed leaker Reality Winner in prison was co-authored by an embedded police reporter who is now the NYPD's top spokesperson.\n\nI investigated this shocking scandal for @TheGrayzoneNews: https://thegrayzone.com/2020/05/20/the-intercept-reality-winner-richard-esposito-nypd/",
        "timestamp": "2020-05-21 15:17:17"
    },
    {
        "message": "Biden is going to run a right-wing campaign that is slightly less overtly racist than Trump's, but still racist. His campaign is going to ignore Latinos; he will attack Trump from the right on key issues; and he will push an anti-immigrant, pro-war, neoliberal platform.\n\nThen Biden will lose anyway.\n\nTrump already won re-election when Biden was selected (anointed) as the Democratic candidate. This is all a distraction and a farce.\n\nThe actual left should not waste a single second on the Biden campaign dead end. The US left should be focused on building a new party that can destroy and replace the Democrats. That is the most important mission today.\n\nhttps://news.yahoo.com/biden-campaign-doesnt-consider-latinos-143056489.html",
        "timestamp": "2020-05-16 14:55:02"
    },
    {
        "message": "The leaked contract between US coup puppet Juan Guaidó and the Silvercorp USA mercenary firm closely resembles the bounty the DEA placed on the head of actual President Nicolás Maduro and members of his inner circle this March.\n\nThe deal also tacitly authorizes the elimination of working-class Venezuelans in proposed death squad activities.\n\nhttps://thegrayzone.com/2020/05/10/guaido-mercenary-contract-venezuelas-maduro-us-bounty-death-squad/",
        "timestamp": "2020-05-12 19:38:38"
    },
    {
        "message": "Even Churchill -- a die-hard anti-communist, right-wing colonialist, and racist who oversaw genocide in India -- had to admit that the Soviet Union did \"the main work in tearing the guts out of the German Army.\" He later repeated that \"it is the Red Army that has torn the guts out of the filthy Nazis.\"\n\nBut there has been a systematic campaign, by the US empire and its loyal stenographers in the corporate media, to rewrite the history of World War II, erasing the leading role of the USSR and international communist movement in defeating fascism, and turning the USA, which played a relatively minor role, into the hero. This is a form of Holocaust revisionism.",
        "timestamp": "2020-05-08 21:52:24"
    },
    {
        "message": "I translated this poll of French public opinion that shockingly illustrates the effectiveness of this massive global brainwashing.",
        "timestamp": "2020-05-08 21:52:11"
    },
    {
        "message": "Today marks the 75th anniversary of the defeat of Nazi Germany in World War II.\n\nIt is an indisputable fact that the Soviet Union liberated Europe from fascism in WWII. A staggering 27 MILLION Soviets died, in the fight to the death against the genocidal Nazi regime.\n\nMeanwhile, 400,000 Americans died in all of WWII (just 1.5% of the number of Soviets who lost their lives). More Soviets died in the Battle of Stalingrad alone than all Americans (or Brits) who died in the entire war.\n\nThroughout most of WWII, the US and UK faced just 10 German divisions combined. The Soviets fought more than 200 German divisions.\n\nYes, the US Lend-Lease program helped, but the USSR did the vast majority of the fighting. Over 80% of Nazi casualties were on the Eastern front, with the USSR. The Nazis lost 1 million soldiers on the Western front; they lost 6 million on the Eastern front.",
        "timestamp": "2020-05-08 21:51:59"
    },
    {
        "message": "I am translating clips from President Nicolás Maduro's speech on the failed invasion of Venezuela on May 3.\n\nHe says the US and Colombian governments recruited, funded, trained, and armed Contras for the operation.\n\n\"The government of the USA decided to use this time of the pandemic for a terrorist attack, to fill Venezuela with violence,\" Maduro said.\n\n\"The government of the USA is absolutely and completely involved in this invasion.\"\n\nMaduro says Venezuela's intelligence services have proof that the US DEA specifically recruited and armed drug lords, cartels, and criminals for the operation.\n\n(I will be posting more translated excerpts of this bombshell speech that Maduro delivered on May 4.)",
        "timestamp": "2020-05-06 01:48:01"
    },
    {
        "message": "Current and former staff members of the Organization for the Prohibition of Chemical Weapons (OPCW) have denounced the group's IIT report alleging Syrian government sarin use at Ltamenah, criticizing its reliance on rumor, hearsay, “scientifically flawed” claims, and the influence of unqualified, secret “experts” aligned with the Western-backed opposition.\n\nhttps://thegrayzone.com/2020/04/28/opcw-insiders-ltamenah-chemical-weapons-report/",
        "timestamp": "2020-04-29 15:37:03"
    },
    {
        "message": "So much for \"democracy\": The renowned British peace activist and former diplomat Craig Murray has been charged with contempt of court for writing blog posts.\n\nThe suspicious indictment represents a heavily politicized, Kafkaesque case in which Murray has virtually none of his rights guaranteed. It also appears to be a part of the British government’s aggressive crackdown on the Scottish independence movement.\n\nIn comments to @TheGrayzoneNews, Murray described the case against him as a thoroughly undemocratic attack on free speech, and warned it may be punishment for his dissident journalism and activism exposing the UK’s crimes and lies.\n\nMurray said he faces the possibility of “no jury, no ‘beyond reasonable doubt’ test, no public interest defence allowed, no freedom of speech defence allowed, and up to two years in jail and an ‘unlimited’ fine.”\n\nhttps://thegrayzone.com/2020/04/27/craig-murray-indicted-blog-posts/",
        "timestamp": "2020-04-29 15:36:21"
    },
    {
        "message": "This is wild: The director of far-right Bolivian coup leader Camacho’s presidential campaign threw a slander-laced tantrum against @TheGrayzoneNews in a letter to the Inter-American Commission on Human Rights, blaming our factual journalism for a report on repression.\n\nThis right-wing Bolivian politician, former World Bank official, and longtime Harvard Kennedy School professor falsely and maliciously asserted that our independent news website is supposedly funded by the governments of Venezuela, Cuba, and Nicaragua. And he defamed us claiming we have “no respect for the truth.”\n\nThis is the latest in a series of attacks on The Grayzone’s journalism by right-wing US-backed forces in Latin America — which have included the arrest of editor Max Blumenthal on outlandish charges fabricated by members of Venezuela’s opposition.\n\nhttps://thegrayzone.com/2020/04/16/bolivia-coup-the-grayzone-cidh-camacho-maclean/",
        "timestamp": "2020-04-16 23:12:38"
    },
    {
        "message": "Here is part 2 of our discussion of the end of the Bernie Sanders presidential campaign, and how the professional media left, largely based in Brooklyn, opportunistically capitalized on his movement to push a soft-imperialist branding of \"democratic socialism\" — and to advance their careers in the press. \n\nWe also address media celebrity AOC, Jacobin Magazine, the DSA, and the scheme to divert angry politicized youth back into the thoroughly discredited, neoliberal Democratic Party.\n\nhttps://www.youtube.com/watch?v=B3I5MgbOvFo",
        "timestamp": "2020-04-14 18:29:05"
    },
    {
        "message": "*Bernie Sanders goes out with a whimper - An obituary on an aborted 'revolution'*\n\nThere are some difficult truths in this podcast episode, but Max Blumenthal and I discuss the failure of the Bernie campaign and some of the questionable figures surrounding it\n\nhttps://www.youtube.com/watch?v=QrnQm9Y9_zU",
        "timestamp": "2020-04-13 16:59:21"
    },
    {
        "message": "Nicaragua's US-backed right-wing opposition and the corporate media are waging an information warfare campaign to undermine the elected leftist Sandinista government, spreading fake news about coronavirus.\n\nIn this report on the ground in Managua, I dispelled some of the false claims and I explained how Nicaragua's approach carefully balances the needs of workers and the poor with public health.\n\nhttps://thegrayzone.com/2020/04/13/regime-change-coronavirus-nicaragua/",
        "timestamp": "2020-04-13 16:57:42"
    },
    {
        "message": "Human Rights Watch, the leading so-called rights organization in the US, has actively lobbied for Washington to impose suffocating sanctions on leftist governments in Latin America. The group has even praised the Trump admin for ramping up its regime-change measures\n\nhttps://thegrayzone.com/2020/04/08/billionaire-human-rights-watch-sanctions-nicaragua-venezuela/",
        "timestamp": "2020-04-08 16:19:50"
    },
    {
        "message": "Just days after the CIA fed stories to the corporate media claiming without evidence that China was secretly undercounting its coronavirus deaths, now we are seeing real evidence that it's actually the USA itself that's drastically undercounting its deaths\n\nhttps://gothamist.com/news/surge-number-new-yorkers-dying-home-officials-suspect-undercount-covid-19-related-deaths",
        "timestamp": "2020-04-08 01:33:53"
    },
    {
        "message": "Southern Command is ramping up the US military presence in Latin America to counter the supposed \"threats\" of China, Russia, and Venezuela. \n\nBrazil will play an anchoring role in the new arrangement, embracing its new role as an extension of Pax Americana under the far-right government of Jair Bolsonaro. In recent months, Brazil has been designated a “major non-NATO ally” and signed a historic agreement incorporating its domestic defense industry into a Pentagon funding and research program.\n\nhttps://thegrayzone.com/2020/03/30/southcom-latin-america-china-russia-threats-brazil/",
        "timestamp": "2020-03-31 15:48:11"
    },
    {
        "message": "Brazil’s far-right government requested the return of thousands of Cuban doctors to help fight the coronavirus — just months after President Jair Bolsonaro smeared them as “terrorists” and expelled them.\n\nhttps://thegrayzone.com/2020/03/17/coronavirus-brazil-cuban-doctors-bolsonaro/",
        "timestamp": "2020-03-17 16:42:54"
    },
    {
        "message": "A far-right terrorist group that calls itself the \"Venezuelan Patriotic Front\" burnt down the warehouse of Venezuela's National Electoral Council, destroying the majority of its voting machines\n\nCorporate media outlets then basically defended the terror attack.\n\nAnd not only that; some of them also peddled the insane conspiracy theory that the Chavista government did it as a false flag attack. Even though this far-right terrorist group took credit for it publicly! \n\nhttps://fair.org/home/corporate-media-condone-destruction-of-venezuelas-voting-machines/",
        "timestamp": "2020-03-16 22:56:47"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:53"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:53"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:53"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:53"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:52"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:52"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:52"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:52"
    },
    {
        "message": "",
        "timestamp": "2020-03-16 01:25:52"
    },
    {
        "message": "While the world is on lockdown over the coronavirus, the leftist Sandinista movement in Nicaragua (where there are still no cases) held its weekly massive march yesterday, showing solidarity with people around the world suffering from the virus and teaching how to fight it.\n\nThe Sandinistas hold a huge march every Saturday in the capital Managua, and thousands of people always show up (and get no corporate media coverage).\n\nLast week's theme was highlighting the crucial role of women leaders in liberation struggles.\n\nThis week's theme was \"Love in the time of COVID-19\" (a reference to Márquez's famous novel).",
        "timestamp": "2020-03-16 01:25:52"
    },
    {
        "message": "A FOURTH whistleblower from the Organization for the Prohibition of Chemical Weapons (OPCW) has now spoken out to defend inspectors who challenged a cover-up of the chemical weapons probe in Douma, Syria.\n\nThis whistleblower reveals staffers have been “frightened into silence.”\n\nThis is another huge, exclusive story by Aaron Maté. He has been publishing scoop after scoop on this OPCW Syria scandal at @TheGrayzoneNews. But the US media refuses to touch it. Including supposedly \"progressive\" outlets like Democracy Now, The Intercept, Jacobin, etc. It's outrageous self-censorship and cowardice.\n\nhttps://thegrayzone.com/2020/03/12/opcw-whistleblower-mistreatment-douma-investigators/",
        "timestamp": "2020-03-13 16:47:22"
    },
    {
        "message": "Not one member of the House of Representatives spoke up against a bipartisan bill sponsored by hardline imperialists, passed on a voice vote without opposition, that ramps up US economic warfare and regime-change measures against Nicaragua’s democratically elected leftist government.\n\nhttps://thegrayzone.com/2020/03/12/us-house-sanctions-nicaragua/",
        "timestamp": "2020-03-12 19:39:47"
    },
    {
        "message": "Some of the people on Biden's \"Return to Normal\" list to restore the neoliberal status quo are:\n\nBillionaire oligarch Bloomberg as head of the parasitic World Bank\n\nPotential Treasury secretary would be Elizabeth Warren, or ex JPMorgan CEO Jamie Dimon, or Bank of America's ex vice chairman",
        "timestamp": "2020-03-10 20:14:48"
    },
    {
        "message": "Biden has released a plan called \"Return to Normal,\" selecting a bunch of former bankers for potential top cabinet positions\n\nThis solidifies his pledge to rich corporate donors: \"No one's standard of living will change, nothing would fundamentally change\"\nhttps://t.co/T5QI0xAdTK",
        "timestamp": "2020-03-10 20:14:21"
    },
    {
        "message": "The Organization of American States (OAS) falsely claimed that there were significant irregularities in the Bolivian election in October, and used these now debunked myths to justify a military coup to overthrow Bolivia's democratically elected government and install a far-right US puppet regime.\n\nSo now The Grayzone and CODEPINK are calling on the OAS to be consistent and provide emergency international election observers in the US Democratic presidential primary, after there have been many, many, many more documented irregularities than alleged in Bolivia:\n\n\"While the OAS’s findings in Bolivia have been comprehensively discredited by researchers from the Center for Economic Policy Research and the Massachusetts Institute of Technology, it is incumbent on this organization to uphold the same standards it applies in countries targeted by the United States for regime change to the United States itself.\"\n\nhttps://thegrayzone.com/2020/03/09/grayzone-codepink-international-election-observers-oas-2020-democratic-primary/",
        "timestamp": "2020-03-09 15:05:15"
    },
    {
        "message": "This is a huge scoop by Aaron Maté — Leadership at the Organization for the Prohibition of Chemical Weapons (OPCW) tried to discredit two veteran officials who became whistleblowers to challenge the cover-up of its chemical weapons investigation in Douma, Syria. \n\n@TheGrayzoneNews exclusively obtained letters in which the whistleblowers respond: \n\n“Why would a pair of the top Inspection Team Leaders, both with impeccable records… suddenly ‘go rogue’?” wrote one whistleblower in his letter.\n\n“Why would we risk so much?” asked the other, answering, “Something had gone wrong inside the OPCW.”\n\nhttps://thegrayzone.com/2020/03/05/opcw-whistleblowers-attacks-cover-up-douma-deception/",
        "timestamp": "2020-03-07 15:58:04"
    },
    {
        "message": "These imperialists are sociopaths with the blood of countless Iranian civilians on their hands:\n\nAmid a devastating, deadly coronavirus outbreak, the Trump administration-backed right-wing group United Against Nuclear Iran is pushing to stop medicine sales to Iran.\n\nThe only reason to do this is to kill as many Iranians as possible. That is the explicit goal.\n\nIran's Foreign Minister Zarif correctly calls this what it is: medical terrorism.\n\nThe philosophy of these mass-murdering imperialist sociopaths is, \"Never let a good crisis go to waste.\"\n\nhttps://responsiblestatecraft.org/2020/03/05/amid-coronavirus-trump-uani-pushes-to-stop-medicine-sales-to-iran/",
        "timestamp": "2020-03-07 15:57:40"
    },
    {
        "message": "*Joe Biden, same old wars, same old interventionism*\n\nAt our podcast Moderate Rebels, Max Blumenthal and I discuss Biden's staunch support for wars across the planet.\n\nWe speak with ex State Department Russia adviser James Carden about his experience with the liberal interventionist war hawks in the Obama administration.\n\nhttps://soundcloud.com/moderaterebels/biden-war-interventionism-james-carden",
        "timestamp": "2020-03-04 21:32:55"
    },
    {
        "message": "I traveled to Jinotepe, Nicaragua to report this shocking story of how the US embassy and OAS lobbied to free so-called \"political prisoners\" who are killers, rapists, and drug traffickers.\n\nOne later stabbed his pregnant girlfriend to death.\n\nThis should be a massive scandal. But thus far it has gotten zero coverage in the English-language corporate media, which acts as the voice of Nicaragua's right-wing opposition.\n\nhttps://thegrayzone.com/2020/02/28/us-oas-nicaragua-political-prisoners-murder/",
        "timestamp": "2020-02-29 16:56:10"
    },
    {
        "message": "CNN and 60 Minutes host Anderson Cooper, who red-baited Bernie Sanders over old comments praising Fidel Castro’s literacy program, worked in CIA headquarters for two summers.\n\nhttps://thegrayzone.com/2020/02/25/vanderbilt-anderson-cooper-cia-college/",
        "timestamp": "2020-02-26 19:15:24"
    },
    {
        "message": "While the US government, international NGOs, and corporate media outlets have relentlessly demonized the elected governments in Venezuela and Nicaragua, the Washington-backed right-wing regime in Chile, ruled by a Pinochet-defending billionaire, has been violent cracking down on an uprising against neoliberal austerity policies.\n\nAt least 10,365 people have been detained; 3,765 treated for wounds in hospitals; and 2,122 shot, 445 in the eye, according to a conservative estimate.\n\nhttps://thegrayzone.com/2020/02/24/chiles-us-backed-shooting-protesters-blinding-maiming-thousands/",
        "timestamp": "2020-02-25 02:01:51"
    },
    {
        "message": "Worried they might be exposed for sabotaging the Nevada caucus today like they did to Iowa, right-wing Democratic Party leaders are requiring \"non-disclosure agreements that prohibit election volunteers from saying anything that might harm the party’s reputation\"\n\nNot shady at all https://www.washingtonpost.com/politics/2020/02/21/nevada-ndas/",
        "timestamp": "2020-02-22 16:01:32"
    },
    {
        "message": "The mainstream corporate media is now openly admitting that right-wing Republican billionaire Michael Bloomberg is conspiring with Democratic Party leaders to steal the nomination from Bernie Sanders at a brokered convention.\n\nThe best \"democracy\" money can buy.\n\nhttps://www.politico.com/news/2020/02/20/bloomberg-brokered-convention-strategy-116407",
        "timestamp": "2020-02-21 14:53:08"
    },
    {
        "message": "A Michael Bloomberg surrogate, who served as the Republican mayor's chief media adviser and is now aggressively pumping up the billionaire’s 2020 Democratic campaign for president, also helped to elect Brazil’s fascist leader Jair Bolsonaro, an open supporter of military dictatorship.\n\nhttps://thegrayzone.com/2020/02/19/arick-wierson-bloomberg-pr-bolsonaro/",
        "timestamp": "2020-02-20 15:34:12"
    },
    {
        "message": "This is a useful timeline of how the DNC manipulated the 2016 presidential race against Bernie Sanders, on behalf of Hillary Clinton.\n\nOf course this DNC bias has only accelerated in the past few years, and has become as blatant as ever.\n\nhttp://accuracy.org/timeline-how-dnc-manipulated-2016-presidential-race/",
        "timestamp": "2020-02-19 18:02:26"
    },
    {
        "message": "This article exposes blatant corporate media bias against Nicaragua's democratically elected Sandinista government and how international \"human rights\" NGOs are spreading debunked fake news, misreporting a violent land dispute in a nature reserve and absurdly blaming it on the Sandinistas.\n\nhttps://thegrayzone.com/2020/02/19/nicaragua-peace-media-international-ngos-violence-reporting/",
        "timestamp": "2020-02-19 16:01:20"
    },
    {
        "message": "Honestly this is probably the most important — and revealing — poll from the 2020 Democratic primary",
        "timestamp": "2020-02-19 16:00:03"
    },
    {
        "message": "In a shocker to absolutely no one, of course Bloomberg was in Epstein's little black book🤮",
        "timestamp": "2020-02-19 14:17:11"
    },
    {
        "message": "A group of 117 doctors from 18 countries just published an open letter in the top medical journal The Lancet condemning the torture of Julian Assange and the denial of his right to health care.\n\nThey warned he is on the verge of being \"tortured to death\"\n\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30383-4/fulltext?rss=yes",
        "timestamp": "2020-02-18 14:59:01"
    },
    {
        "message": "Outrageous scandal: A high-ranking CIA agent killed a teenage British citizen while DRIVING ON THE WRONG SIDE OF THE ROAD outside a US military base in the UK. \n\nAnd while the US demands Julian Assange's extradition, it refuses to give up its spy.\n\nBoris Johnson is rolling over like the imperial puppet he is. The UK Foreign Office is protecting the CIA agent who killed its own citizen.\n\nhttps://thegrayzone.com/2020/02/18/assange-us-extradite-cia-killed-british-teen/",
        "timestamp": "2020-02-18 14:45:59"
    },
    {
        "message": "Excellent news: There was a hung jury yesterday in US government's ridiculous case against the four protectors of the Venezuelan embassy in DC, who were illegally arrested inside the embassy, on sovereign Venezuelan soil, by US police, and then hit with ridiculous fake charges. \n\nThe Trump administration tried to stack it against them, preventing the jury from knowing key facts about the case (like, for instance, that unelected US puppet Juan Guaidó is not the actual president of the country). But their efforts failed. For now. \n\nWhat is most disturbing — although unsurprising — is how basically zero so-called \"human rights\" groups spoke out in support of these brave activists as they faced a draconian, Kafkaesque case. It shows once again that when it comes to imperialism, liberal NGO types are totally in agreement with Trump.\n\nhttps://thegrayzone.com/2020/02/14/mistrial-trump-case-venezuelan-embassy-protectors/",
        "timestamp": "2020-02-15 22:22:18"
    },
    {
        "message": "Huge scoop at @TheGrayzoneNews by Aaron Maté:\n\nFacing accusations that it issued a doctored report on a \"chemical attack\" in Douma, Syria, the OPCW attacked two whistleblowers\n\nBut leaked documents reveal serious distortions and a campaign of intimidation against infernal dissent\n\nhttps://thegrayzone.com/2020/02/11/new-leaks-shatter-opcws-attacks-douma-whistleblowers/",
        "timestamp": "2020-02-13 17:09:47"
    },
    {
        "message": "For decades governments across the world worked with a company called Crypto AG to keep communications of their spies, soldiers, and diplomats secret\n\nThe CIA secretly owned that company. The US was spying on so many countries' communications all along \n\nhttps://t.co/kAi33GKhQS",
        "timestamp": "2020-02-13 17:08:24"
    },
    {
        "message": "While the Buttigieg campaign denies online allegations that he was a CIA asset, military records reveal Mayor Pete was in a unit that worked with the spy agency in Afghanistan.\n\nhttps://thegrayzone.com/2020/02/07/pete-buttigieg-cia-afghanistan/",
        "timestamp": "2020-02-09 17:14:42"
    },
    {
        "message": "A fringe far-right Evangelical leader in Nicaragua revealed opposition forces are meeting with advisers from the US embassy and EU, who pledged support and are pressuring them to unite to try to oust the elected leftist Sandinista Front.\n\nRead more here: https://thegrayzone.com/2020/02/07/nicaragua-opposition-support-us-eu-coalition/",
        "timestamp": "2020-02-07 21:03:50"
    },
    {
        "message": "The US embassy and European Union are meeting with right-wing Nicaraguan opposition leaders and pressuring them to unite against elected leftist President Daniel Ortega in the lead-up to the 2021 election.\n\nhttps://thegrayzone.com/2020/02/07/nicaragua-opposition-support-us-eu-coalition/",
        "timestamp": "2020-02-07 21:03:47"
    },
    {
        "message": "Silicon Valley billionaire Reid Hoffman funded the creation of ACRONYM, the group that sabotaged the Iowa caucus results, after bankrolling voter manipulation campaigns including the notorious online “false flag operation” in Alabama’s 2017 senate race.\n\nhttps://thegrayzone.com/2020/02/06/acronym-iowa-caucus-billionaire-alabama-disinformation/",
        "timestamp": "2020-02-06 16:16:04"
    },
    {
        "message": "Pete Definitely-Not-A-CIA-Agent Buttigieg has hanging in his living room a huge map of the natural resources and minerals in Afghanistan, a country he helped militarily occupy (which has trillions of dollars worth of minerals, by the way)\n\nExtremely normal thing to have in your house",
        "timestamp": "2020-02-06 00:38:49"
    },
    {
        "message": "HuffPost UK ran yet another hit piece smearing academic critics of the dirty war on Syria as Russian stooges. The outlet’s editor-in-chief Jess Brammar assists a British government program that censors journalism that may “compromise UK military and intelligence operations.”\n\nA few hours after this article was published, Brammar was promoted.\n\nhttps://thegrayzone.com/2020/02/03/huffpost-uk-editor-censorship-dsma-russia-jess-brammar/",
        "timestamp": "2020-02-05 17:36:46"
    },
    {
        "message": "Behind the app that delayed the Iowa caucus results is a dark money operation funded by anti-Sanders billionaires and run by former Hillary Clinton and Obama staffers. \n\nIts top donor, Seth Klarman, is a Buttigieg backer who has dumped money into pro-settler Israel lobby groups. https://thegrayzone.com/2020/02/04/pro-israel-buttigieg-seth-klarman-iowas-voting-app/",
        "timestamp": "2020-02-04 13:05:29"
    },
    {
        "message": "A leader from Nicaragua's right-wing opposition admitted that they just had meetings with representatives from the US embassy and European Union, who pledged to support them in the lead-up to the 2021 election.\n\nMore foreign meddling to try to overthrow the popular, democratically elected leftist Sandinista government.\n\nhttps://t.co/lyxTALHYr6",
        "timestamp": "2020-02-03 03:03:50"
    },
    {
        "message": "Iranian professor Mohammad Marandi on social media censorship",
        "timestamp": "2020-02-01 22:27:54"
    },
    {
        "message": "En español: Plan Cóndor 2.0: Tras el golpe en Bolivia, Trump declara a Nicaragua ‘amenaza a su seguridad nacional’ y apunta hacia México\n\nhttps://thegrayzone.com/2019/12/01/plan-condor-2-golpe-bolivia-trump-nicaragua-mexico/",
        "timestamp": "2020-02-01 20:36:22"
    },
    {
        "message": "The US empire has tortured Nicaragua for decades, trying nonstop to violently overthrow the Sandinistas. \n\nTrump has escalated the US war on Nica with more and more sanctions, just like the US imperialist war on Venezuela (which began under Bush, was expanded under Obama, and then is now a full economic blockade under Trump).\n\nAfter the US-backed fascist coup in Bolivia, the Trump White House threatened in a statement,  “These events send a strong signal to the illegitimate regimes in Venezuela and Nicaragua.” \n\nA few days later, Trump then absurdly declared the tiny country of Nicaragua to be an “unusual and extraordinary threat to the national security and foreign policy of the United States.”\n\nhttps://thegrayzone.com/2019/11/27/operation-condor-2-coup-trump-nicaragua-mexico/",
        "timestamp": "2020-02-01 20:34:30"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:38:51"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:38:51"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:58"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:58"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:58"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:58"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:58"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:58"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:57"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:57"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:57"
    },
    {
        "message": "",
        "timestamp": "2020-02-01 19:37:57"
    },
    {
        "message": "(Photos below) The leftist Sandinista Front party held a massive march in the heart of Nicaragua's capital Managua this morning. These photos don't do justice to how huge it was — definitely over 100,000 people. And these marches happen every single Saturday (and get no coverage in English-language corporate media).\n\nThe FSLN is extremely well organized and very popular, with support from at least 2/3rds of the population. It is closely integrated with social movements and labor unions. Reports coming soon at @thegrayzonenews\n\n//\n\n(Fotos abajo) El Frente Sandinista convocó una marcha grandísima esta mañana en Managua, la capital de Nicaragua. Estas fotos no reflejan la enormidad de la marcha — definitivamente más de 100.000 personas. Y estas marchas se convocan todos los sábados (y no reciben cobertura en los medios corporativos angloparlantes).\n\nEl FSLN está muy bien organizado y es muy popular, con el apoyo de más de dos tercios de la población. Y está estrechamente relacionado con los movimientos sociales y los sindicatos. Tendré reportaje pronto en @thegrayzonenews",
        "timestamp": "2020-02-01 19:37:20"
    }
]