[
    {
        "message": "Why is Manafort facing 80 years in prison for tax fraud but Al Sharpton who owes millions in taxes has never been convicted, arrested, or tried for tax evasion?\n\n🤔",
        "timestamp": "2019-07-30 01:49:29"
    },
    {
        "message": "Nancy Pelosi's district—second highest homelessness rate in America\n\nAOC's district—highest homelessness rate in America\n\nElijah Cummings' district—more than 4,000 homeless on any given night\n\nYou show me a American wasteland, I'll show you somewhere a Democrat is in charge",
        "timestamp": "2019-07-28 08:45:19"
    },
    {
        "message": "A 43 year old illegal alien from El Salvador was just charged with kidnapping a 16 year old girl in Iowa and attempting to rape her\n\nYet Democrats still want to open the border, allow anyone in, and give them free healthcare\n\nTheir policies make our country less safe",
        "timestamp": "2019-07-25 18:53:07"
    },
    {
        "message": "Candace Owens is a gift to the movement and country. AOC knows this and is horrified of her!\n\nKeep going Candace against AOC’s disastrous ideas  - we are with you 100%!\n\nhttps://t.me/CandaceOwens/123",
        "timestamp": "2019-07-24 04:16:19"
    },
    {
        "message": "Democrats are lying to you:\n\nThe Trump economy is working for every American\n\nWages for workers without a high school degree rose 6.1% last year\n\nThe Democrats’ open borders would harm the most vulnerable Americans \n\nRT if you want 4 more years of America FIRST!",
        "timestamp": "2019-07-19 04:06:01"
    },
    {
        "message": "Share if anyone who openly hates America should never be elected to Congress!",
        "timestamp": "2019-07-18 15:32:00"
    },
    {
        "message": "El Chapo was just sentenced to life in prison for the terror he inflicted on the United States and Mexico\n\nHe amassed a fortune of over 12 BILLION dollars during his crime career.\n\nShare if you think we should seize that money and use it to build the Wall!",
        "timestamp": "2019-07-17 16:55:09"
    },
    {
        "message": "Share if you believe Democrats are the ones who should be condemned NOT our great President Trump for defending our country!",
        "timestamp": "2019-07-16 23:27:50"
    },
    {
        "message": "Can someone please explain to me:\n\nHow is it racist to tell someone who quite literally hates our country that they are welcome to leave?\n\nIt doesn’t matter what race they are.\n\nAmerica is the only country where even those who hate it refuse to leave.",
        "timestamp": "2019-07-16 06:28:31"
    },
    {
        "message": "Ilhan Omar, who characterized the 9/11 terror attacks as \"some people did something\" was given the opportunity to condemn Al Qaeda today and refused to do so\n\nWhy should that be a hard group to condemn?\n\nWhy does she still have a seat on the House Foreign Affairs Committee?\n\nShare!",
        "timestamp": "2019-07-16 02:08:23"
    },
    {
        "message": "AOC wants to do away with border patrol and ICE\n\nDoes she know:\n\n52% of all Customs and Border Patrol agents are Hispanic\n\n33% are US Military Veterans\n\nIt wasn't enough to kill jobs in her district, now she wants to drastically increase Hispanic and Veteran unemployment\n\n🤔",
        "timestamp": "2019-07-15 22:04:08"
    },
    {
        "message": "The Mayors of:\n\nBaltimore\n\nChicago\n\n& New York City have all refused to cooperate with ICE in removing illegal aliens with final deportation orders\n\nThey’re putting illegal aliens over Americans\n\nRT if they should all be charged with obstruction of justice & removed from office!",
        "timestamp": "2019-07-15 06:15:31"
    },
    {
        "message": "Obama & Biden deported more people than Trump has\n\nObama & Biden built the detention facilities\n\nObama & Biden separated children from their families\n\nSo why does President Trump get demonized when he enforces the law?\n\nIf Democrats actually cared, they would have protested Obama",
        "timestamp": "2019-07-15 06:14:41"
    },
    {
        "message": "Bill De Blasio said Democrats would “do everything we can to protect” illegal aliens\n\nWhy won’t they do everything they can to protect American citizens?\n\nOver 2,000 illegals aliens suspected of murder are apprehended by ICE every year\n\nWhy won’t Democrats put America first?\n\n🤔",
        "timestamp": "2019-07-15 06:14:27"
    },
    {
        "message": "Share if any member of Congress who helps illegal aliens with deportation orders avoid ICE arrest should be removed from office immediately!",
        "timestamp": "2019-07-15 06:13:56"
    },
    {
        "message": "Border Patrol Agents just arrested a Mexican National attempting to re-enter the United States\n\nHe had 2 separate warrants out for the rape of a minor\n\nThis is just one of several convicted or wanted sexual predators stopped by CBP this week\n\nYet AOC calls these agents evil?\n\n🤔",
        "timestamp": "2019-07-15 06:11:47"
    },
    {
        "message": "Donald Trump underwent a 2.5 year investigation\n\nDuring that, imagine if he had:\n\nSmashed cell phones containing evidence\n\nDeleted 33,000 emails after a subpoena\n\nAnd lied repeatedly to Congress\n\nThere would be outrage!\n\nBut Hillary did just that.\n\nWhy did she get away with it?",
        "timestamp": "2019-07-15 06:11:33"
    },
    {
        "message": "HUGE:\n\n@Trump is saving our country\n\nHe's making America Great Again\n\nHe's teaching Conservatives how to fight\n\nAnd it's JUST been confirmed:\n\nThe President of the United States is speaking at TPUSA's Teen Student Action Summit!\n\nAPPLY NOW! 👉 TPUSA.com/TSAS",
        "timestamp": "2019-07-15 06:10:44"
    },
    {
        "message": "AOC Gets DESTROYED By Former ICE Director Thomas Homan After Trying To Grill Him About Immigration\n\nhttps://youtu.be/T3r5q3VhH1I",
        "timestamp": "2019-07-14 03:16:58"
    },
    {
        "message": "Sick:\n\nDemocrats in Nancy Pelosi’s House have now blocked the GOP’s Born Alive Infant Protection Act from getting a vote 69 times in 6 months\n\nImagine fighting that hard to stop a beating heart after a child’s been born\n\nWe have to take back the House in 2020.",
        "timestamp": "2019-07-12 21:17:13"
    },
    {
        "message": "Democrats are boycotting Home Depot because the founder supports Trump\n\nDo you know how many working-class people rely on Home Depot? \n\nThe left despises the very people they claim to represent\n\nThey don't fight for the working class, they fight against them!",
        "timestamp": "2019-07-11 00:00:39"
    },
    {
        "message": "I have no patience for athletes who represent America on the world stage and then once successful use their platform to push divisive messages and then refuse to visit the White House",
        "timestamp": "2019-07-10 18:19:19"
    },
    {
        "message": "Ilhan Omar just called America \"an extremely unjust society\"\n\nIsn't it strange that someone who:\n\nMigrated from a war-torn Somalia\n\nCame to the US from a Kenyan refugee camp\n\nAnd was able to be elected to the US Congress\n\nWould still constantly complain about America?\n\n🤔",
        "timestamp": "2019-07-10 15:19:07"
    },
    {
        "message": "This is your daily reminder that there is still ZERO accountability for what happened in Benghazi\n\nFour American heroes died.\n\nWhen will those who were responsible be held accountable?\n\nRT if sick of the Clintons getting away with everything!",
        "timestamp": "2019-07-10 03:20:00"
    },
    {
        "message": "Middle-Class Joe?\n\nNot anymore:\n\nAfter building his career on being the \"poorest member of the Senate\" Joe Biden's tax returns show that he's now worth over $15,600,000\n\nI wonder how much he'd be worth if you included his share of the $1.5B deal his son made with China?\n\n🤔",
        "timestamp": "2019-07-09 23:35:26"
    },
    {
        "message": "Joe Biden claims the reason he was embarrassed by Kamala Harris at the last debate is that he “wasn’t prepared”\n\nIf he wasn’t prepared to take on Kamala Harris, what makes anyone think he could take on:\n\nPutin\n\nChina\n\nOr Iran\n\n🤔",
        "timestamp": "2019-07-09 15:32:56"
    },
    {
        "message": "Did you know:\n\nIn Cuba, pregnant women, diabetics, and the elderly are forced to stand in line for 4+ hours to get rancid meat for nourishment\n\nThe government-run markets are without refrigeration and sometimes take days to restock\n\nThis is what Bernie’s ideas always lead to",
        "timestamp": "2019-07-09 06:38:45"
    },
    {
        "message": "HUGE:\n\nAfter President Trump’s incredible 4th of July speech, he’s polling at 50% in the latest Rasmussen poll\n\nAt this point in his presidency, Barack Obama was 3 points down in that poll\n\nHe recently hit his highest approval rating in another poll\n\nShare if you support Trump 2020!",
        "timestamp": "2019-07-09 05:56:05"
    },
    {
        "message": "Only 3 Democrats running for President have condemned the assault on a gay journalist by ANTIFA\n\nAnd one of them just dropped out.\n\n2 Democrats. Out of 24.\n\nImagine if President Trump was silent after a gang of terrorists claiming his ideology assaulted a journalist\n\nOutrage!",
        "timestamp": "2019-07-08 21:08:42"
    },
    {
        "message": "Does anyone else find it strange:\n\nThe same party that claims to care about the wellbeing of children on the border\n\n...Are perfectly fine with aborting a child 9 months into a pregnancy and even after they’re born\n\nAnd they want to lecture Republicans on morality?\n\n🤔",
        "timestamp": "2019-07-08 19:41:13"
    },
    {
        "message": "Isn’t it amazing how the left is okay with sending $1.5 billion to Iran and $500 million to Planned Parenthood but is offended and outraged to spend $2.5 million to celebrate America",
        "timestamp": "2019-07-08 05:43:18"
    },
    {
        "message": "Facts:\n\n1.4 million children go homeless in the United States every year\n\n440,000 American kids live in our foster care system\n\nShare if you want our leaders to put AMERICAN kids first and solve our problems in our own country!",
        "timestamp": "2019-07-08 05:43:13"
    },
    {
        "message": "NEW: Trump Supporters Group 🇺🇸\n\nIt's the best Trump supporters group on Telegram!\n\nBe advised this group is for serious supporters of President Trump only. We have discussions, memes, AMAs, and more.\n\nJoin here:\nhttps://t.me/Trump_Supporters",
        "timestamp": "2019-07-07 03:01:47"
    },
    {
        "message": "Share if you believe the Clintons should return every penny they got from the child pedophile Jeffrey Epstein!",
        "timestamp": "2019-07-07 02:57:14"
    },
    {
        "message": "Will AOC say anything about the six year old girl who had to delete her Twitter account because AOC supporters were ruthlessly attacking her and sending death threats?\n\nOr does she condone political violence when it’s against her political opponents?\n\nHer silence is telling",
        "timestamp": "2019-07-07 01:47:07"
    },
    {
        "message": "Did you know:\n\nBarack Obama was the first President in 190 years to not Include a citizenship question in his census\n\nNow activist judges are fighting to keep it off the Census permanently\n\nThis is all a part of the Democrat plan to radically reshape America\n\nThey must be stopped",
        "timestamp": "2019-07-05 20:18:15"
    },
    {
        "message": "Tough week for Democrats:\n\nPresident Trump’s 4th of July celebration was a massive success\n\nTheir candidates spent more time campaigning in Mexico than in America\n\nAOC gets exposed lying about border facilities\n\nIlhan Omar says she doesn’t think any 2020 Dem can beat Trump",
        "timestamp": "2019-07-05 19:22:52"
    },
    {
        "message": "President Trump is considering signing an Executive Order to get the Citizenship Question placed on the 2020 Census\n\nWe have to know who's living in our country illegally!\n\nShare if you support the President!",
        "timestamp": "2019-07-05 15:42:40"
    },
    {
        "message": "Despite the left’s best attempts at destroying a salute to America, the place is PACKED!\n\nGod bless @Trump and god bless America!",
        "timestamp": "2019-07-04 23:23:35"
    },
    {
        "message": "America is the greatest country ever to exist in the history of the world",
        "timestamp": "2019-07-04 15:03:36"
    },
    {
        "message": "Fact:\n\n59% of Americans oppose taxpayer-funded healthcare for illegal aliens\n\nYet every single Democrat has made it a top priority for their presidential campaign\n\nIf it wasn't clear before, it should be clear now:\n\n2020 Democrats don't care about the American people\n\nShare!",
        "timestamp": "2019-07-02 04:40:15"
    },
    {
        "message": "Democrats are perfectly ok with this. \n\nSick. \n\nSHARE so the media can't IGNORE!",
        "timestamp": "2019-07-02 04:34:09"
    },
    {
        "message": "Share if you believe any Mayor who tells their police to 'stand down' in the face of ANTIFA should be held to a criminal and civil standard for endangering their own citizens!",
        "timestamp": "2019-06-30 23:13:15"
    },
    {
        "message": "Beto O’ Rourke is campaigning for President this week\n\n...In Mexico.\n\nHe’ll be talking with illegals who were denied entry\n\nAt least he’s honest about the Democrats’ true agenda:\n\nPutting illegal alien interests over Americans.\n\nShameful!",
        "timestamp": "2019-06-30 21:04:57"
    },
    {
        "message": "If Hillary Clinton was President we would have a war in North Korea and Iran\n\nTrump is a \"peacemaker!\" \n\nUsing strength and toughness he exerts America's dominance, without war, and using dialogue! \n\nThis is what REAL diplomacy looks like\n\nTotal win!\n\nNobel Peace Prize?",
        "timestamp": "2019-06-30 21:04:34"
    },
    {
        "message": "Barack Obama was given the Nobel Peace Prize in 2009\n\nOver the next 8 years:\n\nISIS was created\n\n4 Americans died in Benghazi\n\nNorth Korea created ICBMs & tested nuclear\n\nOver 100 dead civilians from drone strikes\n\nSo why does he have a \"peace\" prize & Trump doesn't?\n\n🤔",
        "timestamp": "2019-06-30 21:04:25"
    },
    {
        "message": "Share if you think it’s time to classify ANTIFA as a domestic terror organization\n\nIf Trump supporters did this to a liberal, people would be in prison and media non stop covering",
        "timestamp": "2019-06-30 06:15:33"
    },
    {
        "message": "Share if you believe illegals who are in our prisons should be DEPORTED back to their home country not fed and housed by the US taxpayer!",
        "timestamp": "2019-06-30 06:14:53"
    },
    {
        "message": "Breaking:\n\nA NPR/PBS NewsHour/Marist poll shows Hispanic-Latino approval of President Donald Trump’s job performance jumped 19 points in the past month, hitting, hitting 50% in January\n\nHispanics want LEGAL immigration and a wall!",
        "timestamp": "2019-06-30 06:14:19"
    },
    {
        "message": "San Francisco's Board of Education just voted to spend $600K to paint over a high school's mural of George Washington\n\nDid you know:\n\nSan Francisco has more homeless drug users than students enrolled in high school\n\nPerhaps instead of erasing history, they could address that.\n\n🤔",
        "timestamp": "2019-06-30 06:13:58"
    },
    {
        "message": "Why wasn’t Joe Biden asked why he and Barack Obama created and ran the “concentration camps” AOC claims are operating at the border?\n\nWhy wasn’t he asked about the billions the Chinese government have given his family?\n\nThe DNC is propping him up!\n\nAmerica needs answers!",
        "timestamp": "2019-06-30 06:13:49"
    },
    {
        "message": "Did you know:\n\nA poll of likely voters finds that 56% of likely voters oppose taxpayer funded health insurance for illegals\n\nSo why do Democrats so passionately support the idea?\n\nSimple:\n\nBecause they care about importing new illegal voters more than they care about Americans.",
        "timestamp": "2019-06-30 06:13:39"
    },
    {
        "message": "Every. Single. Hand. \n\nEvery. SINGLE HAND went up when asked if they would give free healthcare to illegals who broke our laws to get into America\n\nThey broke our laws and now reward them with free stuff?\n\nDemocrats just want to buy votes!\n\nWhile Vets die on the streets\n\nSick!",
        "timestamp": "2019-06-28 18:34:30"
    },
    {
        "message": "The two choices for the future of America has never been more clear\n\nOnly one side supports post birth abortion of newborns\n\nOnly one side openly stands against Israel\n\nOnly one side embraces socialism\n\nOnly one side hates America\n\nOnly one side has ruined our inner cities",
        "timestamp": "2019-06-28 15:31:43"
    },
    {
        "message": "Canadian Socialized healthcare:\n\n1 million Canadians had to wait weeks for healthcare—the highest number ever recorded\n\nPatients forfeited $1,800 in lost wages by waiting for healthcare\n\nWait times increased 377% under socialized medicine\n\nThis is Bernie's healthcare plan\n\nShare!",
        "timestamp": "2019-06-28 02:35:03"
    },
    {
        "message": "Share if only AMERICAN CITIZENS should be counted on the United States Census!",
        "timestamp": "2019-06-27 15:17:00"
    },
    {
        "message": "I fear for a country that isn’t allowed to ask people living within its own borders whether they are citizens or not.",
        "timestamp": "2019-06-27 15:16:46"
    },
    {
        "message": "If we only counted US citizens in the census instead of illegal foreign nationals, California, New York, and Illinois would lose a combined 18 electoral votes\n\nThis is why the Democrats want illegals to be counted in the census",
        "timestamp": "2019-06-27 15:16:33"
    },
    {
        "message": "Joe Biden's son is STILL involved with the Chinese State-sponsored equity firm despite the credible allegations against him and the former VP\n\nWhy are Joe Biden and his family still profiting from his corruption as Vice President?\n\nChina owns the Biden family!\n\nCorrupt!",
        "timestamp": "2019-06-27 15:16:22"
    },
    {
        "message": "This is your daily reminder that Democrats shut down the government\n\nLeft thousands of workers without paychecks\n\nBecause they said there was no crisis at the southern border\n\nNow they’re saying there are concentration camps and a humanitarian crisis?\n\n🤔",
        "timestamp": "2019-06-27 15:16:12"
    },
    {
        "message": "Share if you believe ENGLISH should be the official language of the United States",
        "timestamp": "2019-06-27 15:15:35"
    },
    {
        "message": "Elizabeth Warren is a fake Indian\n\nRobert “Beto” O’ Rourke is a fake Mexican\n\nBernie Sanders is a fake socialist, while he has 3 houses, flies on private jets, and is worth millions\n\nDemocrats can only win by pretending to be someone they aren’t",
        "timestamp": "2019-06-27 15:15:16"
    },
    {
        "message": "This is your daily reminder that Democrats shut down the government\n\nLeft thousands of workers without paychecks\n\nBecause they said there was no crisis at the southern border\n\nNow they’re saying there are concentration camps and a humanitarian crisis?\n\n🤔",
        "timestamp": "2019-06-27 06:23:09"
    },
    {
        "message": "Isn’t it odd:\n\nNBC didn’t spend any time asking Elizabeth Warren about how she’s spent her entire life lying about being a Native American\n\nImagine if the President had lied about his ethnicity for decades\n\nLiberal privilege!",
        "timestamp": "2019-06-27 06:22:59"
    },
    {
        "message": "Elizabeth Warren wants massive gun confiscation\n\nShe wants to take your guns away\n\nShe uses armed guards\n\nShe allows others to be armed to protect her\n\nShe wants to disarm America\n\nShe wants to disarm you and your family",
        "timestamp": "2019-06-27 06:22:24"
    },
    {
        "message": "Did you know:\n\nCory Booker has taken nearly $400,000 from the pharmaceutical lobby while regularly voting against lower drug prices\n\n…And then he campaigns on the platform that drug and healthcare prices are too high\n\nHow can he stand on the debate stage and lie to America?\n\n🤔",
        "timestamp": "2019-06-27 06:22:09"
    },
    {
        "message": "I have never seen a group of people try convince the public things are bad when we have the best economy in US history, wages going up, jobs coming back to our country, and lowest ever black, Latino, and Asian unemployment\n\nDemocrats want Trump to fail more than America succeed",
        "timestamp": "2019-06-27 06:21:56"
    },
    {
        "message": "Big tech censoring conservatives is the defining issue of our time\n\nWe need decisive action against these tech oligarchs who want to destroy conservatives\n\nIf we don’t get this right, they will silence all of us!",
        "timestamp": "2019-06-27 00:43:55"
    },
    {
        "message": "NEW: Trump Supporters Group 🇺🇸\n\nIt's the forum of choice for The President of The United States, Donald Trump!\n\nBe advised this forum is for serious supporters of President Trump only. We have discussions, memes, AMAs, and more.\n\nJoin here:\nhttps://t.me/Trump_Supporters",
        "timestamp": "2019-06-26 19:55:39"
    },
    {
        "message": "Maxine Waters should be held accountable for inciting violence against Eric Trump\n\nShe called for the mob to attack Trump, his family, and allies\n\nThe left has become a violent mob\n\nThey can’t win debates so instead they resort to violence\n\nDanger!",
        "timestamp": "2019-06-26 15:04:40"
    },
    {
        "message": "Democrats: There is a crisis on the Southern border! Children don't have enough beds!\n\nWayfair: We'll provide beds!\n\nAlso Democrats: Evil! Boycott Wayfair! They're supplying beds!\n\nHow can anyone take this party seriously?\n\n🤔",
        "timestamp": "2019-06-26 15:04:28"
    },
    {
        "message": "Mueller wants to testify?\n\nBRING IT ON\n\nQuestions:\n\nWhy did you ignore Hillary selling our country out to the Russians?\n\nDid you know Strzok and Page were corrupt lovers when you hired them?\n\nDid you investigate FusionGPS?\n\nWhy didn’t you charge Comey with lying and leaking?\n\nShare!",
        "timestamp": "2019-06-26 13:37:02"
    },
    {
        "message": "Share if you think it’s time for a full criminal investigation into John Kerry and his working with Iran behind the scenes and illegals dishing out billions to them as Secretary of State!",
        "timestamp": "2019-06-26 13:36:38"
    },
    {
        "message": "Eric Trump gets spit on in Chicago\n\nMedia barely covers and ignores\n\nIf Chelsea Clinton was spit on there would be protests in the streets and non stop media coverage\n\nDemocrat privilege means you can assault a son of a President and get away with it",
        "timestamp": "2019-06-26 13:36:13"
    },
    {
        "message": "Presidential Net Worth before and after being elected:\n\nBefore:\n\nBill & Hillary Clinton—$480,000\n\nThe Obamas—$3M\n\nDonald Trump—$4.5B\n\nAfter:\n\nClintons—$100M+\n\nObamas—$40M+\n\nTrump—$3.5B\n\nTrump sacrificed his wealth for our nation, the rest sacrificed our nation for their wealth",
        "timestamp": "2019-06-26 10:01:47"
    },
    {
        "message": "President Trump is saving our country\n\nWe should be thankful to GOD he is our President\n\nGod bless America\n\nGod Bless Trump\n\n@trump fights for our country despite relentless attacks\n\nHe stays focused on the mission\n\nHe delivers results\n\nWE have his back!\n\n6 MORE YEARS",
        "timestamp": "2019-06-26 01:41:45"
    },
    {
        "message": "Did you know:\n\nThe crisis at the southern border has gotten so bad, we’ve been forced to send TSA personnel to help apprehend drugs & immigrants\n\nIf we’re sending the TSA, we’re sending the last best thing we have to defend our border\n\nIf this isn’t a crisis I don’t know what is",
        "timestamp": "2019-06-26 01:41:07"
    },
    {
        "message": "Did you know:\n\nGoogle employees gave 1,315,000 dollars to Hillary Clinton in 2016\n\nGoogle employee contributions to Donald Trump: ZERO dollars\n\nAre we still supposed to believe Google didn't rig their search results to interfere in the 2016 election?\n\nINVESTIGATE!",
        "timestamp": "2019-06-26 01:40:56"
    },
    {
        "message": "\"Middle-Class\" Joe Biden's demands for speaking engagements:\n\n$200,000 fee\n\n$10,000 chartered flight\n\nA full-length mirror\n\n6 chairs with straight backs\n\nA portable steamer\n\nCoke Zero, regular Coke, & orange Gatorade\n\nAngel hair pomodoro\n\nCaprese salad\n\nAnd raspberry sorbet\n\n🤔",
        "timestamp": "2019-06-26 01:40:35"
    },
    {
        "message": "This is your daily reminder @TrumpJr had to give over 30 HOURS of testimony for taking a single meeting while Hillary gets off free for selling our Uranium for cash and Hunter Biden in collusion with his father sold out country to Chinese for billions\n\nNational DISGRACE!",
        "timestamp": "2019-06-26 01:40:09"
    },
    {
        "message": "Joe Biden is a millionaire after 50 years in government\n\nHis son has done massive, corrupt deals with China & Ukraine\n\nI care much more about how career politicians got rich then how a wealthy businessman became a politician\n\nInvestigate this corruption!",
        "timestamp": "2019-06-26 01:39:45"
    },
    {
        "message": "Insanity:\n\nFresno California is creating a program to pay 1.5 MILLION dollars to violent gang members to \"encourage\" them to live a clean life\n\nThis is how Democrats spend taxpayer dollars \n\nThis is how Nancy Pelosi, Kamala Harris, and Eric Swalwell would run America!",
        "timestamp": "2019-06-26 01:39:35"
    },
    {
        "message": "Did you know:\n\nCalifornia has 22% of the nation's homeless\n\nRats are taking over their city facilities\n\nMedieval diseases like Typhus & the Plague are resurfacing in their streets\n\nYet they just approved a 4% pay increase for their Governor & legislators\n\n🤔",
        "timestamp": "2019-06-26 01:39:18"
    },
    {
        "message": "I wonder how Iran paid for the mines they bombed the tankers with\n\nOr the rockets they use to shoot at our drone\n\nOr the Uranium they've been stockpiling?\n\nCould the $1.8 billion in cash that Barack Obama & Joe Biden delivered to them have helped?\n\n🤔",
        "timestamp": "2019-06-26 01:38:56"
    },
    {
        "message": "This is your daily reminder that Ilhan Omar’s taxes are riddled with tax fraud, abuse, phony marriages, and possible immigration fraud\n\nDemocrats and the media have relentlessly hounded the President for his tax returns for 4 years\n\nWhy do they ignore Omar’s?\n\n🤔",
        "timestamp": "2019-06-26 01:38:39"
    },
    {
        "message": "Let me get this straight:\n\nDemocrats can roll out 32 trillion dollar Green New Deals\n\nAnd 2.2 trillion dollar student loan forgiveness programs\n\nBut they refuse to fund 4.5 billion dollars to fix the humanitarian crisis on the border?\n\n🤔",
        "timestamp": "2019-06-26 01:38:29"
    },
    {
        "message": "Did you know:\n\nJoe Biden was once the poorest member of the Senate\n\nNow, he's worth millions!\n\nHe rents a home at $20,000 a month and owns another worth $3 million\n\nAnd he hasn't released his tax returns yet\n\nHow do you get that rich spending your whole life in government?\n\n🤔",
        "timestamp": "2019-06-26 01:31:38"
    },
    {
        "message": "This is what a monopoly looks like:\n\nYouTube, which is owned by Google, recently took down the video exposing a Google executive talking about their role in interfering with the 2016 election\n\nThis is a MAJOR problem!",
        "timestamp": "2019-06-26 01:31:28"
    },
    {
        "message": "Remember when the President said he would secure the border and Mexico would pay for it one way or another?\n\nIt's happening.\n\n15,000 Mexican troops have been deployed to our southern border to stop illegal immigration\n\nAND the wall is being built!\n\nPromises made, promises kept.",
        "timestamp": "2019-06-25 03:47:49"
    },
    {
        "message": "Maxine Waters has sided with Iran over the US intelligence community in blaming America for \"provoking\" the attack on our unmanned drone\n\nShe's a propaganda arm for Iran!\n\nRT if anyone who sides with a rogue terrorist nation over our own should be removed from Congress!",
        "timestamp": "2019-06-25 03:47:41"
    },
    {
        "message": "Mayor Pete can't handle riots in his small town in Indiana\n\nWhat makes Democrats think he could take on Putin or China?\n\nYou can't be a good president if you're not even a good mayor of the 4th largest town in the 38th largest state.",
        "timestamp": "2019-06-25 03:47:33"
    },
    {
        "message": "This is the footage of Jussie Smollett after his failed attempt to start a race war with his hate crime hoax\n\nWhy did he still have the rope around his neck in his apartment hours later?\n\nWhy was his manager there escorting the cops to his apartment?\n\nInvestigate and prosecute!\n\nhttps://twitter.com/charliekirk11/status/1143300337039659008?s=21",
        "timestamp": "2019-06-25 03:47:25"
    },
    {
        "message": "Democrats aren't running on ideas in 2020, they're running on bribes:\n\nFree college\n\nFree healthcare\n\nFree money for those \"unwilling to work\"\n\nFree housing\n\nFree slavery reparations\n\nFree LGBTQ reparations\n\nIf you think something is expensive now, just wait until it's \"free\"",
        "timestamp": "2019-06-25 03:47:06"
    },
    {
        "message": "How can Joe Biden build his entire campaign on the Charlottesville \"Very fine people\" lie yet spend the majority of his campaign stops praising segregationists?\n\n🤔",
        "timestamp": "2019-06-25 03:46:57"
    },
    {
        "message": "Mexican officials are on high alert to intercept lone wolf ISIS fighters attempting to enter the United States through the southern border\n\nInstead of working with the President on immigration, Democrats would rather leave our border open to terrorism\n\nShameful!",
        "timestamp": "2019-06-25 03:46:49"
    },
    {
        "message": "This is your daily reminder that the best that Barack Obama could do to prevent Russian meddling was telling Putin to \"Cut it out\"\n\nPresident Trump has:\n\nImposed crippling sanctions\n\nExpelled Russian ambassadors\n\nStrengthened NATO against Putin's wishes\n\nObama was WEAK on Russia!",
        "timestamp": "2019-06-25 03:46:38"
    },
    {
        "message": "WOW:\n\nA top Google executive was caught on tape admitting to meddling in our elections!\n\n\"We all got screwed in 2016 - how do we prevent it from happening again?\"\n\n\"We're also training our algorithms. If 2016 happened again, would we have different outcomes?\"\n\nInvestigate! \n\nShare!",
        "timestamp": "2019-06-25 03:46:29"
    },
    {
        "message": "Has anyone noticed:\n\nEverything Democrats say they hate about America's history was perpetrated by their party:\n\nSlavery\n\nSegregation\n\nThe KKK\n\nRepublicans:\n\nWent to war to end slavery\n\nVoted overwhelmingly for civil rights\n\nAnd vehemently opposed the KKK\n\nKnow the truth!",
        "timestamp": "2019-06-25 03:46:13"
    },
    {
        "message": "Finally able to share!\n\nI’m excited to announce that my new podcast THE CHARLIE KIRK SHOW launches this Wednesday exclusively on Apple Podcasts\n\nI’ll announce my INCREDIBLE first guest tomorrow!\n\nI‘d be honored if you were one of my first subscribers!\n\nhttps://podcasts.apple.com/us/podcast/the-charlie-kirk-show/id1460600818",
        "timestamp": "2019-06-25 03:45:14"
    }
]