[
    {
        "message": "RT @DineshDSouza: My new podcast! Two episodes down, another going up this evening. I want it to be timely, educational, entertaining. If you like what you hear, please give it a 5-star review https://t.co/kdvzv0gpx1\n— See More",
        "timestamp": "2021-01-13 21:08:34"
    },
    {
        "message": "RT @DineshDSouza: Republicans are putting their own future prospects of becoming an electoral majority in mortal danger if they go along with this sham impeachment. WATCH: https://t.co/k63IH4kQEX\n— See More",
        "timestamp": "2021-01-13 21:08:32"
    },
    {
        "message": "RT @MrAndyNgo: BLM and Antifa openly organizing riots on the platform is something that doesn’t get censored. https://t.co/IARg1slTXk\n— See More",
        "timestamp": "2021-01-13 21:08:31"
    },
    {
        "message": "RT @laurenboebert: Twitter randomly shut my account down with no explanation. They do this to thousands of conservatives every single day. When the press reported the ban, it was lifted. What about the thousands of Americans who have been banned and are never heard from again?\n— See More",
        "timestamp": "2021-01-13 21:08:29"
    },
    {
        "message": "RT @BuckSexton: Every time I try to open my Parler app and can’t because of big tech censorship, I’m reminded that the most powerful enemies of free speech got where they are by pretending to be its greatest advocates\n— See More",
        "timestamp": "2021-01-13 21:08:28"
    },
    {
        "message": "RT @JamesOKeefeIII: Houston Chronicle: \"Texas woman arrested on election fraud charges based on Project Veritas video.” REAL JOURNALISM. REAL RESULTS. We’re just getting started. https://t.co/4TEtAzlaG1\n— See More",
        "timestamp": "2021-01-13 21:08:27"
    },
    {
        "message": "An Israeli human rights lawyer exposes how Twitter permits, even encourages, forms of violence that fit within its political ideology https://t.co/1HyFYlfmOr\n— See More",
        "timestamp": "2021-01-13 21:08:26"
    },
    {
        "message": "President Trump was banned from just about every social media platform so @Jim_Jordan just read his new statement from the House floor. https://t.co/Z7FSz30IJy\n— See More",
        "timestamp": "2021-01-13 20:08:19"
    },
    {
        "message": "Why won't the media show this part of the speech? And what about this revealing timeline of events? Here's the truth. For the full podcast: WATCH: https://t.co/IrlSO6pZRX LISTEN: https://t.co/PZqj2veTXT https://t.co/WwBidu73oj\n— See More",
        "timestamp": "2021-01-13 20:08:18"
    },
    {
        "message": "RT @DineshDSouza: AOC's Instagram livestream last night was quite something... https://t.co/CddSaw6l5H\n— See More",
        "timestamp": "2021-01-13 20:08:17"
    },
    {
        "message": "RT @DineshDSouza: Liberals really aren't liking how @mattgaetz just totally exposed their double standards from the House floor... WATCH: https://t.co/JcMZEK7Fhf\n— See More",
        "timestamp": "2021-01-13 20:08:15"
    },
    {
        "message": "RT @DineshDSouza: What is the left's end game? They will never come right out and say it. However, it is crucial that conservatives understand if they truly want to defeat the twisted ideology. For the full podcast: WATCH: https://t.co/IrlSO6HBgx LISTEN: https://t.co/PZqj2vwvmt https://t.co/Nh4f98tC9S\n— See More",
        "timestamp": "2021-01-13 20:08:13"
    },
    {
        "message": "The left doesn't actually care about violent rhetoric when they compare the president of the United States to a terrorist. https://t.co/TPHCqjoq0I\n— See More",
        "timestamp": "2021-01-13 20:08:11"
    },
    {
        "message": "RT @DineshDSouza: Democrats are now claiming Republican members of Congress was helping the protesters through the Capitol on January 6... But is there proof? WATCH: https://t.co/amhIRwZPUP\n— See More",
        "timestamp": "2021-01-13 20:08:10"
    },
    {
        "message": "RT @DineshDSouza: Republicans are putting their own future prospects of becoming an electoral majority in mortal danger if they go along with this sham impeachment https://t.co/SKHayQtEzt\n— See More",
        "timestamp": "2021-01-13 20:08:09"
    },
    {
        "message": "RT @DineshDSouza: If the GOP had any sense, it would be figuring out a way to get a handful of Democratic votes so it can successfully impeach BIDEN in his first year\n— See More",
        "timestamp": "2021-01-13 20:08:07"
    },
    {
        "message": "WILD moment from the House floor as @mattgaetz triggered a total Democrat meltdown when he called out Democrats for lighting cities on fire. They literally started screaming at him! WATCH: https://t.co/8VDVM0y7FC\n— See More",
        "timestamp": "2021-01-13 19:08:23"
    },
    {
        "message": "WATCH: @Jim_Jordan EXPLODES On Senate Floor Over Impeachment https://t.co/Tk3bIGgQpe\n— See More",
        "timestamp": "2021-01-13 19:08:22"
    },
    {
        "message": "Republicans are putting their own future prospects of becoming an electoral majority in mortal danger if they go along with this sham impeachment. WATCH: https://t.co/k63IH4kQEX\n— See More",
        "timestamp": "2021-01-13 19:08:21"
    },
    {
        "message": "Louie Gohmert just flipped the script read Nancy Pelosi's own words calling for an uprising over the summer. The best part? Democrats are already taking it out of context not realizing they're dunking on Pelosi. https://t.co/uMxWOWQhTa\n— See More",
        "timestamp": "2021-01-13 19:08:20"
    },
    {
        "message": "I don't normally do this, but I'm asking everyone to WATCH and SHARE this video of @JimJordanOH's case against impeachment just now. It's so important America hears how absurd this all is. https://t.co/M4RIeOJZ22\n— See More",
        "timestamp": "2021-01-13 18:08:10"
    },
    {
        "message": "RT @CalebJHull: Nancy Pelosi speaking on the House floor about impeachment while her impeachment manager who slept with a Chinese spy in his office sits right behind her is quite something. https://t.co/k7Ru1FRdge\n— See More",
        "timestamp": "2021-01-13 18:08:09"
    },
    {
        "message": "What is the left's end game? They will never come right out and say it. However, it is crucial that conservatives understand if they truly want to defeat the twisted ideology. For the full podcast: WATCH: https://t.co/IrlSO6HBgx LISTEN: https://t.co/PZqj2vwvmt https://t.co/Nh4f98tC9S\n— See More",
        "timestamp": "2021-01-13 18:08:07"
    },
    {
        "message": "Liberals really aren't liking how @mattgaetz just totally exposed their double standards from the House floor... WATCH: https://t.co/JcMZEK7Fhf\n— See More",
        "timestamp": "2021-01-13 17:08:14"
    },
    {
        "message": "AOC's Instagram livestream last night was quite something... https://t.co/CddSaw6l5H\n— See More",
        "timestamp": "2021-01-13 17:08:13"
    },
    {
        "message": "My podcast has only just started but the response has been phenomenal! I'd be honored if you'd subscribe and leave a 5⭐️ review so we can climb the charts and beat out podcasts like the New York Times! SUBSCRIBE: https://t.co/PZqj2vwvmt\n— See More",
        "timestamp": "2021-01-13 17:08:12"
    },
    {
        "message": "AOC really just called for \"liberation of southern states\" to \"heal\" our country. No, really. WATCH https://t.co/EdFRgPZckk\n— See More",
        "timestamp": "2021-01-13 17:08:11"
    },
    {
        "message": "Democrats are now claiming Republican members of Congress was helping the protesters through the Capitol on January 6... But is there proof? WATCH: https://t.co/amhIRwZPUP\n— See More",
        "timestamp": "2021-01-13 16:08:38"
    },
    {
        "message": "@Ammie508 Shouldn’t you be asking yourself this?\n— See More",
        "timestamp": "2021-01-13 16:08:36"
    },
    {
        "message": "Republicans are putting their own future prospects of becoming an electoral majority in mortal danger if they go along with this sham impeachment https://t.co/SKHayQtEzt\n— See More",
        "timestamp": "2021-01-13 16:08:35"
    },
    {
        "message": "If the GOP had any sense, it would be figuring out a way to get a handful of Democratic votes so it can successfully impeach BIDEN in his first year\n— See More",
        "timestamp": "2021-01-13 16:08:33"
    },
    {
        "message": "RT @Techno_Fog: Dangerous rhetoric from the Washington Post: \"Will the GOP turn into Hezbollah?\" For those who don't remember, Hezbollah was linked to the 1983 Beirut bombing that killed 200+ Marines. The State Department has them designated as a Foreign Terrorist Organization. https://t.co/hDoCzNx20h\n— See More",
        "timestamp": "2021-01-13 16:08:32"
    },
    {
        "message": "RT @realromaboma: Subscribed! Thank you for your voice @DineshDSouza https://t.co/CtP0ZGr8no\n— See More",
        "timestamp": "2021-01-13 15:08:16"
    },
    {
        "message": "@QrazymanMick Also on Spotify. Video version on YouTube and Rumble\n— See More",
        "timestamp": "2021-01-13 15:08:15"
    },
    {
        "message": "RT @ggreenwald: The @ACLU spent years suing over the no-fly list, insisting it was a grave abuse of power. Does ACLU have a position on Schumer's call for Americans to be put on that list with no trial, and the Chair of the House Homeland Security Comm calling for 2 Senators to be put on it? https://t.co/AIagx589of\n— See More",
        "timestamp": "2021-01-13 15:08:13"
    },
    {
        "message": "My new podcast! Two episodes down, another going up this evening. I want it to be timely, educational, entertaining. If you like what you hear, please give it a 5-star review https://t.co/kdvzv0gpx1\n— See More",
        "timestamp": "2021-01-13 14:08:39"
    },
    {
        "message": "RT @DineshDSouza: Which of the two impeachments was the dumber one? How Never Trumpers cash their checks. And a fresh look at Orwell. BIG BROTHER PAYS A VISIT — Dinesh D’Souza Podcast Ep. 2 https://t.co/6JUXrJWhba via @YouTube\n— See More",
        "timestamp": "2021-01-13 14:08:38"
    },
    {
        "message": "RT @CrockerLeyna: @DineshDSouza thank you for your knowledge!!! #TRUMP2020ToSaveAmerica https://t.co/1GnlFyouvv\n— See More",
        "timestamp": "2021-01-13 14:08:37"
    },
    {
        "message": "RT @pnjaban: Meanwhile, the Antifa moron book-burners who shut down @Powells two days in a row, boosted @MrAndyNgo’s book from #1,616 to #1 on Amazon, three spots Obama’s latest book! It comes out February 2! https://t.co/BcPmZjz44y\n— See More",
        "timestamp": "2021-01-13 14:08:36"
    },
    {
        "message": "RT @paulsperry_: Funny, dont remember the DC mayor offering $1000 rewards for information leading to the arrest of the BLM rioters who damaged public property across from the White House. Also dont recall the FBI launching 170+ coast-to-coast investigations of BLM or Antifa thugs. #Doublestandard\n— See More",
        "timestamp": "2021-01-13 14:08:35"
    },
    {
        "message": "RT @DineshDSouza: Episode 2 is up! The first one already drew huge numbers. This one is even better. I cover the two stupid impeachments, how Parler can turn the lights back on, and I go full savage on the Never Trumpers including a fellow named Bill Kristol https://t.co/ydBgS2ceT9\n— See More",
        "timestamp": "2021-01-13 13:08:21"
    },
    {
        "message": "RT @DineshDSouza: Which of the two impeachments was the dumber one? How Never Trumpers cash their checks. And a fresh look at Orwell. BIG BROTHER PAYS A VISIT — Dinesh D’Souza Podcast Ep. 2 https://t.co/6JUXrJWhba via @YouTube\n— See More",
        "timestamp": "2021-01-13 13:08:19"
    },
    {
        "message": "RT @Bernard_HG: @DineshDSouza interviews his Venezuelan wife. #Americans need to be aware of possible tsunami that is coming. https://t.co/TzfHpEbPje\n— See More",
        "timestamp": "2021-01-13 13:08:18"
    },
    {
        "message": "RT @Debber66: Would the left prosecute someone because they didn’t agree with their ideology for an exact crime that when done by them is no big deal - YES, that someone is my hubby! Listen or watch his daily podcast! #DineshDSouzaPodcast https://t.co/TQHOUNM5g1\n— See More",
        "timestamp": "2021-01-13 13:08:16"
    },
    {
        "message": "Which of the two impeachments was the dumber one? How Never Trumpers cash their checks. And a fresh look at Orwell. BIG BROTHER PAYS A VISIT — Dinesh D’Souza Podcast Ep. 2 https://t.co/6JUXrJWhba via @YouTube\n— See More",
        "timestamp": "2021-01-13 06:08:13"
    },
    {
        "message": "RT @danielchaitin7: Hannity tells his Fox audience “we” spoke to Mitch McConnell’s office about the big New York Times report tonight saying the Senate majority leader believes Trump committed impeachable offenses, and they said it is full of “salacious nonsense” https://t.co/IadeYJGlIW\n— See More",
        "timestamp": "2021-01-13 04:27:42"
    },
    {
        "message": "RT @ggreenwald: Look at what this liberal NYT columnist is saying. She's saying she's \"disturbed\" at how \"dangerous\" it is \"to have a handful of callow young tech titans in charge of who has a megaphone,\" but as long as they use that power to censor her adversaries, not her allies, she's happy: https://t.co/bh7XDUmVL5\n— See More",
        "timestamp": "2021-01-13 04:27:41"
    },
    {
        "message": "RT @DineshDSouza: Apparently for the Left and the media, an #Antifa or #BLM riot is not a “riot” while a #MAGA event that was manifestly not a riot becomes a “riot.” No sensible person can believe such transparent lies. Deep down, the liars themselves know what they are doing #CapitolRiots\n— See More",
        "timestamp": "2021-01-13 04:27:40"
    },
    {
        "message": "RT @DineshDSouza: A warning about the socialist left in America from @Debber66... https://t.co/r0oWMbcO9M\n— See More",
        "timestamp": "2021-01-13 04:27:39"
    },
    {
        "message": "RT @DineshDSouza: High comedy! You can’t make this stuff up https://t.co/mqNLiOolAG\n— See More",
        "timestamp": "2021-01-13 04:08:10"
    },
    {
        "message": "RT @DineshDSouza: For too long, the GOP has accepted the left's narrative and applied a double standard to itself! We have to solve this psychological mystery if the GOP wants to start winning again. For the full podcast: https://t.co/IrlSO6HBgx https://t.co/mPKBw57EC2\n— See More",
        "timestamp": "2021-01-13 03:08:34"
    },
    {
        "message": "RT @DineshDSouza: Episode 2 is up! The first one already drew huge numbers. This one is even better. I cover the two stupid impeachments, how Parler can turn the lights back on, and I go full savage on the Never Trumpers including a fellow named Bill Kristol https://t.co/ydBgS2ceT9\n— See More",
        "timestamp": "2021-01-13 03:08:33"
    },
    {
        "message": "RT @DineshDSouza: Here’s today’s episode on Apple. Please subscribe and, if you like what you hear, rate me 5 stars! Warning: I go full savage in this one on the Never Trumpers including one Bill Kristol https://t.co/PZqj2vwvmt\n— See More",
        "timestamp": "2021-01-13 03:08:32"
    },
    {
        "message": "RT @Debber66: What they have done to this man is unforgivable !!!!\n— See More",
        "timestamp": "2021-01-13 03:08:31"
    },
    {
        "message": "RT @LibertarianBlue: The backstory is that Twitter and other tech giants tried to interfere in the Ugandan election by mass-banning certain accounts. So Uganda took the entirely appropriate step of leveling the playing field by banning Twitter altogether. The U.S. should have done the same in 2020. https://t.co/RnFj9o3rQC\n— See More",
        "timestamp": "2021-01-13 02:08:27"
    },
    {
        "message": "Apparently for the Left and the media, an #Antifa or #BLM riot is not a “riot” while a #MAGA event that was manifestly not a riot becomes a “riot.” No sensible person can believe such transparent lies. Deep down, the liars themselves know what they are doing #CapitolRiots\n— See More",
        "timestamp": "2021-01-13 02:08:26"
    },
    {
        "message": "Here’s today’s episode on Apple. Please subscribe and, if you like what you hear, rate me 5 stars! Warning: I go full savage in this one on the Never Trumpers including one Bill Kristol https://t.co/PZqj2vwvmt\n— See More",
        "timestamp": "2021-01-13 02:08:25"
    },
    {
        "message": "Episode 2 is up! The first one already drew huge numbers. This one is even better. I cover the two stupid impeachments, how Parler can turn the lights back on, and I go full savage on the Never Trumpers including a fellow named Bill Kristol https://t.co/ydBgS2ceT9\n— See More",
        "timestamp": "2021-01-13 01:08:16"
    },
    {
        "message": "A warning about the socialist left in America from @Debber66... https://t.co/r0oWMbcO9M\n— See More",
        "timestamp": "2021-01-13 01:08:16"
    },
    {
        "message": "RT @DineshDSouza: BREAKING: Trump has a message for Joe Biden... and of course it's savage: \"The 25th Amendment is of zero risk to me, but will come back to haunt Joe Biden and the Biden administration...\" WATCH: https://t.co/PEC6ibAypp\n— See More",
        "timestamp": "2021-01-13 01:08:14"
    },
    {
        "message": "RT @DineshDSouza: Their new plan to force Trump out of office ultimately will come down to Mitch McConnell and the Senate. For the full podcast: WATCH: https://t.co/IrlSO6HBgx LISTEN: https://t.co/PZqj2vwvmt https://t.co/xeH84Dx09a\n— See More",
        "timestamp": "2021-01-13 00:08:20"
    },
    {
        "message": "RT @DineshDSouza: This opening monologue from Tucker Carlson is an absolute must-watch: https://t.co/PeN5fk0KwM\n— See More",
        "timestamp": "2021-01-13 00:08:19"
    },
    {
        "message": "For too long, the GOP has accepted the left's narrative and applied a double standard to itself! We have to solve this psychological mystery if the GOP wants to start winning again. For the full podcast: https://t.co/IrlSO6HBgx https://t.co/mPKBw57EC2\n— See More",
        "timestamp": "2021-01-12 22:08:13"
    },
    {
        "message": "BREAKING: Trump has a message for Joe Biden... and of course it's savage: \"The 25th Amendment is of zero risk to me, but will come back to haunt Joe Biden and the Biden administration...\" WATCH: https://t.co/PEC6ibAypp\n— See More",
        "timestamp": "2021-01-12 22:08:12"
    },
    {
        "message": "👀👀👀 https://t.co/N3zAFsMfiw\n— See More",
        "timestamp": "2021-01-12 22:08:11"
    },
    {
        "message": "RT @DineshDSouza: I'm a little nervous, but I'm fired up about launching my new podcast! Watch the full episode here: https://t.co/IrlSO6HBgx https://t.co/xCeb1XyvyQ\n— See More",
        "timestamp": "2021-01-12 21:08:35"
    },
    {
        "message": "RT @DineshDSouza: Twitter’s Stated Reasons For Banning Trump Are Even Worse Than You’d Think https://t.co/HucW8h9XON\n— See More",
        "timestamp": "2021-01-12 21:08:33"
    },
    {
        "message": "RT @DineshDSouza: A useful reminder for anyone who needs reminding https://t.co/xBM6e4LnYR\n— See More",
        "timestamp": "2021-01-12 21:08:32"
    },
    {
        "message": "RT @JackPosobiec: Uganda is shutting down Facebook and Twitter for censoring users during an election https://t.co/fYaG8XYQxf\n— See More",
        "timestamp": "2021-01-12 20:08:21"
    },
    {
        "message": "RT @DineshDSouza: Day 2 of my new podcast. Please subscribe at Apple and, if you like what you hear, leave me a 5-star review. Also available in audio at Spotify. Video at YouTube, SalemNow and Rumble. My Rumble channel is https://t.co/WLxO43rtIy\n— See More",
        "timestamp": "2021-01-12 20:08:20"
    },
    {
        "message": "RT @DineshDSouza: This hearing on the use of the 25th Amendment just got explosive when Jim Jordan took over the mic... WATCH: https://t.co/Pt1Wa3P6Hg\n— See More",
        "timestamp": "2021-01-12 20:08:19"
    },
    {
        "message": "RT @DineshDSouza: BREAKING: Trump just spoke to media for the first time in days and SLAMMED big tech. This is a video every American needs to see. https://t.co/pm91YZJWes\n— See More",
        "timestamp": "2021-01-12 20:08:18"
    },
    {
        "message": "RT @Project_Veritas: Michael Beller has been FIRED #ExposePBS https://t.co/W3R9XUCmlO\n— See More",
        "timestamp": "2021-01-12 20:08:17"
    },
    {
        "message": "This opening monologue from Tucker Carlson is an absolute must-watch: https://t.co/PeN5fk0KwM\n— See More",
        "timestamp": "2021-01-12 20:08:16"
    },
    {
        "message": "RT @DineshDSouza: How disheartening to find that, when repression and censorship rear their ugly heads, there’s a fellow Asian Indian who is one of the gang leaders https://t.co/A7evT4bKmP\n— See More",
        "timestamp": "2021-01-12 19:08:18"
    },
    {
        "message": "RT @DineshDSouza: My first podcast episode! I’m trying to make these incisive, educational, entertaining. Please give me feedback, especially constructive criticism. I want to get better and better at this! https://t.co/GyT7upYPSR\n— See More",
        "timestamp": "2021-01-12 19:08:17"
    },
    {
        "message": "High comedy! You can’t make this stuff up https://t.co/mqNLiOolAG\n— See More",
        "timestamp": "2021-01-12 19:08:16"
    },
    {
        "message": "Their new plan to force Trump out of office ultimately will come down to Mitch McConnell and the Senate. For the full podcast: WATCH: https://t.co/IrlSO6HBgx LISTEN: https://t.co/PZqj2vwvmt https://t.co/xeH84Dx09a\n— See More",
        "timestamp": "2021-01-12 19:08:15"
    },
    {
        "message": "Twitter’s Stated Reasons For Banning Trump Are Even Worse Than You’d Think https://t.co/HucW8h9XON\n— See More",
        "timestamp": "2021-01-12 19:08:14"
    },
    {
        "message": "RT @CalebJHull: She's blaming her positive COVID-19 test on Republicans not wearing a mask during the storming of the capitol but there is literally video of Rep. Jayapal not wearing a mask the entire time 🤔 https://t.co/li5Lv8Yzfq https://t.co/8TVtlvO9Qu\n— See More",
        "timestamp": "2021-01-12 18:08:26"
    },
    {
        "message": "Day 2 of my new podcast. Please subscribe at Apple and, if you like what you hear, leave me a 5-star review. Also available in audio at Spotify. Video at YouTube, SalemNow and Rumble. My Rumble channel is https://t.co/WLxO43rtIy\n— See More",
        "timestamp": "2021-01-12 18:08:25"
    },
    {
        "message": "This hearing on the use of the 25th Amendment just got explosive when Jim Jordan took over the mic... WATCH: https://t.co/Pt1Wa3P6Hg\n— See More",
        "timestamp": "2021-01-12 18:08:24"
    },
    {
        "message": "A useful reminder for anyone who needs reminding https://t.co/xBM6e4LnYR\n— See More",
        "timestamp": "2021-01-12 18:08:23"
    },
    {
        "message": "I'm a little nervous, but I'm fired up about launching my new podcast! Watch the full episode here: https://t.co/IrlSO6HBgx https://t.co/xCeb1XyvyQ\n— See More",
        "timestamp": "2021-01-12 18:08:22"
    },
    {
        "message": "BREAKING: Trump just spoke to media for the first time in days and SLAMMED big tech. This is a video every American needs to see. https://t.co/pm91YZJWes\n— See More",
        "timestamp": "2021-01-12 16:08:17"
    },
    {
        "message": "The media isn't even trying to hide it anymore. https://t.co/nlnOaqvZY1\n— See More",
        "timestamp": "2021-01-12 16:08:16"
    },
    {
        "message": "RT @IngrahamAngle: Congrats, America! “President Xi Jinping issued an unusually upbeat assessment about China’s future, noting “time and the situation” were on the country’s side” https://t.co/mKUMQGAf8Y via @bpolitics\n— See More",
        "timestamp": "2021-01-12 16:08:15"
    },
    {
        "message": "RT @IngrahamAngle: William Burns the Joe Biden’s pick for CIA director, led the secretive “back channel” with the Iranian regime during the lead up to the Iran nuclear deal. https://t.co/lh8dxpphML\n— See More",
        "timestamp": "2021-01-12 16:08:14"
    },
    {
        "message": "RT @ggreenwald: What was just done with Parler can't be overstated. They created a system where they can not only ban and silence whoever they want from their monopolistic platforms, but also remove entire platforms, their competitors, from the internet. New weapons don't get used only once.\n— See More",
        "timestamp": "2021-01-12 16:08:13"
    },
    {
        "message": "RT @ggreenwald: I still think the most ominous and consequential moment was when FB and Twitter united to ban reporting about the Bidens in the weeks before the election. Twitter mostly expressed regret. FB did not. Liberals & **journalists** overwhelmingly cheered. That showed what was coming.\n— See More",
        "timestamp": "2021-01-12 16:08:12"
    },
    {
        "message": "RT @kylenabecker: BIG TECH.💻 \"A handful of Big Tech companies moved to take down social media platform Parler... but it appears to have found a new company to help try to keep its website running. On Monday, Parler registered its domain and server to be hosted by Epik\"🔻 https://t.co/jiTXdCeejy\n— See More",
        "timestamp": "2021-01-12 16:08:11"
    },
    {
        "message": "My first podcast episode! I’m trying to make these incisive, educational, entertaining. Please give me feedback, especially constructive criticism. I want to get better and better at this! https://t.co/GyT7upYPSR\n— See More",
        "timestamp": "2021-01-12 15:08:15"
    },
    {
        "message": "How disheartening to find that, when repression and censorship rear their ugly heads, there’s a fellow Asian Indian who is one of the gang leaders https://t.co/A7evT4bKmP\n— See More",
        "timestamp": "2021-01-12 15:08:14"
    },
    {
        "message": "RT @DineshDSouza: My new podcast—It’s up and “rumbling.” Season 1, episode 1. Today I discuss impeachment, the Buffalo man theatrical event, and the revenge of the digital nerds. Let’s just say I have lots of butts to kick. Enjoy! https://t.co/GyT7upYPSR\n— See More",
        "timestamp": "2021-01-12 14:08:13"
    },
    {
        "message": "RT @DineshDSouza: Here’s the YouTube link to the first episode of my new podcast. Impeachment, digital censorship, the Venezuela connection—it’s all there. Butt-kicking extravaganza! Impeach, Censor, Destroy! — The Dinesh D'Souza Podcast Ep. 1 https://t.co/nQF8yYzBzf via @YouTube\n— See More",
        "timestamp": "2021-01-12 14:08:12"
    },
    {
        "message": "RT @DineshDSouza: This is one of the most scorching monologues from Tucker Carlson I've ever seen. https://t.co/H7FaajMx4d\n— See More",
        "timestamp": "2021-01-12 14:08:11"
    },
    {
        "message": "RT @TheBabylonBee: 'Let's All Remain Peaceful,' Says Trump In Clear Incitement To Violence https://t.co/QuHwEzc6Kq\n— See More",
        "timestamp": "2021-01-12 14:08:10"
    },
    {
        "message": "Here’s the YouTube link to the first episode of my new podcast. Impeachment, digital censorship, the Venezuela connection—it’s all there. Butt-kicking extravaganza! Impeach, Censor, Destroy! — The Dinesh D'Souza Podcast Ep. 1 https://t.co/nQF8yYzBzf via @YouTube\n— See More",
        "timestamp": "2021-01-12 04:52:41"
    },
    {
        "message": "This is one of the most scorching monologues from Tucker Carlson I've ever seen. https://t.co/H7FaajMx4d\n— See More",
        "timestamp": "2021-01-12 04:46:42"
    }
]