[
    {
        "message": "Stop ruining Christmas by being so gay, grandpa doesn't like it\nhttps://redd.it/rowqcy\n@failures_of_capitalism",
        "timestamp": "2021-12-26 15:15:53"
    },
    {
        "message": "Fleeing global warming? ‘Climate havens’ aren’t ready for you yet.\nhttps://grist.org/migration/fleeing-global-warming-climate-havens-arent-ready-for-you-yet/\n\nhttps://redd.it/rovjoi\n@failures_of_capitalism",
        "timestamp": "2021-12-26 14:15:43"
    },
    {
        "message": "Nothing new here folks. Just move right along.\nhttps://truthout.org/articles/senators-against-generic-covid-vaccines-have-received-twice-as-much-pharma-cash/\n\nhttps://redd.it/rorlgq\n@failures_of_capitalism",
        "timestamp": "2021-12-26 13:15:41"
    },
    {
        "message": "from nato. Nato is an alliance with capitalist nations to go against socialist nations. So it was necessary. So this means the ussr and gdr had to isolate itself economically and politically. The west was built up by the marshall plan and was funded heavily. Remember the usa was never bombed. Pearl harbor barely counts. That means the war never touched its industries like it did france uk and belgium etc. So the usa could throw money. The iron curtain had to be self sufficient. Which means not have foreign governments fund it or take control of it. This is a very important thing for marxist leninists. As if you have someone else like a foreign company build ur industry they control the country and imperialized the people. We see the usa do this with its banana republics in the 50s in south america. So the iron curtain cut itself off from the world. I think this is not optimal. The east saw the shiny shit the west got and wanted some of it. Not because they had no food or no home. They lived modestly.  But the west had fast fashion and pop culture and and much luxury. And i think this is because of the iron curtain. So the wall was made to keep people out as well as in. So a more powerful state and then a crush on dissent and critique. And critique is important. As i mentioned they sometimes did not fulfill their 5 year quotas for the plan sometimes and it could hurt some aspects of life. And so the wall fell and like a domino effect the entire ussr.\n\nDespite its failures the gdr was waaay better than fascist germany. And imo the west. So empirically we can see that communism with a capital \"C\" is better than fascism and are not comparable. Communism served the people. While its modest and not flashy it does not give the rich ultra power. I think we lump a big state and army as fascism. So much to the point that many anarchists call it red fascism. I dont have time to get into that can of worms but needless to say fascism is mass privatization and the state protecting the corporations along huge bigotry and nationalism to justify it. We are much closer to fascism than socialism. And yet people fear china and socialism and not the alt right taking power. Now the alt right is disjointed and does not have the strategy to gain power. Trump just fed off the base. He didnt have any goals of fascism except to give tax cuts. Trumps a fascist but not a well coordinated one. This could happen again. This is happening again. Let us learn from germany and take the right path for the working class of people.\n\nhttps://en.m.wikipedia.org/wiki/Economy_of_Nazi_Germany\n\nhttps://en.m.wikipedia.org/wiki/Economy_of_East_Germany\n\nhttps://en.m.wikipedia.org/wiki/Fascism\n\nhttps://en.m.wikipedia.org/wiki/Marxism%E2%80%93Leninism\n\nhttps://en.m.wikipedia.org/wiki/Socialist_state\n\nhttps://maps.lib.utexas.edu/maps/europe/west_germany_ind_1972.jpg\n\nhttps://en.m.wikipedia.org/wiki/Industrialization_in_Germany\n\nhttps://www.prologisgermany.de/en/industrial-logistics-warehouse-space/europe/germany/rhine-ruhr-industrial-capital-western-germany\n\nhttps://redd.it/roul76\n@failures_of_capitalism",
        "timestamp": "2021-12-26 12:16:02"
    },
    {
        "message": "city very crumbled. And distraught \n\nhttps://i.guim.co.uk/img/media/c1b23caab8cfd5d90af3b35dd572217297c0e638/0_206_5100_3060/master/5100.jpg?width=1200&height=900&quality=85&auto=format&fit=crop&s=9b3dd3126239a5f515865d09b275d053\n\nThe war had lost the colonies, destroyed factories in which 89 percent of petrol production was halted. Losing their slave labor and massive casualties had caused germany to fall.\n\n\nEast germany\n\nNow. Whenever we talk about east germany or the gdr we always talk about how its the shittier version of germany. And whenever people give the reason ehy theu usually say cause it was socialist. Thats not a good faith argument. For one east germany had always been behind industrially. Most of south and eastern parts of germany were agrarian society. The industry was in the north and west. To put into context imagine if the confederates had their way and there was 2 sides to America. A north and the south. The north had the industry and the major ports and cities(its how the union won by strangling the confederates). It would be a terrible take to say that the confederate south was bad economically becuse they had slavery when thats not true. Even though slavery is bad. Slavery as we saw with hitler makes a shit ton of profits and industry. Thats how it was like historically with germany. The east was always less industrialized. Im talking about railways and shit. Most of the industry sits in the Rhine region(the west) where coal is mined. Where wod corporations wanna settle? The argarian almost empty east? Or the industrialized west. All this before the war \n\nNow remember how i said most of the war was fought on the eastern front? Well now we can see what germany had to deal with. It was more bombed than the west. So as marxism leninism does it needed to rebuild the country from the ground up. This means it took stalins stablization theory and used state owned enterprises and centralism to build the east up from the ground. This created jobs and the 5 year plans while some failed to meet quotas did build up the gdr. For example commie blocks in the city helped reduce homelessness. They were modest and not flashy but waay better than living in rubble. Its actually way better than some of the public housing i used to live in here in the usa. Hunger was cut as there was price stabilization and food was collectivized. School was free. Healthcare was free. It was built on public ownership of means of production and labor unions.  Women had a rights to abortion and more freedom than what fascist germany had. In fact there is a book called Why women have better sex under socialism. In my opinion its meh. Shes kinda always saying. The gdr was horrible and a failure and always trying to distance herself from it. And ismt very good with analyzing socialist economics. But she does show that if you give women economic freedom and social freedom they have happier sex lives. Because under capitalism women are relegated to do domestic work and work in the economy amd the right to an abortion allows for women to choose their own path. Conservative societies stifle women whereas a collective society like the gdr allowed for women to do their own thing as there was free daycare, healthcare, abortion, healthcare, and social safety nets. \n\nThat was all under socialist germany. How is socialism the same as fascism. Ideologically and economically they are diametrically opposed. Under communism or marxism leninism the means of production are made public and a social good built on labor unions wherethe economy plans production and prices are stablized. Compare that to fascisms mass privatization and need for racism and bigotry to manufacture consent to use slave labor for the corporations. So if socialist germany is better than fascist germany why did it fall?\n\nWell many things. The iron curtain was bad. Warsaw was bad etc. Now i could sit here like an armchair leftist in the imperial core but lemme add some nuance. Warsaw was needed to build strong alliances as a union. And the iron curtain was a way to stop infiltration",
        "timestamp": "2021-12-26 12:15:58"
    },
    {
        "message": "Is fascism the same as socialism? No. We have literal proof as there is a country that went through fascism and socialism\n\nSo i saw another post link a post about an guy say fascism and socialism are the same shit. And i wanna build off it. Whenever people make this claim i hear the same rebuttals. Good rebuttals but im surprised no one has ever talked about a country that went through fascism and socialism. Germany. Nazi germany and the DDR or GDR are living proof that fascism and socialism are very different. For starters before i go into history lets set some definitions.\n\nFascism- as an ideology is an Ultranationalistic right wing authoritarian chauvinistic ideology that promotes rigid hierarchy and the scapegoat of others. Mussolini desribes the system as corporatism. Where the state and corporations combine. This means mass privatization is key to fascism.\n\nCommunism/socialism/marxism leninism- since this is a socialist sub im sure we all know what socialism is amd how its people owning means of production and sure thats a milquetoast definition but is like to go further. Theres a reason why the 2nd international split themselves from socialists(reformists) and called themselves communists(revolutionaries). So most of communism is the doctrine and theory of Marxism leninism. 2 stage theory. 1 stage of capitalism to build wealth(productive forces) and stage 2 to use the wealth to build up industry and the people by socializing the economy. Essentially what a leninist government looks like is the state being made up of trade unions of people who voted for representatives to represent them in office. Its where the industry is made public for social good. \n\nThese are 2 diametrically opposed systems. While some leftists dont like having the state owned enterprises do stuff and prefer coops and shit. But Its much more stronger and effective to socialize the economy as a unit rather than a decentralized fragmented economy.  Compare that to fascism where the core tenant is privatization. En masse. Keep that in mind. So how did fascist germany work?\n\nFascist germany\n\nFor starters lets talk about the economy of nazi germany. For one there was a worldwide great depression. 30 percent of people were unemployed.(stalins ussr did not have as much unemployment and was booming despite a famine). They relied heavily on slave labor. The racism and nationalism was an excuse to exploit labor heavily for corporations. On the note of corporations, like hitler there was was privatization. Railways, roads, weapons, welfare(to garner support), banks, shipping lines, electric and construction. Hitler said to the corporations that they will be protected by the party as long as they help out the government with money and aiding the military. Hence why Volkswagen sided with the nazis. They made cars and machines for the nazis and were rewarded handsomely. Even foreign companies like Henry Ford would not mind being buddies with the Nazis. So in economic terms it was wonderful for the rich. They made immense profits as long as they pitched in for the war and the expansion(cause the war was not a defensive war. Stalin was on the defense. Hitler was on the offense). And why wouldn't these corporations not want to expand into new territory like poland? Capitals only incentive is to reinvest itself and expand. Its why lenin calls imperialism the highest stage of capitalism. Along with unemployment brought mass homelessness due to giving landlords protections and defunding and deregulation the trade unions and the welfare that got them into power. The right wing will adopt a pseudo populism to gain power. Its why they used the color red to invoke socialist labor sentiment. And they used the swastika to invoke nationalist roots. \n\nThe war would tank the economy as they had their factories bombed and their allies fall(mussolini first, then fascist hirohito, and losing their colonies). Most of the war was fought on the eastern front. And east germany would be the most devastated And i mean totaled. If we look at the liberation of berlin we can see the",
        "timestamp": "2021-12-26 12:15:55"
    },
    {
        "message": "Is fascism the same as socialism? No. We have literal proof as there is a country that went through fascism and socialism\n\nSo i saw another post link a post about an guy say fascism and socialism are the same shit. And i wanna build off it. Whenever people make this claim i hear the same rebuttals. Good rebuttals but im surprised no one has ever talked about a country that went through fascism and socialism. Germany. Nazi germany and the DDR or GDR are living proof that fascism and socialism are very different. For starters before i go into history lets set some definitions.\n\nFascism- as an ideology is an Ultranationalistic right wing authoritarian chauvinistic ideology that promotes rigid hierarchy and the scapegoat of others. Mussolini desribes the system as corporatism. Where the state and corporations combine. This means mass privatization is key to fascism.\n\nCommunism/socialism/marxism leninism- since this is a socialist sub im sure we all know what socialism is amd how its people owning means of production and sure thats a milquetoast definition but is like to go further. Theres a reason why the 2nd international split themselves from socialists(reformists) and called themselves communists(revolutionaries). So most of communism is the doctrine and theory of Marxism leninism. 2 stage theory. 1 stage of capitalism to build wealth(productive forces) and stage 2 to use the wealth to build up industry and the people by socializing the economy. Essentially what a leninist government looks like is the state being made up of trade unions of people who voted for representatives to represent them in office. Its where the industry is made public for social good. \n\nThese are 2 diametrically opposed systems. While some leftists dont like having the state owned enterprises do stuff and prefer coops and shit. But Its much more stronger and effective to socialize the economy as a unit rather than a decentralized fragmented economy.  Compare that to fascism where the core tenant is privatization. En masse. Keep that in mind. So how did fascist germany work?\n\nFascist germany\n\nFor starters lets talk about the economy of nazi germany. For one there was a worldwide great depression. 30 percent of people were unemployed.(stalins ussr did not have as much unemployment and was booming despite a famine). They relied heavily on slave labor. The racism and nationalism was an excuse to exploit labor heavily for corporations. On the note of corporations, like hitler there was was privatization. Railways, roads, weapons, welfare(to garner support), banks, shipping lines, electric and construction. Hitler said to the corporations that they will be protected by the party as long as they help out the government with money and aiding the military. Hence why Volkswagen sided with the nazis. They made cars and machines for the nazis and were rewarded handsomely. Even foreign companies like Henry Ford would not mind being buddies with the Nazis. So in economic terms it was wonderful for the rich. They made immense profits as long as they pitched in for the war and the expansion(cause the war was not a defensive war. Stalin was on the defense. Hitler was on the offense). And why wouldn't these corporations not want to expand into new territory like poland? Capitals only incentive is to reinvest itself and expand. Its why lenin calls imperialism the highest stage of capitalism. Along with unemployment brought mass homelessness due to giving landlords protections and defunding and deregulation the trade unions and the welfare that got them into power. The right wing will adopt a pseudo populism to gain power. Its why they used the color red to invoke socialist labor sentiment. And they used the swastika to invoke nationalist roots. \n\nThe war would tank the economy as they had their factories bombed and their allies fall(mussolini first, then fascist hirohito, and losing their colonies). Most of the war was fought on the eastern front. And east germany would be the most devastated And i mean totaled. If we look at the liberation of berlin we can see the",
        "timestamp": "2021-12-26 12:15:52"
    },
    {
        "message": "150 families evicted 11 days before Xmas by new property owners in my town—residents are organizing and fighting back\n\nHi! This thread was gaining support in r/antiwork but was taken down when I included the GFM link for the tenants. Before that happened, I received tons of great ideas to share with these people and now they’re organizing and taking a collective stand.\n\nI was hoping you all might have more ideas how we can help them fight for their homes.\n\n\nTHEY TOLD PEOPLE TO GO TO A HOMELESS SHELTER IF THEY COULDN’T FIND A NEW PLACE (Up to 150 families 🤔)\n\n#RiseUpNicholasville\n\nUpdate: Reddit spam filter took down the post in r/antiwork and the mods elected to not bring it back, as it had veered beyond the scope of the sub. They were cool about it and I understand their decision, but this cause still needs more online traction.\n\nTenants are organizing and discussing “key for rent” or rent strike tactics! They’re pissed as hell and they’re going to fight for their homes.\n\nI’m doxxing myself, but I don’t care. A property management group called Brookside Properties, Inc. (Nashville, TN) took over a low income apartment complex in my town (Nicholasville, KY). They sent out eviction notices less than 2 weeks before Christmas to all residents, giving them until January 31st to vacate.\n\nThese people are now scrambling to find a place to live and scratch together a security deposit instead of enjoying Christmas. One of my coworkers is being impacted and it’s all she can think about. The first time she mentioned it, I thought, “Oh, that sucks!” The second time, I actually really thought/felt about it and now I’m seeing red. I’m so fucking pissed off. This woman is older and hasn’t had an easy life. She has a job where she’s making decent money, she’s clean, and now she’s afraid she’s going to have to move 30 miles away for affordable housing.\n\nNicholasville is a town of 20,000 that’s being absorbed by Lexington. There’s a complete dearth of 1 BR apartments and rent is skyrocketing. Waitlists run 9 months to 1 year. These people are going to wind up having to leave the community or be homeless.\n\nBrookside Properties, you fucking soulless bastards. You suck. Who does something like this to low income people at Christmas.\n\nEDIT: The apartments are called Treetop (Properties) Apartments and the townhouses are Beauford Townhomes and they’re located at 500 Beauford Place Nicholasville, KY 40356 also 720 South Main Street.\n\nhttps://www.lex18.com/news/lex-18-investigates/its-legal-but-its-not-right-jessamine-county-apartment-complex-tells-dozens-to-vacate-by-jan-31?fbclid=IwAR3s0OejE8O8A6nTmWODM2tWZTyQAhZ-_8PFHw2h55FtJ2iq80qqhk8fTBM\n\nThank you for the rewards, guys. I hope we can actually make a difference for these people so I feel like I earned them. \n\nAnd thank y’all for carving out a little time during this holiday to concern yourself with events in a relatively podunk town in Kentucky to offer suggestions and advice. You truly give me hope that it’s possible to change the world for the better.\n\nI stole this from one of you mad lads: #RiseUpNicholasville\n\nhttps://redd.it/rosed7\n@failures_of_capitalism",
        "timestamp": "2021-12-26 11:15:59"
    },
    {
        "message": "Don’t forget, no loitering.\n\nhttps://redd.it/ronc0v\n@failures_of_capitalism",
        "timestamp": "2021-12-26 10:15:46"
    },
    {
        "message": "A group of Apple employees organized a Christmas Eve walkout, demanding better working conditions and calling on customers to not shop in the tech giant’s retail or online stores\nhttps://truthout.org/articles/apple-workers-held-christmas-eve-walkout-for-their-safety-amid-holiday-shopping/\n\nhttps://redd.it/rof570\n@failures_of_capitalism",
        "timestamp": "2021-12-26 09:15:57"
    },
    {
        "message": "EPA Staff Prevented From Warning Public About Widely Used Carcinogen\nhttps://theintercept.com/2021/12/22/epa-whistleblowers-carcinogen-paint-solvent/\n\nhttps://redd.it/roq8cg\n@failures_of_capitalism",
        "timestamp": "2021-12-26 08:15:46"
    },
    {
        "message": "biden administration and neoliberal democrats summed up with Bukowski quote.\nhttps://redd.it/roeq8p\n@failures_of_capitalism",
        "timestamp": "2021-12-26 06:15:58"
    },
    {
        "message": "\"The left sure picked the weirdest hill to die on.\"\nhttps://redd.it/roi3fx\n@failures_of_capitalism",
        "timestamp": "2021-12-26 05:15:53"
    },
    {
        "message": "Work as efficiently as you are paid to be, because all you'll get as a reward for doing it faster is more work.\nhttps://redd.it/rohgcq\n@failures_of_capitalism",
        "timestamp": "2021-12-26 04:15:48"
    },
    {
        "message": "Another shit meme fixed\nhttps://redd.it/rokggu\n@failures_of_capitalism",
        "timestamp": "2021-12-26 03:15:45"
    },
    {
        "message": "My dad knows me very well also he is the leader of our local SRA chapter so\nhttps://redd.it/rojg05\n@failures_of_capitalism",
        "timestamp": "2021-12-26 02:15:52"
    },
    {
        "message": "The American Middle Class No Longer Signifies Economic Security\nhttps://www.businessinsider.com/american-middle-class-no-longer-signifies-economic-security-2021-12\n\nhttps://redd.it/roh1e5\n@failures_of_capitalism",
        "timestamp": "2021-12-26 01:16:00"
    },
    {
        "message": "If we have in fact reached peak oil, an economic crash will happen soon\n\nOur global economy still largely runs on fossil fuels. Renewables have increased their share of electricity generation, but they still only account for less than 1/3 of generation globally. But electricity generation is only one area that is highly dependent on fossil fuels, and oil specifically. Oil is not only heavily used in transportation and distribution, but in manufacturing. Very many products require oil for their production. If oil production has peaked, the price of oil will only continue to increase. Briefly in 2020 the price of oil plummeted, due to a dramatic drop in demand from pandemic lockdowns and quarantines. However, since then the price of oil has gone back up considerably, because the demand for most everything has come roaring back as the economy has reopened, and as demand for things increases, so too does the demand for oil.\n\nIf we have in fact reached peak oil production as some believe, the cost of many, many things will go up. This price inflation could hit many people very hard, motivating the US Federal Reserve to raise interest rates to combat the rising inflation. This will likely have dramatic economic consequences.\n\nThe US economy especially is heavily dependent on debt to keep growing. In order for consumers to continue buying more and more expensive stuff, and in order for investors to continue buying more and more expensive assets, taking on more and more debt is needed. But debt must be paid back with interest. When interest rates are low, it is easier to service debt, but as interest rates go up, debt service becomes more burdensome. As the cost of borrowing increases, fewer people are able to take out a loan to buy a house or a car. Demand decreases which could lead to a crash in one or more asset markets.\n\nWhen economic analysts say the fundamentals of the economy are strong, what they mean is that there is plenty of money in the economy and plenty of demand for products and services. Those same economists assume supply will follow demand and price equilibrium well be achieved. But, this assumption is based on a belief that the inputs into supply production will be able to remain constant enough (once pandemic related disruptions end) at low enough prices for supply to sufficiently meet demand. This is a false assumption. We can theoretically create infinite demand, but we do not have access to infinite energy, infinite raw materials (especially oil), nor do we have access to infinite labor that we can rely on to be infinitely productive. Money creation and human desires may be unlimited, but supply is not, so prices will inflate.\n\nThat is unless we haven't actually reached peak oil. If oil production can increase then the price of oil won't go up, or at least not as fast, and prices won't necessarily inflate as much or as quickly (although I'd like to point out that labor is an underestimated wild card here, I'm not sure we can expect the same productivity gains going forward that we have come to expect over the past 40 or 50 years). However, if oil production has peaked, price inflation will accelerate, leading to either a crash due to runaway inflation or a crash due to rising interest rates leading to a drop in demand.\n\nIf oil production has not yet peaked and the price of oil is able to stay relatively stable, the economy might be able to continue to grow at manageable levels of inflation, but if that happens, global carbon emissions will increase beyond the 2019 peak, because carbon emissions are nowhere near being decoupled from economic growth.\n\nhttps://redd.it/roct7i\n@failures_of_capitalism",
        "timestamp": "2021-12-26 00:15:45"
    },
    {
        "message": "This letter to santa from a kid in the USPS Operation Santa. Devastating.\nhttps://redd.it/rohnle\n@failures_of_capitalism",
        "timestamp": "2021-12-25 23:16:00"
    },
    {
        "message": "Senators Against Generic COVID Vaccines Have Received Twice as Much Pharma Cash\nhttps://truthout.org/articles/senators-against-generic-covid-vaccines-have-received-twice-as-much-pharma-cash/\n\nhttps://redd.it/roezo8\n@failures_of_capitalism",
        "timestamp": "2021-12-25 22:15:41"
    },
    {
        "message": "Add it to the pile along with starting false statements with the word \"didn't\" and calling Joe Biden far left.\nhttps://redd.it/rofyk5\n@failures_of_capitalism",
        "timestamp": "2021-12-25 21:15:46"
    },
    {
        "message": "Let us not forget the women in Mexico who are protesting the rampant rates of femicide in Mexico and everywhere else in Latin America. Palacio de Gobierno in Morelia, Mexico.\nhttps://redd.it/roc80a\n@failures_of_capitalism",
        "timestamp": "2021-12-25 20:15:41"
    },
    {
        "message": "Found this on a bank life insurance page. The wording somehow felt very reductive.\nhttps://redd.it/ro8g5n\n@failures_of_capitalism",
        "timestamp": "2021-12-25 19:15:59"
    },
    {
        "message": "Please watch Don’t Look Up, and get as many people as you can to do the same\n\nThis movie is the grimmest climate change allegory I have seen. It is cynical, and penetrating, and it is not subtle. It cuts to the heart of our illness. It is a dire warning.\n\nIt’s on netflix. In the coming hours, I’m sure it will be available elsewhere for free. Please watch it.\n\nMore eyes, more noise, more traction.\n\nhttps://redd.it/ro2q67\n@failures_of_capitalism",
        "timestamp": "2021-12-25 18:15:53"
    },
    {
        "message": "Jesus was the greatest American\nhttps://redd.it/roaip4\n@failures_of_capitalism",
        "timestamp": "2021-12-25 17:16:05"
    },
    {
        "message": "Guy who definitely read the Critique of the Gotha Program\nhttps://redd.it/ro844n\n@failures_of_capitalism",
        "timestamp": "2021-12-25 16:15:44"
    },
    {
        "message": "My guy, our country pays inmates 12 cents an hour for their forced labor. They press inmates into service fighting wildfires for a dollar an hour. This country was built on and relies on forced labor, and that’s not going to change as long as the current system remains in place.\nhttps://mobile.twitter.com/_SecondThought/status/1474482417318744064\n\nhttps://redd.it/roaclb\n@failures_of_capitalism",
        "timestamp": "2021-12-25 15:15:59"
    },
    {
        "message": "The Amazon driver who delivered my package at 6pm on Christmas Eve.\nhttps://redd.it/ro7tzf\n@failures_of_capitalism",
        "timestamp": "2021-12-25 14:15:43"
    },
    {
        "message": "'A For-Profit Company Is Trying to Privatize as Many Public Libraries as They Can'\nhttps://fair.org/home/a-for-profit-company-is-trying-to-privatize-as-many-public-libraries-as-they-can/\n\nhttps://redd.it/ro3d8u\n@failures_of_capitalism",
        "timestamp": "2021-12-25 13:15:56"
    },
    {
        "message": "Imagine being so divided and conquered you go from supporting Medicare for All to advocating not treating the unvaccinated. Insanity\n\nhttps://twitter.com/SocialistMMA/status/1474110330783600648?s=20\n\nhttps://redd.it/rnxpje\n@failures_of_capitalism",
        "timestamp": "2021-12-25 12:15:46"
    },
    {
        "message": "On this day, exactly 30 years ago - Mikhail Gorbachev resigned as the leader of the USSR and the Soviet flag was formally taken down from the Kremlin (being replaced by the flag of the Russian Federation), signalling the end of the Soviet Union - a great blow to international socialism.\nhttps://redd.it/ro23pr\n@failures_of_capitalism",
        "timestamp": "2021-12-25 11:15:40"
    },
    {
        "message": "Man wrongfully imprisoned, missed childhood.\n\nhttps://redd.it/ro1rnx\n@failures_of_capitalism",
        "timestamp": "2021-12-25 10:16:00"
    },
    {
        "message": "Yes The companies that strive for profit don’t support support capitalism, yeah sure\nhttps://redd.it/ro2pip\n@failures_of_capitalism",
        "timestamp": "2021-12-25 09:15:43"
    },
    {
        "message": "The day has finally come\nhttps://redd.it/ro2rut\n@failures_of_capitalism",
        "timestamp": "2021-12-25 08:15:48"
    },
    {
        "message": "?\nhttps://redd.it/rnvoux\n@failures_of_capitalism",
        "timestamp": "2021-12-25 07:15:40"
    },
    {
        "message": "Hmmmmm I feel like something contradicts this\nhttps://redd.it/rnzl8i\n@failures_of_capitalism",
        "timestamp": "2021-12-25 06:15:39"
    },
    {
        "message": "Written proof that you are above the law if you're powerful: Winston Churchill's doctor note allowing him to drink alcohol during the prohibition.\nhttps://redd.it/rnz3xs\n@failures_of_capitalism",
        "timestamp": "2021-12-25 05:15:58"
    },
    {
        "message": "Vaush makes yet another transphobic \"joke\", and then implies that transgender critics of his transphobia are the REAL transphobes.\nhttps://redd.it/rnvruj\n@failures_of_capitalism",
        "timestamp": "2021-12-25 04:15:39"
    },
    {
        "message": "When liberals accidentally make good Socialist political cartoons.\nhttps://redd.it/rnsvf2\n@failures_of_capitalism",
        "timestamp": "2021-12-25 03:15:53"
    },
    {
        "message": "Celebrity and former Governor donates $250k for 25 tiny homes for homeless vets. This is where we are.\n\nhttps://redd.it/rnrn7h\n@failures_of_capitalism",
        "timestamp": "2021-12-25 02:15:52"
    },
    {
        "message": "The workers won. Kellogg's folded. This is a great day for US labor rights.\nhttps://twitter.com/MaxCCurtis/status/1473319157496270855\n\nhttps://redd.it/rnsuab\n@failures_of_capitalism",
        "timestamp": "2021-12-25 01:16:01"
    },
    {
        "message": "Do these people not understand how Workers councils and direct democracy works?\nhttps://redd.it/rnqm2k\n@failures_of_capitalism",
        "timestamp": "2021-12-25 00:16:01"
    },
    {
        "message": "This photo is stupid\nhttps://redd.it/rntqfr\n@failures_of_capitalism",
        "timestamp": "2021-12-24 23:15:44"
    },
    {
        "message": "LAPD Murdered a 14-Year-Old Girl in a Store Dressing Room. Abolish the Police\nhttps://www.leftvoice.org/lapd-murdered-a-14-year-old-girl-in-a-store-dressing-room-abolish-the-police/?fbclid=IwAR2f65R1YondBVHzhovSPa2XwZdaLhgNli_z00xnJ_UUb88JURnsRNO0Kjg\n\nhttps://redd.it/rnt0fd\n@failures_of_capitalism",
        "timestamp": "2021-12-24 22:15:37"
    },
    {
        "message": "",
        "timestamp": "2021-12-24 21:15:51"
    },
    {
        "message": "",
        "timestamp": "2021-12-24 21:15:50"
    },
    {
        "message": "Kim Jong un banned birthdays and I saw one of the birthdays and the birthday looked at me\n\nhttps://redd.it/rnnjc1\n@failures_of_capitalism",
        "timestamp": "2021-12-24 21:15:42"
    },
    {
        "message": "Nurse on TikTok explaining what U.S. hospitals are like right now. Will the COVID surge early next year accelerate the healthcare collapse?\n\nhttps://redd.it/rnquw5\n@failures_of_capitalism",
        "timestamp": "2021-12-24 20:15:50"
    },
    {
        "message": "Capitalists expect us to work 60 years, and now they're saying to forget about getting paid for it. I say fuck all the way off\nhttps://redd.it/rnpvim\n@failures_of_capitalism",
        "timestamp": "2021-12-24 19:15:48"
    },
    {
        "message": "This landlord in London advertising a sofa in a bedroom for £380 a month.\nhttps://redd.it/rnmjoq\n@failures_of_capitalism",
        "timestamp": "2021-12-24 18:15:57"
    },
    {
        "message": "Glenn Greenwald - Ordering 20-year-old, double-vaxed-and-boosted students to \"stay in their rooms\" is borderline sociopathic. None of this COVID bureaucracy will disappear even if a full cure is found tomorrow; it will just morph into some vague coercive public health apparatus.\nhttps://twitter.com/ggreenwald/status/1474098335174774786\n\nhttps://redd.it/rnp0jc\n@failures_of_capitalism",
        "timestamp": "2021-12-24 17:15:36"
    },
    {
        "message": "One of the top minds of r/americabad\nhttps://redd.it/rnndig\n@failures_of_capitalism",
        "timestamp": "2021-12-24 16:15:42"
    },
    {
        "message": "Study: Americans are split by partisan lines on each topic related to inequality. However, when exposed to the informational treatment, Americans across the ideological spectrum express more concerns over economic inequality and stronger support for income redistribution.\nhttps://www.sciencedirect.com/science/article/pii/S0049089X21001691?via%3Dihub\n\nhttps://redd.it/rnm96r\n@failures_of_capitalism",
        "timestamp": "2021-12-24 15:15:38"
    },
    {
        "message": "A brewery from my town is being sued for racial discrimination over the n-word, having a \"black man printer\" and a \"white man printer\" in the office, and more. The manager's defense: couldn't be racist, he wasn't aware the employee was black because he didn't know his DNA.\nhttps://redd.it/rnirr3\n@failures_of_capitalism",
        "timestamp": "2021-12-24 14:15:59"
    },
    {
        "message": "\"Liberty and Justice for all\"\nhttps://redd.it/rnl3rq\n@failures_of_capitalism",
        "timestamp": "2021-12-24 13:15:43"
    },
    {
        "message": "“Centrist” loves pebbleyeet\nhttps://redd.it/rnagrb\n@failures_of_capitalism",
        "timestamp": "2021-12-24 12:15:33"
    },
    {
        "message": "Killing people for the \"economy\" is human sacrifice and fascist as fuck.\nhttps://redd.it/rnieax\n@failures_of_capitalism",
        "timestamp": "2021-12-24 11:15:58"
    },
    {
        "message": "We will charge you more.\nhttps://redd.it/rnbjyo\n@failures_of_capitalism",
        "timestamp": "2021-12-24 10:15:57"
    },
    {
        "message": "",
        "timestamp": "2021-12-24 09:15:45"
    },
    {
        "message": "",
        "timestamp": "2021-12-24 09:15:45"
    },
    {
        "message": "Anon indeed...\n\nhttps://redd.it/rnf233\n@failures_of_capitalism",
        "timestamp": "2021-12-24 09:15:34"
    },
    {
        "message": "Roger Waters: Israel is a ‘Terrorist, Apartheid, Racist Regime!’, Slams Treatment of Palestinians\nhttps://www.youtube.com/watch?v=gD8nRnXv4QY\n\nhttps://redd.it/rnftiv\n@failures_of_capitalism",
        "timestamp": "2021-12-24 08:15:52"
    },
    {
        "message": "Found on DeviantArt\nhttps://redd.it/rn80if\n@failures_of_capitalism",
        "timestamp": "2021-12-24 07:15:41"
    },
    {
        "message": "My Latest Collapse Inspired Painting, “Peace on Earth”.\nhttps://redd.it/rn9vap\n@failures_of_capitalism",
        "timestamp": "2021-12-24 06:15:56"
    },
    {
        "message": "Posted 9 months ago, still true today.\n\nhttps://redd.it/rn98ae\n@failures_of_capitalism",
        "timestamp": "2021-12-24 05:15:40"
    },
    {
        "message": "'Enormous spread of omicron' may bring 140M new COVID infections to US in the next two months, model predicts\nhttps://www.usatoday.com/story/news/health/2021/12/22/covid-omicron-variant-ihme-models-predict-140-m-new-infections-winter/8967421002/\n\nhttps://redd.it/rn4v68\n@failures_of_capitalism",
        "timestamp": "2021-12-24 04:16:01"
    },
    {
        "message": "A QAnon con: How the viral Wayfair sex trafficking lie hurt real kids An Internet mob wanted to rescue a 13-year-old girl. Instead, they terrified her, derailed real trafficking investigations and incited ‘save the children’ violence.\nhttps://redd.it/rn8r3i\n@failures_of_capitalism",
        "timestamp": "2021-12-24 03:15:44"
    },
    {
        "message": "Reactionaries are so fuckin dumb lmao\nhttps://redd.it/rn63dc\n@failures_of_capitalism",
        "timestamp": "2021-12-24 02:15:47"
    },
    {
        "message": "Thoughts? Brazil’s democracy vs socialist party expectations\nhttps://redd.it/rn8gqv\n@failures_of_capitalism",
        "timestamp": "2021-12-24 01:15:51"
    },
    {
        "message": "How Smooth Does Your Brain Have To Be To Post This Unironically?\nhttps://redd.it/rmz0mf\n@failures_of_capitalism",
        "timestamp": "2021-12-24 00:15:55"
    },
    {
        "message": "Bro what\nhttps://redd.it/rmz2n7\n@failures_of_capitalism",
        "timestamp": "2021-12-23 23:15:57"
    },
    {
        "message": "The left is worse than the kkk and nazis because at least they are honest about who they are\nhttps://redd.it/rn45cx\n@failures_of_capitalism",
        "timestamp": "2021-12-23 22:15:44"
    },
    {
        "message": "\"We need to de-gender our models of care, whilst expanding and socializing them at every scale of life; to resist marketized, neoliberal models of structural carelessness — and to develop forms of 'universal care' and 'promiscuous care' instead.\" — The Care Collective in ROAR (link in comments)\nhttps://redd.it/rmwzy8\n@failures_of_capitalism",
        "timestamp": "2021-12-23 21:15:40"
    },
    {
        "message": "Kamala Harris has turned to Hillary Clinton to help reverse her drop in approval ratings\nhttps://www.dailymail.co.uk/news/article-10339965/Kamala-Harris-turned-Hillary-Clinton-help-reverse-drop-approval-ratings.html\n\nhttps://redd.it/rmzj5b\n@failures_of_capitalism",
        "timestamp": "2021-12-23 20:15:40"
    },
    {
        "message": "This sub used to be better...\n\nI remember when collapse didn't just upvote any doomer news title from clickbait websites. Every post that appears on my timeline from here now is some clickbait without evidence or just some short paragraph without source for the affirmation.\n\nI remember when we used to have thought out discussions and good papers review, pointing out facts and good peer reviewed sources. Nowadays some users are using the sub to farm upvotes with cheap doomer headlines, and the sub is losing the critical analysis that made it such a great place in the first place.\n\nWe need to be more critical of the news source we are trending, not just upvoting because it confirms my or yours bias.\n\n Let's not become a facebook group, please.\n\nhttps://redd.it/rmz09h\n@failures_of_capitalism",
        "timestamp": "2021-12-23 19:16:02"
    },
    {
        "message": "The Democrats Are Trying to Lose | Democrats are going beyond refusing to give Americans an affirmative reason to vote for them: in sabotaging their own purported agenda around Biden’s Build Back Better bill, they seem to be trying to lose to the authoritarians in the GOP they claim to oppose.\nhttps://www.jacobinmag.com/2021/12/the-democrats-are-trying-to-lose\n\nhttps://redd.it/rmw7is\n@failures_of_capitalism",
        "timestamp": "2021-12-23 18:16:01"
    },
    {
        "message": "Corporate donors gave to Manchin before announcement he wouldn't support Build Back Better: report\nhttps://thehill.com/homenews/senate/586883-corporate-donors-opened-wallets-to-manchin-before-announcement-he-wont\n\nhttps://redd.it/rmxkx9\n@failures_of_capitalism",
        "timestamp": "2021-12-23 17:15:49"
    },
    {
        "message": "National teachers’ strike as relentless class struggle rocks Iran\nhttps://www.marxist.com/national-teachers-strike-as-relentless-class-struggle-rocks-iran.htm\n\nhttps://redd.it/rmvz1v\n@failures_of_capitalism",
        "timestamp": "2021-12-23 16:15:53"
    },
    {
        "message": "Left Unity of the past\nhttps://redd.it/rmwq34\n@failures_of_capitalism",
        "timestamp": "2021-12-23 15:15:40"
    },
    {
        "message": "Body Mass of Animals Shrank by 98% During Last 1.5 Million Years\nhttps://www.haaretz.com/archaeology/body-mass-of-animals-shrank-by-98-during-last-1-5-million-years-1.10469705\n\nhttps://redd.it/rms82c\n@failures_of_capitalism",
        "timestamp": "2021-12-23 14:15:44"
    },
    {
        "message": "Oh no why won't anyone think of the Tsar?????\nhttps://redd.it/rmtj4x\n@failures_of_capitalism",
        "timestamp": "2021-12-23 13:15:52"
    },
    {
        "message": "U.S Is Being Robbed. While the world panicked & took extraordinary measures to protect one another, ultra-rich robbed U.S. taxpayers. Billionaires fortune🔺70% in 19 months, to $5 trillion in Oct 2021- to hold two-thirds more than the $3 trillion in wealth held by the bottom 50% of U.S. households.\nhttps://momentum.medium.com/the-united-states-is-being-robbed-309c9001efa9\n\nhttps://redd.it/rmr96g\n@failures_of_capitalism",
        "timestamp": "2021-12-23 12:15:52"
    },
    {
        "message": "Amazon safety practices\nhttps://redd.it/rmr2cx\n@failures_of_capitalism",
        "timestamp": "2021-12-23 11:15:47"
    },
    {
        "message": "Unalive the algorithm!\nhttps://redd.it/rmhn0n\n@failures_of_capitalism",
        "timestamp": "2021-12-23 10:15:52"
    },
    {
        "message": "Study Finds Alarming Levels of Microplastics in The Feces of People With IBD\nhttps://www.sciencealert.com/inflammatory-bowel-disease-feces-found-with-alarming-levels-of-microplastics\n\nhttps://redd.it/rmlu8b\n@failures_of_capitalism",
        "timestamp": "2021-12-23 09:15:38"
    },
    {
        "message": "I just can’t watch nature documentaries anymore.\n\nAs a child, I could stay glued to my CRT TV and watch Crocodile Hunter, Blue Planet, and Wild Kingdom for hours. Almost every weekend morning was spent in wide-eyed wonder as David Attenborough and Steve Irwin guided me through the mysteries and beauty of the natural world. They felt like promises made: this planet is wonderful and wild, come see it for yourself! I was hooked.\n\nThe one thing I remember most about these programs were the consistent themes of conservation and protection - but the wild world felt too vast and untouchable to my elementary school mind to truly be in any danger. How could humans ever realistically produce enough waste to fill the ocean with plastic or rivers with garbage? It felt impossible.\n\nIt’s so hard to see their warnings become realized. Reefs bleaching, trash islands the size of countries, micro plastic polluting every corner of the globe. Forests burning, ice melting, bird populations plummeting so low that a walk through the woods feels strange and quiet. Anywhere and everywhere you look, nature is on the decline, and has been since those shows first aired.\n\nI just can’t watch nature docs anymore. It’s like watching an obituary. It hurts too much to think what could have been if we’d acted sooner, or acted at all.  And that one day I’ll have to show these programs to my grandchildren with a very different promise than the one Steve Irwin made to me: this planet was wonderful and wild once. Don’t you wish you could have seen it for yourself?\n\nhttps://redd.it/rmfusb\n@failures_of_capitalism",
        "timestamp": "2021-12-23 08:15:55"
    },
    {
        "message": "Not so centrist now are ya?\nhttps://redd.it/rmnjlf\n@failures_of_capitalism",
        "timestamp": "2021-12-23 07:15:51"
    },
    {
        "message": "Felt this belongs here\nhttps://redd.it/rmboki\n@failures_of_capitalism",
        "timestamp": "2021-12-23 06:15:57"
    },
    {
        "message": "The Mayor of Chicago has a message for the unvaxxed\nhttps://redd.it/rmbomq\n@failures_of_capitalism",
        "timestamp": "2021-12-23 05:15:56"
    },
    {
        "message": "\"You Are Here\" chart for the current zeitgeist\nhttps://redd.it/rmfz95\n@failures_of_capitalism",
        "timestamp": "2021-12-23 04:16:01"
    },
    {
        "message": "Famous left-wing corporation, Walmart.\nhttps://redd.it/rmg6jx\n@failures_of_capitalism",
        "timestamp": "2021-12-23 03:15:59"
    },
    {
        "message": "The ruling class gives Chile another nice little reminder on how Capitalism drives Democracy\nhttps://redd.it/rmec51\n@failures_of_capitalism",
        "timestamp": "2021-12-23 02:15:56"
    },
    {
        "message": "Workers have to form their own coalition to combat against Corporate bully tactics or individually get steamrolled....\nhttps://redd.it/rm7efv\n@failures_of_capitalism",
        "timestamp": "2021-12-23 01:15:54"
    },
    {
        "message": "Cuba: 60 years ago, the gigantic literacy campaign launched months ago ended! More than a million Cubans learned to read and write thanks to a socialist revolution! Today in Cuba is Educator's Day !!\n\n \n\nThe United States government tried by  all means to hinder the campaign. The CIA gave orders to the mercenary  gangs operating in the island's mountains to do so, and they obeyed by  murdering several literacy teachers and students, among them, Manuel  Ascunce Domenech and Pedro Lantigua.\n\nThe  literacy brigades were named  \"Conrado Benitez\", the name of a  19-year-old black teacher who had been assassinated on January 5, 1961  by a mercenary gang in the mountains of the center of the country. In  April 1961 the Literacy Campaign would begin ... and the brigades would  bear his name. The literacy teachers shared a roof and food with their  students, in the houses of the peasants, whom they also supported in  their agricultural work.\n\nAll the assasins of the teachers and his students were captured and after a trial, executed, or diedl in combat.\n\nhttps://redd.it/rm9a07\n@failures_of_capitalism",
        "timestamp": "2021-12-23 00:15:52"
    },
    {
        "message": "Work will set you free\nhttps://redd.it/rmey0z\n@failures_of_capitalism",
        "timestamp": "2021-12-22 23:15:45"
    },
    {
        "message": "Fuck the CPGB-ML\nhttps://redd.it/rmbemd\n@failures_of_capitalism",
        "timestamp": "2021-12-22 22:15:43"
    },
    {
        "message": "What do I have to say about this one\nhttps://redd.it/rm6n9p\n@failures_of_capitalism",
        "timestamp": "2021-12-22 21:15:55"
    },
    {
        "message": "Putin warns NATO 'everyone will be turned to radioactive ash' over Ukraine moves\nhttps://www.mirror.co.uk/news/world-news/vladimir-putin-warns-nato-everyone-25759453\n\nhttps://redd.it/rm8dif\n@failures_of_capitalism",
        "timestamp": "2021-12-22 19:58:52"
    }
]