[
    {
        "message": "EU foreign-policy chief Josep Borrell showed the West’s neocolonial mentality in a racist rant claiming “the world needs Europe” as a “beacon” and beautiful “garden” to civilize the barbarous “jungle” in the Global South. \n\nHe also called for regime change to create a “post-Putin Russia,” in order to forcibly integrate it into the US-led imperialist world system.\n\nhttps://multipolarista.com/2022/10/15/eu-europe-garden-jungle/",
        "timestamp": "2022-10-17 21:44:10"
    },
    {
        "message": "Round two of Brazil’s presidential election, coming up on October 30, offers deeply opposing visions:\n\nBolsonaro would mean more subordination and deindustrialization.\n\nLula would mean independence, economic nationalism, and multipolarity.\n\nBrazilian professor Elias Jabbour analyzed this important race:\n\nhttps://multipolarista.com/2022/10/08/brazil-election-bolsonaro-lula/",
        "timestamp": "2022-10-09 12:43:54"
    },
    {
        "message": "Brazil’s leftist presidential candidate Lula da Silva won the first round of the elections with 48.4% and over 6 million more votes than far-right incumbent Jair Bolsonaro. \n\nLula's Workers’ Party is organizing with social movements in the lead-up to the October 30 runoff election.\n\nWe spoke with journalist Camila Escalante, who is reporting on the ground in São Paulo, about what these crucial elections mean for not just Brazil, but Latin America and the world as a whole:\n\nhttps://multipolarista.com/2022/10/03/brazil-elections-lula-bolsonaro/",
        "timestamp": "2022-10-03 17:32:39"
    },
    {
        "message": "We analyzed the geopolitics of the proxy war in Ukraine, from Russia's oil and gas exports and the (now sabotaged) Nord Stream pipelines to Washington's strategy to prevent Eurasian integration and keep Germany's economy dependent on the US:\n\nhttps://youtu.be/nyitwFjX0GI",
        "timestamp": "2022-09-28 00:02:58"
    },
    {
        "message": "https://www.youtube.com/watch?v=qbiIoIAgxws",
        "timestamp": "2022-09-26 23:12:01"
    },
    {
        "message": "Colombia’s first ever left-wing President Gustavo Petro delivered a historic UN speech declaring, “The war on drugs has failed.” \n\nHe warned capitalism is destroying the environment, with its “addiction to money and oil,” and called for debt relief for the Global South.\n\nhttps://multipolarista.com/2022/09/24/war-drugs-un-colombia-gustavo-petro/",
        "timestamp": "2022-09-26 23:10:53"
    },
    {
        "message": "Liz Truss, the UK’s new prime minister, is the most anti-China British leader in decades.\n\nIn the Conservative leadership contest she won, candidates competed to be as belligerent as possible against Beijing.\n\nA look at the new cold war from London:\n\nhttps://multipolarista.com/2022/09/23/britain-anti-china-liz-truss",
        "timestamp": "2022-09-23 16:44:42"
    },
    {
        "message": "https://www.youtube.com/watch?v=scBiUIaBx9s",
        "timestamp": "2022-09-20 17:24:57"
    },
    {
        "message": "The FBI harassed Black revolutionary Darren Seals and compiled a 900-page report on his organizing against racism and police brutality in Ferguson, Missouri, birthplace of Black Lives Matter. \n\nHe was shot to death in 2016, then set on fire in his car.\n\nhttps://multipolarista.com/2022/09/19/fbi-black-activist-darren-seals/",
        "timestamp": "2022-09-20 17:24:48"
    },
    {
        "message": "https://www.youtube.com/watch?v=h4Pr9g_7Nhc",
        "timestamp": "2022-09-13 21:31:21"
    },
    {
        "message": "The US military launched at least 251 foreign interventions from 1991 to 2022.\n\nThis is according to a report from the US government's own Congressional Research Service.\n\nWe went through the data and created a map showing just how vast the meddling is:\n\nhttps://multipolarista.com/2022/09/13/us-251-military-interventions-1991/",
        "timestamp": "2022-09-13 21:31:04"
    },
    {
        "message": "We interviewed economist Michael Hudson about the need for much bigger debt relief, inflation and the US Federal Reserve, disaster capitalism in Ukraine, and China’s challenge to the petrodollar.\n\nFull transcript, video, and podcast here:\n\nhttps://multipolarista.com/2022/09/08/michael-hudson-debt-inflation-ukraine-petrodollar/",
        "timestamp": "2022-09-10 21:15:22"
    },
    {
        "message": "https://www.youtube.com/watch?v=2fHZCfRE3n4",
        "timestamp": "2022-09-09 20:49:30"
    },
    {
        "message": "Ukraine’s Western-backed leader Volodymyr Zelensky opened the New York Stock Exchange telling Wall Street his country is “open” for foreign corporations to exploit it with $400 billion in state selloffs.\n\nEconomist Michael Hudson says the vicious anti-labor policies being imposed by Ukraine are reminiscent of Chile's fascist Pinochet regime.\n\nhttps://multipolarista.com/2022/09/09/zelensky-selling-ukraine-wall-street/",
        "timestamp": "2022-09-09 20:49:18"
    },
    {
        "message": "South Koreans held huge protests against the US military and its largest joint war exercises in years, simulating attacks on the DPRK (North Korea) and the assassination of its leadership.\n\nWe interviewed activists from the peace groups Women Cross DMZ and Korea Peace Now to discuss the mass movement against US militarization and imperialism:\n\nhttps://multipolarista.com/2022/09/02/south-korea-protest-us-military-drills/",
        "timestamp": "2022-09-07 15:49:42"
    },
    {
        "message": "https://www.youtube.com/watch?v=WfjqzAY_mEc",
        "timestamp": "2022-09-05 17:17:03"
    },
    {
        "message": "In blatant violation of international law, the US government has blocked countries from events at UN headquarters in New York.\n\nThe Biden administration is banning Russian diplomats, while the Trump admin illegally barred Venezuela and Iran.\n\nhttps://multipolarista.com/2022/09/04/biden-trump-un-neutrality-visas/",
        "timestamp": "2022-09-05 17:16:54"
    },
    {
        "message": "West killed peace proposal to end Ukraine war, Russia supported negotiated settlement\n\nThis fact was admitted by a major Ukrainian newspaper and Foreign Affairs magazine, of the US government-linked Council on Foreign Relations.\n\nThe West didn't want peace.\n\nhttps://multipolarista.com/2022/09/03/west-peace-proposal-ukraine-russia/",
        "timestamp": "2022-09-04 21:55:40"
    },
    {
        "message": "Russia and Ukraine agreed to a negotiated settlement to end the war in April, but British Prime Minister Boris Johnson intervened to stop the peace deal.\n\nThe US and EU instead escalated the proxy war, as the Biden administration admitted, to try to \"weaken\" Moscow.\n\nhttps://www.youtube.com/watch?v=LpJMqs1yG1A",
        "timestamp": "2022-09-04 21:55:18"
    },
    {
        "message": "Foreign media outlets falsely accuse Nicaragua’s Sandinista government of repressing the Catholic Church.\n\nThis article by a longtime community development worker in Nicaragua explains the Church hierarchy's role in supporting a violent right-wing coup attempt in 2018 and sponsoring extremist opposition groups:\n\nhttps://multipolarista.com/2022/08/29/catholic-church-coup-nicaragua/",
        "timestamp": "2022-09-03 15:11:29"
    },
    {
        "message": "We are doing a livestream today at 3 pm ET / noon PT / 1900 UTC to discuss the huge protests in South Korea against the US military and its largest exercises in years, simulating war with the North.\n\nWe will be speaking with Korean peace activists. Join us: \n\nhttps://youtube.com/watch?v=Lqocug-NGRs",
        "timestamp": "2022-09-02 15:34:04"
    },
    {
        "message": "In this article, a Brazilian scholar explains how the energy crisis in Europe, proxy war in Ukraine, rebellion in the Global South, and expansion of the BRICS all reflect the decline of Western imperialism and growing cracks in the capitalist world system.\n\nhttps://multipolarista.com/2022/08/31/west-imperial-decline-capitalism/",
        "timestamp": "2022-08-31 22:59:32"
    },
    {
        "message": "Neoliberalism has lost the key pillars it was built on: \n- cheap energy and raw materials from Russia, \n- cheap labor and consumer goods from China, \n- an unsustainable bubble of household debt,\n- low to zero interest rates, and \n- Washington’s ability to organize regime-change operations in any country where a government tried a socialistic or state-led economic model.\n\nhttps://multipolarista.com/2022/08/27/west-end-neoliberalism-abundance/",
        "timestamp": "2022-08-30 22:46:46"
    },
    {
        "message": "France’s President Macron, a former banker, warned \"we are living the end of what could have seemed an era of abundance.\"\n\nWestern wars and sanctions are boomeranging back at home.\n\nIn this video we explain why and how the neoliberal phase of capitalism is collapsing:\n\nhttps://www.youtube.com/watch?v=dw84vwYS8YE",
        "timestamp": "2022-08-30 22:42:00"
    },
    {
        "message": "In this article, a Brazilian scholar explains how the hegemony of US imperialism led to a global consolidation of capitalism. But the rise of China and its model of productive, anti-neoliberal globalization offers an opportunity for Latin America, and the world, to challenge neocolonialism.\n\nhttps://multipolarista.com/2022/08/28/china-anti-neoliberal-globalization-imperialism/",
        "timestamp": "2022-08-29 16:22:43"
    },
    {
        "message": "We interviewed a Pakistani scholar about the US-backed coup against PM Imran Khan, who was absurdly charged with \"terrorism\" for criticizing the unelected regime.\n\nWe discussed Pakistan's economic crisis, the neoliberal IMF bailout, and why the US opposed Khan's independent foreign policy, especially his close alliance with China, growing relations with Russia, opposition to the US war in Afghanistan, and strong support for Palestine:\n\nhttps://www.youtube.com/watch?v=g9IzwCAYbZY",
        "timestamp": "2022-08-25 15:53:39"
    },
    {
        "message": "China is forgiving 23 interest-free loans for 17 African countries, after already cancelling $3.4 billion and restructuring $15 billion of debt from 2000-2019.\n\nIn this video we analyze how this relief debunks the US government's propaganda myth of supposed Chinese \"debt-trap diplomacy.\"\n\nhttps://www.youtube.com/watch?v=AMTVoZKrCPo",
        "timestamp": "2022-08-23 00:19:17"
    },
    {
        "message": "China is forgiving 23 interest-free loans for 17 African countries, after already cancelling $3.4 billion and restructuring $15 billion of debt from 2000-2019.\n\nBeijing pledged more infrastructure projects and offered favorable trade deals in a “win-win” model of “mutually beneficial cooperation.”\n\nMeanwhile, the United States has turned Africa into a battleground in its new cold war on China and Russia.\n\nTop US diplomats just visited the continent, pressuring countries to cut ties with China and threatening them not to do trade with Russia or they could face \"actions taken against them for breaking [Western] sanctions.\"\n\nhttps://multipolarista.com/2022/08/20/china-forgives-debt-africa/",
        "timestamp": "2022-08-20 19:22:15"
    },
    {
        "message": "https://multipolarista.com/2022/08/17/biden-colombia-petro-coup/",
        "timestamp": "2022-08-17 16:58:05"
    },
    {
        "message": "Biden's top Latin America advisor Juan González threateningly said of Colombia's new left-wing president: \n\n\"40 years ago, the United States would have done everything possible to prevent the election of Gustavo Petro, and once in power it would have done almost everything possible to sabotage his government.\"\n\nhttps://www.youtube.com/watch?v=pVQy88AzQ5A",
        "timestamp": "2022-08-17 16:57:58"
    },
    {
        "message": "https://multipolarista.com/2022/08/16/japan-us-lied-radioactive-fallout/",
        "timestamp": "2022-08-16 16:39:32"
    },
    {
        "message": "After dropping two atomic bombs on Japan in August 1945, killing between 100,000 and 200,000 civilians, top US government officials lied to the media and Congress, claiming there was “no radioactive residue” in Hiroshima and Nagasaki and that Japanese reports of deaths due to radiation were “propaganda.”\n\nThe US general overseeing the nuclear program told Congress that Japanese civilians did not face “undue suffering,” insisting that it was in fact “a very pleasant way to die.”\n\nhttps://www.youtube.com/watch?v=Cu4KnCPjwys",
        "timestamp": "2022-08-16 16:39:24"
    },
    {
        "message": "In this article, a Puerto Rican independence activist and former political prisoner in the US offers his astute geopolitical analysis of the proxy war in Ukraine.\n\nHe argues that the US-EU-NATO war on Russia has backfired and is only accelerating Western decline.\n\nhttps://multipolarista.com/2022/08/15/russia-us-imperial-plans-ukraine/",
        "timestamp": "2022-08-15 17:30:27"
    },
    {
        "message": "CBS censors its own report on Ukraine weapons corruption\n\nhttps://multipolarista.com/2022/08/10/cbs-censors-report-ukraine-weapons-corruption/",
        "timestamp": "2022-08-12 22:28:30"
    },
    {
        "message": "Under government pressure, CBS News censored its own documentary showing that just around 30% of the weapons Western governments have sent actually go to the frontlines, with widespread corruption and black markets.\n\nWe analyzed the highlights in this video:\n\nhttps://www.youtube.com/watch?v=4MQNjmbDadg",
        "timestamp": "2022-08-12 22:28:01"
    },
    {
        "message": "This story provides an inside look at the free universal health-care system created by Nicaragua’s Sandinista government, which has saved countless lives\nhttps://multipolarista.com/2022/08/11/nicaragua-free-health-care/",
        "timestamp": "2022-08-11 17:26:45"
    },
    {
        "message": "Silicon Valley Big Tech corporations, which are all US government contractors, censor Russian media while allowing Australian state outlets to spread anti-China propaganda and refusing to label Western state media\n\nhttps://www.youtube.com/watch?v=YHUctJi2EWw",
        "timestamp": "2022-08-11 15:30:56"
    },
    {
        "message": "This article details how the US government is holding many political prisoners, including:\n\n- national security state employees and reporters locked up for publicizing blatant government criminality\n- representatives of foreign governments that Washington seeks to overthrow who were imprisoned for \"violating\" illegal unilateral US sanctions\n- Black, Native American, and Latino revolutionaries fighting for the rights of their peoples\n- Arabs and Muslims targeted after 9/11\n- prisoners detained in the Guantánamo torture center without charges\n- women locked up for defending themselves against violent attacks\n- environmental activists\n\nhttps://multipolarista.com/2022/08/09/us-political-prisoners-list/",
        "timestamp": "2022-08-09 19:08:08"
    },
    {
        "message": "Here you can find an English-language translation, video, and podcast:\n\nhttps://multipolarista.com/2022/08/05/us-war-china-russia-multipolar-world-nicaragua-ortega/",
        "timestamp": "2022-08-06 22:16:20"
    },
    {
        "message": "In a historic speech, Nicaragua’s President Daniel Ortega said the US war on China and Russia is an attack on the new world of “multipolarism”:\n\n\"North American imperialism is trying to maintain its hegemony at all costs, even at the risk of sinking its own economy\"\n\nhttps://www.youtube.com/watch?v=lkPyT8fDymk",
        "timestamp": "2022-08-06 22:16:07"
    },
    {
        "message": "Video, podcast, and sources here: \n\nhttps://multipolarista.com/2022/08/02/us-war-china-taiwan-nuclear/",
        "timestamp": "2022-08-02 21:26:39"
    },
    {
        "message": "This video explains how the US government has been preparing for war with China over Taiwan. The extremely provocative trip by top official Nancy Pelosi was only the latest development in years of US escalation.\n\nThe Pentagon has made plans for war with China, top CIA officials openly call for fighting Beijing, and US troops are on the ground in Taipei. Washington has sold Taiwan tens of billions of dollars worth of military equipment, and influential DC think tanks are even calling to send it nuclear weapons.\n\nhttps://www.youtube.com/watch?v=hUjHZ5z8W90",
        "timestamp": "2022-08-02 21:26:27"
    },
    {
        "message": "Western governments and corporations met in Switzerland this July to plan harsh neoliberal economic policies to impose on post-war Ukraine.\n\nThey called to cut labor laws, “open markets,” drop tariffs, deregulate industries, and “sell state-owned enterprises to private investors.”\n\nhttps://multipolarista.com/2022/07/28/west-neoliberal-recovery-conference/",
        "timestamp": "2022-07-28 20:10:01"
    },
    {
        "message": "Here are the top corporate media outlets that spread this bogus conspiracy theory:\n\nhttps://multipolarista.com/2022/01/23/cia-havana-syndrome-conspiracy-media/",
        "timestamp": "2022-07-26 14:58:05"
    },
    {
        "message": "Top Western corporate media outlets have spent years spreading a conspiracy theory called “Havana Syndrome,” claiming without any evidence that Russia, China, and/or Cuba were systematically attacking US spies and diplomats with futuristic microwave technology and directed-energy weapons.\n\nCIA Director William Burns has now burst that media bubble, admitting that “Havana Syndrome” is not caused by foreign attacks, and there are normal medical explanations.\n\nhttps://multipolarista.com/2022/07/26/cia-director-havana-syndrome-attack/",
        "timestamp": "2022-07-26 14:56:40"
    },
    {
        "message": "July 25 is the date of the US invasion of Puerto Rico.\n\nIn this article, a Puerto Rican revolutionary and former political prisoner explains how racism keeps Puerto Rico in a colonial status, based on white-supremacist court cases from the era of slavery.\n\nhttps://multipolarista.com/2022/07/25/puerto-rico-colonialism-racism-slavery-july-25/",
        "timestamp": "2022-07-25 14:47:04"
    },
    {
        "message": "In his speech at the 43rd anniversary of the Sandinista Revolution, Nicaraguan President Daniel Ortega said the United States and European Union are waging wars to prevent “multipolarity on our planet.”\n\nOrtega quoted Che Guevara, arguing “imperialism cannot be trusted even a little bit.” He added that dialogue with Washington is “impossible,” because it would be like negotiating with the devil.\n\nhttps://multipolarista.com/2022/07/24/nicaragua-ortega-war-multipolarity/",
        "timestamp": "2022-07-24 18:19:08"
    },
    {
        "message": "https://multipolarista.com/2022/07/23/iran-russia-dollar-china-alliance/",
        "timestamp": "2022-07-23 14:28:59"
    },
    {
        "message": "Russian President Vladimir Putin visited Iran, signed a $40 billion energy cooperation agreement, and pledged to strengthen their trilateral economic and military alliance with China.\n\nMoscow and Tehran also called to drop the US dollar and instead use local currencies for trade.\n\nhttps://www.youtube.com/watch?v=n60R8NooXa0",
        "timestamp": "2022-07-23 14:28:52"
    },
    {
        "message": "We made a mini-documentary inside Nicaragua's Sandinista Revolution, which just celebrated its 43rd anniversary\n\nThis video explores the Sandinista Front's emphasis on socialism, social programs, popular participation, anti-imperialism and internationalism:\n\nhttps://t.co/6FK0F8wlUl",
        "timestamp": "2022-07-22 13:22:53"
    },
    {
        "message": "https://www.youtube.com/watch?v=U52tT5hgtSk",
        "timestamp": "2022-07-12 16:29:23"
    },
    {
        "message": "Sri Lanka owes 81% of its external debt to US and European financial institutions and Western allies Japan and India. China owns just 10%. \n\nBut Washington blames imaginary \"Chinese debt traps\" for the South Asian nation's economic crisis, as it considers a 17th IMF structural adjustment program.\n\nhttps://multipolarista.com/2022/07/11/debt-trap-sri-lanka-west-china/",
        "timestamp": "2022-07-11 21:44:24"
    },
    {
        "message": "https://multipolarista.com/2022/07/08/nato-2022-strategic-concept-russia-china/",
        "timestamp": "2022-07-11 20:12:17"
    },
    {
        "message": "NATO’s 2022 “Strategic Concept” is the US-led military cartel's first new plan since 2010.\n\nIt declares Russia a “threat” and China “systemic challenge,” demonizing the Eurasian powers as “authoritarian actors” and “strategic competitors.”\n\nThe document essentially declares a second cold war to maintain Western hegemony.\n\nyoutube.com/watch?v=l7QajE5yiA4",
        "timestamp": "2022-07-11 20:11:54"
    },
    {
        "message": "Japan’s longest serving prime minister, Shinzo Abe tried to rewrite the Japanese empire’s genocidal history. \n\nAfter World War II, the US rehabilitated fascist war criminals, like Abe’s grandfather, putting them in power in a right-wing one-party regime.\n\nhttps://www.youtube.com/watch?v=5WWJ3EOmPkY",
        "timestamp": "2022-07-10 14:28:03"
    },
    {
        "message": "CNBC pundit Jim Cramer called for “cyber terrorism” against Russia and a “blank check” for US weapons corporations – including the same companies he encourages his viewers to invest in.\n\nhttps://multipolarista.com/2022/07/05/cnbc-jim-cramer-cyber-terrorism-russia/",
        "timestamp": "2022-07-07 15:58:37"
    },
    {
        "message": "A leftist Spanish member of parliament condemned the NATO summit as it was being held in Madrid, noting it was organized to “enrichen the weapons trade” and “reinforce the geostrategic priorities of the United States … above all to weaken China.” \n\nHe condemned the US “vassalage” represented by NATO, calling for a new “autonomous” European security model based on respect for the Global South.\n\nWe translated his powerful speech and have a video and transcript here:\n\nhttps://multipolarista.com/2022/07/04/spain-nato-subordinate-europe-us-war-china/",
        "timestamp": "2022-07-06 23:12:07"
    },
    {
        "message": "During the first cold war, the CIA poured money into funding and cultivating a pro-imperialist, anti-communist “compatible left.”\n\nToday, the US government uses social media to censor anti-war news outlets and activists.\n\nhttps://multipolarista.com/2022/07/02/censorship-anti-imperialists-compatible-left/",
        "timestamp": "2022-07-02 20:05:07"
    },
    {
        "message": "We interviewed economist Michael Hudson about the inflation crisis and US Federal Reserve’s plan to reduce wages and boost unemployment.\n\nHe warns a “long depression” is coming, due to Washington's new cold war on Russia and China.\n\nA full transcript, video, and podcast version are here:\n\nhttps://multipolarista.com/2022/06/28/michael-hudson-inflation-fed-wages",
        "timestamp": "2022-06-30 18:19:05"
    },
    {
        "message": "The CIA and special operations forces from Britain, France, and Canada are physically in Ukraine, helping direct the proxy war on Russia, overseeing weapons, training, and intelligence.\n\nAt least 20 countries are part of a US Army-led coalition, guiding Ukraine in its fight against Russian troops.\n\nSome Ukrainian combatants are even using US flag patches on their equipment.\n\nhttps://multipolarista.com/2022/06/26/cia-special-ops-ukraine-proxy-war-russia/",
        "timestamp": "2022-06-27 17:39:11"
    },
    {
        "message": "The US organized a meeting with top military officials from apartheid Israel, Saudi Arabia, Qatar, Jordan, Egypt, the UAE, and Bahrain, in order to conspire against Iran.\n\nThis comes while Jordan’s staunchly pro-Western king calls for a “Middle East NATO.”\n\nhttps://multipolarista.com/2022/06/27/israel-saudi-arabia-qatar-uae-iran/",
        "timestamp": "2022-06-27 16:14:42"
    },
    {
        "message": "A US government body held a Congressional briefing plotting ways to break up Russia as a country, in the name of supposed “decolonization.”\n\nIt's the latest example of Washington co-opting progressive-sounding rhetoric to advance its own imperial interests.\n\nThe hearing was introduced by Congressman Steve Cohen, who claimed Russians “have in essence colonized their own country,” arguing Russia is “not a strict nation, in the sense that we’ve known in the past.”\n\nhttps://multipolarista.com/2022/06/23/us-government-decolonize-russia/",
        "timestamp": "2022-06-24 01:32:31"
    },
    {
        "message": "France and Germany pressured African Union leaders for months to join a brief Zoom call with Ukraine’s Volodymyr Zelensky. \n\n51 of 55 African heads of state (93%) boycotted the meeting, showing clear neutrality over the Western proxy war with Russia.\n\nhttps://multipolarista.com/2022/06/22/africa-zelensky-call-neutrality-ukraine/",
        "timestamp": "2022-06-22 16:07:48"
    },
    {
        "message": "We spoke with a leftist Venezuelan journalist about the implications of the victory of left-wing candidate Gustavo Petro in Colombia's presidential election, the easing of a few US sanctions, and Venezuela's 20-year cooperation agreement with Iran.\n\nhttps://www.youtube.com/watch?v=wpouWfsvLYI",
        "timestamp": "2022-06-21 00:54:16"
    },
    {
        "message": "Gustavo Petro won Colombia’s presidential election, becoming the country's first ever left-wing leader. \n\nWe analyzed what this means for Latin America, the US, Venezuela, the military, paramilitary groups, the powerful oligarchy, and social movements:\n\nhttps://multipolarista.com/2022/06/19/colombia-gustavo-petro-election/",
        "timestamp": "2022-06-20 02:35:35"
    },
    {
        "message": "We interviewed Beijing-based journalist Ian Goodrum about the Chinese government's campaign against inequality, crackdown on billionaires, and push for what it calls \"common prosperity.\"\n\nYou can watch or listen to the discussion here: \n\nhttps://multipolarista.substack.com/p/china-billionaires-common-prosperity",
        "timestamp": "2022-06-13 16:57:11"
    },
    {
        "message": "China signed a massive 25-year agreement with Iran in 2021.\n\nVenezuela signed a 20-year cooperation plan with Iran this June.\n\nIn May, Nicaragua's Sandinista government signed economic deals with Iran concerning oil, agriculture, trade, and technology. They also discussed bartering to get around illegal US sanctions.\n\nhttps://multipolarista.com/2022/05/07/nicaragua-agreements-iran-bartering-sanctions/",
        "timestamp": "2022-06-12 17:46:54"
    },
    {
        "message": "Venezuelan President Nicolás Maduro visited Iran and signed a historic 20-year cooperation agreement involving energy, technology, and trade. He pledged solidarity against Western aggression in a joint “anti-imperialist struggle for a better world.”\n\nhttps://multipolarista.com/2022/06/11/venezuela-iran-20-year-agreement/",
        "timestamp": "2022-06-11 23:05:27"
    },
    {
        "message": "The secretary of the Bolivarian Alliance (ALBA), Sacha Llorenti, explains why Latin America wants its own currency:\n\n\"Because imperialism is not just the political control; imperialism is not just territorial control; imperialism is also very, very much linked to natural resources, to the financial system, to how the debt system works; it is very much related to the World Bank, to the International Monetary Fund, the way in which the dollar imposes its will on the whole world.\n\n\"And things are changing. Things are changing, not just in Latin America and the Caribbean, but also in Asia and Africa.\n\n\"So what we are seeing is an empire which is losing its power. And I think that this century will be a century in which we will see the decay U.S. imperialism.\"\n\nFull video and transcript here: https://multipolarista.com/2022/06/08/alba-summit-americas-sacha-llorenti",
        "timestamp": "2022-06-11 13:10:42"
    },
    {
        "message": "We interviewed the secretary of the Bolivarian Alliance (ALBA), Sacha Llorenti, about Latin America's rebellion against the US government's Summit of the Americas, which opened on June 6 in Los Angeles, California.\n\n\"We don't consider this is a summit, nor of the Americas,\" he said. Llorenti condemned the Monroe Doctrine, US sanctions, and the \"superiority complex that runs through US foreign policy.\"\n\n\"Things are changing,\" he added. \"What we are seeing is an empire which is losing its power.\"\n\nhttps://multipolarista.com/2022/06/08/alba-summit-americas-sacha-llorenti/",
        "timestamp": "2022-06-08 20:30:28"
    },
    {
        "message": "Mexico’s President Andrés Manuel López Obrador (AMLO) denounced the illegal US blockade of Cuba as a “type of genocide” and “tremendous violation of human rights.”\n\nhttps://multipolarista.com/2022/06/07/mexico-amlo-us-blockade-cuba-genocide/",
        "timestamp": "2022-06-07 14:46:17"
    },
    {
        "message": "As the US government’s Summit of the Americas opens today in Los Angeles, California, the presidents of Mexico, Bolivia, Honduras and Guatemala are boycotting in protest.\n\nHeads of state representing Latin American countries with more than 200 million people combined are not attending.\n\nIt is a major diplomatic failure for the Joe Biden administration.\n\nhttps://multipolarista.com/2022/06/06/us-summit-americas-mexico-boycott/",
        "timestamp": "2022-06-06 21:41:50"
    },
    {
        "message": "We interviewed US Congress candidate Geoffrey M Young, who is running in Kentucky on an anti-war platform, calling to abolish the CIA, prevent nuclear war, create a Medicare-for-All system of universal healthcare, end the war on drugs, dismantle AFRICOM, and stop arming Nazis in Ukraine.\n\nhttps://multipolarista.com/2022/06/04/kentucky-congress-geoff-young-abolish-cia/",
        "timestamp": "2022-06-04 16:59:11"
    },
    {
        "message": "The United States plans to spend tens of billions of dollars to surround China with missiles.\n\nBut a US military-sponsored study concluded its Pacific allies South Korea, Japan, the Philippines, Thailand, and Australia are unlikely to host the offensive weapons.\n\nhttps://multipolarista.com/2022/06/03/us-china-missiles-country-host/",
        "timestamp": "2022-06-03 15:01:59"
    },
    {
        "message": "Iran proposed a new currency for trade with China, Russia, India, Pakistan, and other members of the Shanghai Cooperation Organization (SCO) - which represents more than 40% of global population and roughly one-third of the world’s GDP.\n\nThis could help circumvent illegal Western sanctions and weaken US dollar hegemony.\n\nhttps://multipolarista.com/2022/06/02/iran-currency-shanghai-cooperation-organization/",
        "timestamp": "2022-06-02 19:47:44"
    },
    {
        "message": "The world faces a food crisis due to war, sanctions, and inflation. China has shown how to strengthen food sovereignty, while fighting poverty, with state-funded agricultural cooperatives, government crackdown on waste, and investment in technology.\n\nhttps://multipolarista.com/2022/05/31/china-food-security-poverty-cooperatives/",
        "timestamp": "2022-06-01 00:52:25"
    },
    {
        "message": "Colombia held presidential elections today. A far-right hundred-millionaire real estate mogul who called himself a “follower” of Nazi dictator Adolf Hitler, Rodolfo Hernández, won second place in round one.\n\nHe will compete against center-left candidate Gustavo Petro in a runoff vote in June.\n\nhttps://multipolarista.com/2022/05/29/colombia-hitler-rodolfo-hernandez/",
        "timestamp": "2022-05-30 02:47:01"
    },
    {
        "message": "US Federal Reserve chairman Jerome Powell said his goal is “to get wages down,” complaining workers have too much power in the labor market.\n\nEconomist Michael Hudson says this is “junk economics,” and corporate monopolies are driving inflation, not wages.\n\nhttps://multipolarista.com/2022/05/24/us-federal-reserve-wages-inflation/",
        "timestamp": "2022-05-24 17:25:07"
    },
    {
        "message": "The top vice presidential candidate for Colombia’s May elections, Francia Márquez, called out the US government for meddling in her country's electoral process.\n\nThe left-wing grassroots activist criticized the war on drugs, militarization, and “free trade,” calling for land reform and reparations.\n\nhttps://multipolarista.com/2022/05/17/us-meddling-colombia-election-francia-marquez/",
        "timestamp": "2022-05-19 22:39:52"
    },
    {
        "message": "The second-most-powerful figure in the Canadian government, Chrystia Freeland is the granddaughter of a Ukrainian Nazi who ran a fascist propaganda newspaper (using a printing press stolen from a Jewish publisher who was killed in a Nazi extermination camp).\n\nWhen Freeland was appointed foreign minister in 2017, the US embassy boasted, \"Canada Adopts 'America First' Foreign Policy.\"\n\nFreeland also helped organize shady regime-change operations, working with right-wing anti-communist Ukrainian groups in the Soviet Union, back in the 1980s.\n\nhttps://multipolarista.com/2022/05/16/canada-gas-prices-putin-china-chrystia-freeland/",
        "timestamp": "2022-05-17 00:40:33"
    },
    {
        "message": "Canada’s deputy prime minister and finance minister, Chrystia Freeland, insisted on the floor of Parliament that her nation’s citizens should not complain about high gas prices, or they are helping Russian President Vladimir Putin and China.\n\nFreeland, the second-most-powerful Canadian official, argued that blaming her government for skyrocketing inflation is equivalent to “doing Vladimir Putin’s work for him.”\n\nhttps://multipolarista.com/2022/05/16/canada-gas-prices-putin-china-chrystia-freeland/",
        "timestamp": "2022-05-17 00:38:00"
    },
    {
        "message": "In this video we show how neoconservative imperialists like Fox News host Tucker Carlson (a CIA applicant) and Republican Florida Governor Ron DeSantis cynically tried to rebrand as \"right-wing populists,\" while pushing war on China, Iran, Cuba, Venezuela, and Palestine.\n\nhttps://www.youtube.com/watch?v=_QHoW8Vf8wg",
        "timestamp": "2022-05-15 15:57:38"
    },
    {
        "message": "Mexican President López Obrador took a historic trip to Cuba, where he called for an end to the US blockade and criticized right-wing “coup-plotters.” \n\nAMLO said Latin America should form a union, amid “the economic decline of the United States.”\n https://multipolarista.com/2022/05/10/cuba-mexico-amlo-us-blockade/",
        "timestamp": "2022-05-10 18:47:56"
    },
    {
        "message": "We're doing a livestream today with economist Michael Hudson to discuss the decline of US dollar hegemony, the sanctions war on Russia, his concept of \"free-trade imperialism,\" and financial parasitism\n\nJoin us at 2pm ET / 11am PT / 1800 UTC\nhttps://youtu.be/qlUSqQ8U8T8",
        "timestamp": "2022-05-09 15:31:05"
    },
    {
        "message": "China invited Argentina to attend the 2022 summits of the BRICS economic bloc of Brazil, Russia, India, China, and South Africa.\n\nArgentina’s ambassador says it's a step toward “formal entry” to the grouping, an alternative to the US-dominated financial system.\n\nhttps://multipolarista.com/2022/05/08/argentina-brics-china-invitation/",
        "timestamp": "2022-05-08 17:32:52"
    },
    {
        "message": "Inside Operation Gladio: How NATO supported Nazis and terrorists\n\nYou can download the podcast here: \nhttps://soundcloud.com/multipolarista/operation-gladio-nato-nazis-terrorists",
        "timestamp": "2022-05-06 21:29:42"
    },
    {
        "message": "Multipolarista host Benjamin Norton is joined by journalist Asa Winstanley to discuss Operation Gladio, the NATO \"stay behind\" networks in which the CIA and other Western intelligence agencies recruited, armed, and trained former Nazis, other fascists, and right-wing terrorists to wage a war on the left:\n\nhttps://www.youtube.com/watch?v=UPhFCAI4SnQ",
        "timestamp": "2022-05-06 20:47:31"
    },
    {
        "message": "While it wages a proxy war on Russia in Ukraine, the US-led NATO military alliance plans to encircle China and expand into the Asia-Pacific region, collaborating with Japan, South Korea, Australia, and New Zealand.\n\nhttps://multipolarista.com/2022/04/09/nato-asia-pacific-china-russia/",
        "timestamp": "2022-05-05 14:54:45"
    },
    {
        "message": "Brazil’s left-wing leader Lula da Silva says if he wins the 2022 presidential elections, “we are going to create a currency in Latin America,” called the Sur (\"South\"), to combat “the dependency on the dollar”\n\nhttps://multipolarista.com/2022/05/04/brazil-lula-latin-america-currency-us-dollar/",
        "timestamp": "2022-05-04 18:58:48"
    },
    {
        "message": "US Immigration and Customs Enforcement (ICE) detained roughly 250,000 people in 200 jails in 2021, using brutal tactics to repress immigrants. This violent apparatus continues to grow under President Joe Biden.\n\nhttps://multipolarista.com/2022/04/21/biden-expanding-ice-cbp-immigration/",
        "timestamp": "2022-05-04 16:10:56"
    },
    {
        "message": "We spoke with a Mexican professor about how the progressive government of President AMLO nationalized lithium and reversed privatization of oil by corrupt past neoliberal leaders.\n\nhttps://multipolarista.com/2022/04/29/mexico-nationalized-lithium-amlo/",
        "timestamp": "2022-05-04 16:10:08"
    },
    {
        "message": "CNN and the New York Times echoed a blatant lie from the Department of Homeland Security, falsely claiming it does not monitor Americans. DHS has for years spied on US journalists and protesters.\n\nhttps://multipolarista.com/2022/05/03/cnn-ny-times-dhs-spying-americans/",
        "timestamp": "2022-05-03 18:55:47"
    },
    {
        "message": "The Washington Post – owned by billionaire oligarch Jeff Bezos, who has CIA and Pentagon contracts – has called for censoring Chinese news outlets on social media, while praising Silicon Valley for purging Russian publications.\n\nhttps://multipolarista.com/2022/04/13/washington-post-censor-chinese-russian-media/",
        "timestamp": "2022-05-01 17:36:03"
    },
    {
        "message": "A German EU official claimed Russians don’t value human life and thus aren’t Europeans. The ex NATO researcher was echoing a centuries-old colonialist trope used to justify genocide of Indigenous peoples, US war on Vietnam, and Israeli occupation of Palestine.\n\nhttps://multipolarista.com/2022/04/15/german-eu-official-russians-dont-value-life/",
        "timestamp": "2022-05-01 17:34:48"
    },
    {
        "message": "The proxy war in Ukraine threatens to drag the Balkans into a larger regional conflict, as the US, EU, and NATO militarize Bosnia and increase pressure on Serbia, and Ukrainian drones crash in Croatia.\n\nhttps://multipolarista.com/2022/04/27/ukraine-nato-eu-militarize-balkans/",
        "timestamp": "2022-05-01 17:34:14"
    },
    {
        "message": "Nicaragua’s Sandinista government expelled the US-dominated OAS and expropriated its office building, where it will now create a public “Museum of Shame” to educate visitors about imperialist crimes committed against Latin America.\n\nhttps://multipolarista.com/2022/04/28/nicaragua-oas-museum-shame/",
        "timestamp": "2022-05-01 17:33:40"
    },
    {
        "message": "The authoritarian Department of Homeland Security (DHS) that oversaw the War on Terror created a “Disinformation Governance Board,” led by anti-Russia information warrior Nina Jankowicz, who ran regime-change ops at a CIA front, smears independent anti-war US media outlets as “Russian disinfo,” and called WikiLeaks “scum.”\n\nhttps://multipolarista.com/2022/04/29/us-dhs-disinformation-nina-jankowicz/",
        "timestamp": "2022-05-01 17:33:14"
    },
    {
        "message": "We were forced to create a new Telegram channel. Follow Multipolarista here for the latest news on US imperialism and the transition to a multipolar world.",
        "timestamp": "2022-05-01 17:33:01"
    }
]