[
    {
        "message": "Project Veritas x #SAS2019\n\nFull video coming soon... stay tuned",
        "timestamp": "2020-01-06 19:38:53"
    },
    {
        "message": "Thanks for coming! https://twitter.com/stillgray/status/1208420159209103360",
        "timestamp": "2020-01-06 19:38:47"
    },
    {
        "message": "Giving away Project Veritas merch and signing hundreds of books Turning Point USA #SAS2019! Come get one! #ProjectVeritasSAS",
        "timestamp": "2020-01-06 19:38:46"
    },
    {
        "message": "Giving a speech about what Project Veritas is all about to over 5,000 students at #SAS2019! \n\nTUNE IN NOW! https://www.pscp.tv/w/cM4tETFWR2p2YUxWTWxSS098MWxEeExvZ2dkRHdKbXcfV3dCBUsDvm6WRLpJYx-N31dHQhh4WXqlT2JuiGqR",
        "timestamp": "2020-01-06 19:38:44"
    },
    {
        "message": "It’s truly incredible how many media outlets get sued on a regular basis — but this does nothing to impugn their credibility. \n\n“I thought when someone journalists get sued it’s evidence they’re “controversial.” https://twitter.com/SharylAttkisson/status/1208200491450142720",
        "timestamp": "2020-01-06 19:38:44"
    },
    {
        "message": "Big Tech Elites in Silicon Valley are manipulating algorithms to prevent you from seeing information they don't want you to.\n\nThey will be censoring our next release, make sure sign up for our dedicated distribution list right now: https://www.projectveritas.com/sign-up-for-our-newsletter/",
        "timestamp": "2020-01-06 19:38:44"
    },
    {
        "message": "Why does this suddently meet ABC News News “editorial standards” now? Because it will get ratings now they got in trouble? #EpsteinCoverup https://abcnews.go.com/2020/video/truth-lies-jeffrey-epstein-january-9th-98c-abc-67835696",
        "timestamp": "2020-01-06 19:19:08"
    },
    {
        "message": "#EpsteinCoverup https://www.thewrap.com/abc-news-to-air-2-hour-special-and-podcast-series-on-epstein-after-accusations-of-initially-ignoring-the-story/",
        "timestamp": "2020-01-06 19:19:08"
    },
    {
        "message": "Gee, I wonder what compelled this. https://twitter.com/Variety/status/1208039468814479361",
        "timestamp": "2020-01-06 19:19:07"
    },
    {
        "message": "Understand that to the political press corps, a GOP that unanimously backed the president and opposed Pelosi is “at times irrational,” and three Democrats voting against their speaker and one defecting from the entire party is “almost uniformly” in line.\n\nhttps://thefederalist.com/2019/12/19/why-impeachment-is-a-massive-blunder-for-nancy-pelosi/",
        "timestamp": "2020-01-06 19:19:07"
    },
    {
        "message": "So now not only are you biased, but you’re good at lying too? The truth always comes out... https://twitter.com/rachaelmbade/status/1207526214715531264",
        "timestamp": "2020-01-06 19:19:07"
    },
    {
        "message": "“Merry impeachment” to you too The Washington Post Marty Baron \n\nWhen you’re celebrating political victories over drinks, just remember there are an army of patriots who May be watching, waiting, recording...\n\nToodles! 🤗\nRachael BadeePaul KanelKaroun Demirjiann @seungminkinMike DeBonissb",
        "timestamp": "2020-01-06 19:19:07"
    },
    {
        "message": "The impeachment news just lead to new insiders within institutions asking us for hidden cameras in the last few hours. \n\n“What can I do.”\n\nAnswer: Be brave. Join us.\n\nEmail veritastips@protonmail.com or send us an encrypted Signal message at 914-653-3110. \n\nDo something.",
        "timestamp": "2020-01-06 19:19:06"
    },
    {
        "message": "Never Forget #ImpeachmentDay #ExposeCNN",
        "timestamp": "2020-01-06 19:19:06"
    },
    {
        "message": "Your boss Jeff Zucker was recorded by CNN whistleblower Cary Poarch saying to focus on impeachment at the expense of other stores... “impeachment is the story.” #ExposeCNN https://twitter.com/brianstelter/status/1207268396510920705",
        "timestamp": "2019-12-18 22:10:32"
    },
    {
        "message": "We are going to need a bigger wall. These \"journalists\" just can't seem to stick to the facts. https://twitter.com/bessertkj/status/1207035035464982528",
        "timestamp": "2019-12-17 22:52:02"
    },
    {
        "message": "The only thing We’re known for? Pimp protocol doesn’t require the wearing of a coat to be a Pimp. We discussed starting brothels. The MA attorney general actually admitted a number of damning things in the tapes. You will be forced to print a correction. https://twitter.com/alanrmacleod/status/1207022865838739456",
        "timestamp": "2019-12-17 22:52:02"
    },
    {
        "message": "DEFAMATION! Name one thing that has come out of someone’s mouth we’ve published that isn't real. I can name dozens of retractions/corrections media has done, including settlements. Salon had to print one about me in 2010!\n\nName one you hack! Put up or shut up Alan MacLeod",
        "timestamp": "2019-12-17 22:52:01"
    },
    {
        "message": "Shadowbanning isn't a conspiracy theory when you can see their lips moving and hear the words coming out of their own mouths. \n\nHelp me fight back and sign up for our dedicated distribution list for releases right now: https://www.projectveritas.com/sign-up-for-our-newsletter/",
        "timestamp": "2019-12-17 22:52:01"
    },
    {
        "message": "Grateful for the opportunity to share Project Veritas mission to continue exposing corruption to over 5,000 students at #SAS2019 this weekend; and YES, I will be recruiting them to go undercover and wear cameras in the 2020 elections.\n\n12/21/19\n10:40am",
        "timestamp": "2019-12-17 22:52:00"
    },
    {
        "message": "Go ahead with the ridiculous posturing and quotation marks. ABC confirmed our info from our insider, (still on the inside) and officially they are announcing, after we published the “leaked” schedule. https://twitter.com/bubbaprog/status/1206785223024881669",
        "timestamp": "2019-12-17 04:21:08"
    },
    {
        "message": "BREAKING: The #EpsteinCoverup saga continues. Another ABC News News Insider has just LEAKED Project Veritas the propsed date for the Jeffrey Epstein story they have been sitting on for over three years.\n\nWill ABC News be showing Amy Robach interview with Virginia Giuffre that they spiked?",
        "timestamp": "2019-12-17 04:05:23"
    },
    {
        "message": "It is pretty much a guarantee that Twitter is going to shadowban our next release...\n\nTo make sure you see it, sign up for our dedicated distribution list right now: https://www.projectveritas.com/sign-up-for-our-newsletter/",
        "timestamp": "2019-12-16 20:36:39"
    },
    {
        "message": "2020 is almost here. \n\nProject Veritas is EXPANDING.  \n\nDo you have what it takes?\n\nApply now: http://projectveritas.com/brave\n\n#BeBrave",
        "timestamp": "2019-12-16 14:13:53"
    },
    {
        "message": "On the inside? Contact Project Veritas.\n\nhttp://projectveritas.com/brave",
        "timestamp": "2019-12-16 14:13:53"
    },
    {
        "message": "Did you sign up yet? 2020 is going to be our biggest year yet. \n\nStay tuned: https://www.projectveritas.com/sign-up-for-our-newsletter/ https://twitter.com/jamesokeefeiii/status/1205529380774129664",
        "timestamp": "2019-12-16 14:13:52"
    },
    {
        "message": "Might be time to update that bio Steve Brusk \n\n#ExposeCNN",
        "timestamp": "2019-12-16 14:13:52"
    },
    {
        "message": "“Saleeby also graphically described Brusk’s behavior towards women, and mentioned a time he felt the need to keep a woman away from Steve Brusk” https://dailycaller.com/2019/12/13/cnn-producer-project-veritas-resign/",
        "timestamp": "2019-12-16 14:13:52"
    },
    {
        "message": "UPDATE: CNN White House Unit Supervising Producer Steve Brusk who was recently featured in our #ExposeCNN series, has resigned from his position amid sexual misconduct allegations at the network.\n\nThe question remains however, who were the higher ups that were protecting him?",
        "timestamp": "2019-12-13 22:38:17"
    },
    {
        "message": "A CNN producer(Steve Brusk) abruptly resigned, according to a Thursday report, just weeks after he was implicated by another network staffer of sexual misconduct, in leaked videos from the conservative watchdog group Project Veritas. https://www.foxnews.com/media/cnn-producer-steve-brusk-resigns-project-veritas",
        "timestamp": "2019-12-13 19:00:09"
    },
    {
        "message": "Well Berin Szóka, looks like your poor performance at the debate has created a cultural moment.\n\nStill waiting on you to point out just ONE lie. https://twitter.com/yuhboyLilTrump/status/1205368688263618561",
        "timestamp": "2019-12-13 18:24:13"
    },
    {
        "message": "We already know jack 🌍🌏🌎 is going to shadowban our next release.\n\nMake sure you get your name on our dedicated video distribution list right now: https://www.projectveritas.com/sign-up-for-our-newsletter/",
        "timestamp": "2019-12-13 16:47:57"
    },
    {
        "message": "High time, we made a stand \nAnd shook up the views of the common man\nAs the headline says you're free to choose\nThere's egg on your face and mud on your shoes\nOne of these days they're gonna call it the blues\n\n#UKElections",
        "timestamp": "2019-12-13 16:27:42"
    },
    {
        "message": "BREAKING: CNN Politics Producer Steve Brusk Resigns Weeks After Project Veritas Video Accuses Him of Misconduct (Exclusive) https://www.thewrap.com/steve-brusk-resigns-cnn-politics-weeks-after-project-veritas-video-accuses-him-of-misconduct/",
        "timestamp": "2019-12-13 15:41:56"
    },
    {
        "message": "Big Tech elites in Silicon Valley don't want you to see our videos exposing them. That's why they've worked together to take down our investigations. \n\nBe sure you see our next release, get on our dedicated mailing list NOW: https://www.projectveritas.com/sign-up-for-our-newsletter/",
        "timestamp": "2019-12-13 15:41:55"
    },
    {
        "message": "Last night at a debate on Big Tech's political bias, TechFreedom CEO Berin Szóka called me a liar and stated Project Veritas wasn't \"real journalism\". I challenged him to name just one lie I have published and I would donate $10,000 to the charity of his choice. \n\nSTILL WAITING.",
        "timestamp": "2019-12-13 15:41:55"
    },
    {
        "message": "",
        "timestamp": "2019-12-12 15:40:41"
    },
    {
        "message": "Debate starting now, tune in!\n\nWatch: http://Facebook.com/joinlincoln/\n\nVote: http://pollEV.com/reboot",
        "timestamp": "2019-12-12 15:40:41"
    },
    {
        "message": "It's not a conspiracy theory when there is tape of the Twitter, FB, and Google employees' lips moving -- while they articulate how they intend to play partisan politics with their platforms.\n\nSee you tonight at the debate. https://twitter.com/BerinSzoka/status/1204893769184600064",
        "timestamp": "2019-12-12 15:40:39"
    },
    {
        "message": "\"What about the algorithms? Can you do something with that to say, less of that?\" - PV\n\n\"Thats what the news carousel kind of does...it's above the search results...we can say this shelf of videos from (our)news partners is legitimate news...\" -YouTube\n\n#youtubeisoverparty",
        "timestamp": "2019-12-12 15:40:39"
    },
    {
        "message": "Join us tonight in San Francisco as Harmeet K. Dhillon and I debate Mike Godwin and Berin Szóka on Big Tech and the future of political speech online.\n\nInfo: https://www.eventbrite.com/e/debate-big-tech-and-the-future-of-political-speech-online-registration-75899265747",
        "timestamp": "2019-12-12 15:40:35"
    },
    {
        "message": "Twitter calls it shadowbanning. https://twitter.com/CarpeDonktum/status/1204812180979359744",
        "timestamp": "2019-12-12 15:40:34"
    },
    {
        "message": "They also refused to air the #EpsteinCoverup https://twitter.com/MZHemingway/status/1204804524365496320",
        "timestamp": "2019-12-12 15:40:33"
    },
    {
        "message": "WATCH: Hong Kong: Fight For Freedom! \n\nDocumentary by Stefan Molyneux https://youtu.be/WOfPpr_Zstk",
        "timestamp": "2019-12-12 15:40:33"
    },
    {
        "message": "2020 is right around the corner and we want to make sure you stay up to date with everything we are doing here Project Veritas.\n\nGet your name on this list now to receive our newsletters and be the first to see when new content drops! \n\nSign up now: https://www.projectveritas.com/sign-up-for-our-newsletter/",
        "timestamp": "2019-12-10 19:30:10"
    },
    {
        "message": "Vanity Fair: Project Veritas put out a leak of Amy Robach complaining that ABC had quashed her Epstein scoops for years, mentioning Alan Dershowitz and Bill Clinton and adding, “What we had was unreal,” outlets like the NYT and CNN ignored it.\n\nLink: https://www.vanityfair.com/news/2019/12/jeffrey-epstein-and-why-paranoia-makes-sense",
        "timestamp": "2019-12-07 22:34:49"
    },
    {
        "message": "There’s no solidarity in journalism circles about Govt spying on journalists and releasing reporter phone records.\n\nThere is a Manichean view of the world that has taken over left and right alike.\n\nBut the media IS the Democratic Party now. There is no distinction anymore. https://twitter.com/MZHemingway/status/1202299239155585026",
        "timestamp": "2019-12-06 15:53:31"
    },
    {
        "message": "",
        "timestamp": "2019-12-06 06:32:11"
    },
    {
        "message": "",
        "timestamp": "2019-12-06 06:32:11"
    },
    {
        "message": "Anatomy of Fake News: Wonkette confronted with factual error, says it was an 'opinion' piece. Same 'sued for portraying untruthfully' exists on Slate by Dave Weigel(now The Washington Post), which hyperlinked to The Atlantic via Conor Friedersdorf, who printed a retraction for reporting it.",
        "timestamp": "2019-12-06 06:32:11"
    },
    {
        "message": "Can’t fire all our ammo at once. https://twitter.com/gerryscott4/status/1202686850931949568",
        "timestamp": "2019-12-06 05:29:28"
    },
    {
        "message": "Well played. https://twitter.com/ProfsrChaos/status/1202672193265487872",
        "timestamp": "2019-12-06 05:29:28"
    },
    {
        "message": "The #YouTubeRewind is a joke. \n\nProject Veritas #EpsteinCoverup leaked tape of Amy Robach explaining how ABC News quashed her story literally broke the internet for weeks.\n\nOf course they wouldn't put it on there.",
        "timestamp": "2019-12-05 19:29:23"
    },
    {
        "message": "So deceptive editing is fair game now?\n\nIf ANYONE can find a deceptive edit on anything Project Veritas has published in the last 5 years I will personally donate $10,000 to the charity of you choice. https://twitter.com/JoeBiden/status/1202401954644865024",
        "timestamp": "2019-12-05 18:38:49"
    },
    {
        "message": "Matthew Phelan, the problem here is that its NOT factually accurate. Major outlets like Conor Friedersdorf at The Atlantic have retracted that Project Veritas “wildly misrepresented” someone.\n\nLawsuit was over consent!\n\nYour J-school buddy Charles Seife wont retract because error is “6yrs old” https://twitter.com/cbmdp/status/1202335575480655875",
        "timestamp": "2019-12-05 18:38:49"
    },
    {
        "message": "Yesterday, our brave Pinterest Insider and a personal hero of mine Eric Cochran was honored in DC with an Impact Award for 2019. \n\n#BeBrave",
        "timestamp": "2019-12-05 18:38:48"
    },
    {
        "message": "Your NYU J-school hate fuels me. \nWe do our best work when we’re hated.\n\nPV wins 7 straight lawsuits, including defamation, in fed court. Where were you? You didn’t say a damned word.\nNow you’re reduced to penis jokes, Prof. \n\nHow journalism ends,\nNot with a bang but a whimper. https://twitter.com/cgseife/status/1202406863750520832",
        "timestamp": "2019-12-05 18:38:42"
    },
    {
        "message": "You’re a prof of journalism at NYU who called me a “bellend” for seeking a correction on a falsehood other media outlets have corrected.\n\nYou agree the falsehood should remain because it’s six years old. \n\nThat’s anathema to basics standards of fairness in journalism. \n\nSuck it. https://twitter.com/cgseife/status/1202405875425665029",
        "timestamp": "2019-12-05 04:50:15"
    },
    {
        "message": "Congrats to Michelle Malkin for receiving the Impact Award from Ginni Thomas at the United in Purpose 2019 Awards. \n\nMichelle has supported PV for 10+ years even when we stood falsely accused. That happens. She’s a good person, cares about justice and will always be my friend.",
        "timestamp": "2019-12-05 04:45:39"
    },
    {
        "message": "Then you defend the decision not to publish a falsehood against PV, Charles Seife of NYU, bc the statute of limitations had run out?\n\nAs a prof of journalism, you’re arguing not to correct because the lie was... not recent.\n\nHow dumb do you have to be to teach journalism at NYU?",
        "timestamp": "2019-12-04 22:52:32"
    },
    {
        "message": "The thing is Charles Seife of NYU journalism school, Conor Friedersdorf of The Atlantic already corrected this. But you make a penis joke when an organization attempt to set the facts straight with the record\n\nIs that your position?\n\nIf so, please double down.\n\n Oh and I will die on this hill.",
        "timestamp": "2019-12-04 22:52:28"
    },
    {
        "message": "Why hello Charles Seife Charles Seife of NYU Journalism school. You are in this thread using a phallic metaphor to attack Project Veritas and defend “Wonkette” for refusing to correct published falsehood others corrected — namely lawsuit settlement. The lie?\n“Portrayed untruthfully” https://twitter.com/cgseife/status/1202340288263524358",
        "timestamp": "2019-12-04 22:52:28"
    },
    {
        "message": "A celebrity is a big name. A hero is a big man.” Eric risked his livelihood for the public’s right to know. He is my hero. https://twitter.com/michellemalkin/status/1202293273726980097",
        "timestamp": "2019-12-04 22:52:28"
    },
    {
        "message": "Nah, it’s a bigger failing many of your friends didn’t say a word regarding ABC squashing stories on Epstein to protect their access to the Clintons and the Palace.\n\nBut as Alinsky says, they live in a world not of angels but of angles, not moral principles but power principles. https://twitter.com/mattyglesias/status/1201824023082127360",
        "timestamp": "2019-12-04 22:52:27"
    },
    {
        "message": "Why not just exterminate people with money and take their stuff?\n\nThat’s what we’re really talking about right?\n\nI guarantee your like minded comrades talk this way in private inside campaigns. \n\nIn fact we know they do. Stay tuned... https://twitter.com/markruffalo/status/1201176660252475392",
        "timestamp": "2019-12-04 22:52:27"
    },
    {
        "message": "[VIDEO] Kamala Harris campaign staffer Dylan Stafford recently boasts to Project Veritas Action journalist that Harris could \"Kick Donald J. Trump ass\".\n\n#VeritasIsEverywhere",
        "timestamp": "2019-12-03 23:27:13"
    },
    {
        "message": "Are you seeing things that the public needs to know about? If you come forward, Project Veritas will have your back. \n\nBecome an Insider: http://projectveritas.com/brave",
        "timestamp": "2019-12-03 23:26:13"
    },
    {
        "message": "Common theme in media world. Decent rank and file behind the scenes upset at what their editors and media bosses have become. Legendary local TV investigative reporter Clarence Jones one said journalism needs “bosses with balls” to do any journalism at all. https://twitter.com/jonathanvswan/status/1201556356630753282",
        "timestamp": "2019-12-03 23:25:39"
    },
    {
        "message": "Project Veritas is no stranger to YouTube censorship 60 Minutes. You might remember that earlier this year Susan Wojcicki and her team removed our insider story on their Silicon Valley friend Pinterest to protect them from being exposed censoring Pro-Life groups.",
        "timestamp": "2019-12-03 23:25:39"
    },
    {
        "message": "You had the opportunity, Lesley Stahl , to ask Susan Wojcicki why YoutTube took down our Pinterest investigation. Eric Cochran lost his job blowing the whistle.\n\nInstead, your line of questioning suggests more censorship needed. It’s why people are fed up with the media cartel. https://twitter.com/60minutes/status/1201305457731743745",
        "timestamp": "2019-12-03 23:25:36"
    },
    {
        "message": "We’re hiring. \n\nSpread the word and apply at http://projectveritas.com/brave\n\n#BeBrave",
        "timestamp": "2019-12-02 01:03:11"
    },
    {
        "message": "#EpsteinCoverup https://www.latimes.com/entertainment-arts/business/story/2019-11-29/does-network-tv-news-still-want-to-be-in-the-investigative-reporting-business",
        "timestamp": "2019-12-02 01:03:10"
    },
    {
        "message": "Twitter has banned Project Veritas ability to promote ads for new Undercover journalists.\n\nWe need you to help spread the message far and wide. Share/RT!\n\nWe are hiring, apply today: http://ProjectVeritas.com/brave",
        "timestamp": "2019-11-27 20:14:58"
    },
    {
        "message": "WALL OF SHAME RETRACTION #305\n\nToday we salute you Conor Friedersdorf of The Atlantic for RETRACTING the very thing that your hack journalism has been cited for on my wildly defamatory Wikipedia page for 7 years. Next time, try sticking to the facts. \n\n#Retracto",
        "timestamp": "2019-11-27 03:57:16"
    },
    {
        "message": "On Nov. 21, Project Veritas received another email from Twitter Ads. The email, which was also shared with the MRC, said, “Project Veritas, your account is ineligible to participate in Twitter Ads.\" \n\nhttps://www.newsbusters.org/blogs/techwatch/corinne-weaver/2019/11/26/project-veritas-banned-twitter-ads-inappropriate-content",
        "timestamp": "2019-11-27 03:56:15"
    },
    {
        "message": "You’re about to be put on blast Conor Friedersdorf of The Atlantic for retracting your false statement the subject of our video was “portrayed untruthfully.” You could’ve avoided this if you stuck to the facts — the thing you chastised us for. Funny how that works. You hypocrite. You HACK.",
        "timestamp": "2019-11-26 18:51:50"
    },
    {
        "message": ".Steven Crowder and Stu Burguiere discussing ABC News News Anchor Amy Robach belief that there is no way that Jeffrey Epstein killed himself.\n\n#EpsteinCoverup",
        "timestamp": "2019-11-26 18:51:49"
    },
    {
        "message": "BREAKING: Twitter Attacks Project Veritas; BANS Twitter Ads Account",
        "timestamp": "2019-11-25 21:58:59"
    },
    {
        "message": "One person can change the world.  \n\n1.) Become our next Insider http://projectveritas.com/brave \n\n2.) Confidentially email us tips at veritastips@protonmail.com\n\n#BeBrave, contact Project Veritas",
        "timestamp": "2019-11-25 01:50:01"
    },
    {
        "message": "Robbins suing Buzzfeed: “When anyone can spread gossip and false information without consequence, and online and entertainment media companies disguise themselves as “news organizations”, we must ask a fundamental question: Who is watching the watchdogs?” https://medium.com/@TonyRobbins/who-is-watching-the-watchdogs-126f59da378",
        "timestamp": "2019-11-25 01:49:15"
    },
    {
        "message": "The media lives in two divergent realities. But there can only be one reality. Tim Pool https://twitter.com/garbyjooman/status/1198022768656183296",
        "timestamp": "2019-11-25 01:49:15"
    },
    {
        "message": "Planned Parenthood asked Vice Journalists to Agree to NDAs to Attend a Media Happy Hour. All you blue check mark journalists that celebrated ⁦David Daleiden⁩ jury conviction for his reporting after signing NDAs — you reap what you sow.  https://www.vice.com/en_us/article/d3amda/planned-parenthood-asked-journalists-to-agree-to-ndas-to-attend-a-media-happy-hour-heres-why-thats-a-problem",
        "timestamp": "2019-11-25 01:49:15"
    },
    {
        "message": "Project Veritas is expanding. Do you want to do what we do? \n\nJoin our Army of Guerrilla Journalists today: http://projectveritas.com/journalist-application",
        "timestamp": "2019-11-25 01:49:14"
    },
    {
        "message": "Verification means nothing, impact means everything. https://twitter.com/carpedonktum/status/1197680699417006080",
        "timestamp": "2019-11-25 01:49:14"
    },
    {
        "message": "We’ve been waiting all day for the comment James Goldston... Where is it? #EpsteinCoverup",
        "timestamp": "2019-11-25 01:49:10"
    },
    {
        "message": "Incredible. ABC News news forced to cover The Duke of York stepping down from public duties while systematically avoiding the reason for his decision; aka their #EpsteinCoverup https://abcnews.go.com/amp/International/prince-andrew-step-back-public-duties-due-ill/story?id=67170243&__twitter_impression=true",
        "timestamp": "2019-11-25 01:49:10"
    },
    {
        "message": "BREAKING: ABC News President James Goldston tells Project Veritas that ABC News will be issuing a statement later today on the Congressional letter of inquiry sent by Kevin McCarthy regarding the #EpsteinCoverup.\n\nStay tuned, this story is rapidly developing.",
        "timestamp": "2019-11-25 01:49:10"
    },
    {
        "message": "The #EpsteinCoverup is far from over. Senator Ben Sasse backed Kevin McCarthy request for information from ABC News News related to the outlet's decision not to run a story about a Jeffrey Epstein accuser years ago. https://www.washingtonexaminer.com/news/sasse-backs-mccarthys-demand-for-answers-from-abc-news-on-suppressing-epstein-story?_amp=true",
        "timestamp": "2019-11-25 01:49:09"
    },
    {
        "message": "WALL OF SHAME RETRACTION #304\n\nToday we salute you, The Journal Inquirer!\n\nCongratulations on your induction to the Project Veritas Wall of Shame. Next time, maybe try factual reporting rather than #FakeNews.",
        "timestamp": "2019-11-25 01:49:09"
    },
    {
        "message": "\"She also had a witness come forward that had pictures that had Clinton involved and others...I'm not talking about the editorial authority of ABC News but I think they have a moral authority to answer these questions. What outside influence stopped this story?\" - Kevin McCarthy",
        "timestamp": "2019-11-25 01:49:05"
    },
    {
        "message": "“MSM” journos get sued all the time for publishing false info. The millionth case study below. But notice it doesn’t appear in their Wiki page or in an appositive phrase every time they are mentioned in print or on air.\n\nRival MSM protect each other in symbiosis like a cartel. https://twitter.com/politicalelle/status/1196534475359834112",
        "timestamp": "2019-11-25 01:49:05"
    },
    {
        "message": "“All three morning shows on Monday ignored the move by Congress to investigate ABC News covering up the network’s burying of the Jeffrey Epstein story back in 2016,” Media Research Center associate editor Scott Whitlock wrote. #EpsteinCoverup https://www.foxnews.com/media/morning-shows-skip-house-republicans-urging-abc-to-explain-why-it-spiked-jeffrey-epstein-story",
        "timestamp": "2019-11-25 01:49:05"
    },
    {
        "message": "ABC News has come under fire after Project Veritas released a video of anchor Amy Robach Nov. 5 complaining that the network killed her interview with Epstein accuser Virginia Roberts Giuffre.  #EpsteinCoverup https://amp.dailycaller.com/2019/11/17/kevin-mccarthy-letter-abc-jeffrey-epstein",
        "timestamp": "2019-11-25 01:49:04"
    },
    {
        "message": "We would submit the people who do journalism without fear or favor, exist ONLY on these platforms. The networks are systemically corrupt and this fact has become self-evident. https://twitter.com/SamCrowley/status/1196223761193803776",
        "timestamp": "2019-11-25 01:49:04"
    },
    {
        "message": "BREAKING: Congress to investigate ABC News News... via Megyn Kelly \n\n#EpsteinCoverup",
        "timestamp": "2019-11-25 01:49:00"
    },
    {
        "message": "",
        "timestamp": "2019-11-25 01:49:00"
    },
    {
        "message": "",
        "timestamp": "2019-11-25 01:49:00"
    },
    {
        "message": "“My tendency to be too honorable” is why I stayed at the home of Jeffery Epstein. - Prince Andrew\n\n“War is peace. Freedom is slavery. Ignorance is strength.” ― George Orwell, 1984.\n\n#EpsteinCoverup http://EpsteinCoverup.com https://twitter.com/Reuters/status/1195831409845379073",
        "timestamp": "2019-11-25 01:48:59"
    },
    {
        "message": "These people are drunk with power.\n\nAnd the media plays right into because muh access. https://twitter.com/RitaPanahi/status/1195639192631406595",
        "timestamp": "2019-11-25 01:48:59"
    }
]