[
    {
        "message": "Allies Vow Tougher Stance on Russia, but Are Running Short of New Tactics\n\nPresident Biden and leaders of more than 30 nations convened Thursday to demonstrate united opposition to Russia’s invasion of Ukraine, announcing new economic sanctions, aid for refugees, deployment of more forces to Eastern Europe and grim preparations in case Russia uses chemical, biological or nuclear weapons.\n\nBut the historic gathering of world leaders in a series of three summits on Thursday underscored how the U.S. and its allies have in some ways reached their self-imposed limits in crafting a united global response to the largest European conflict in more than a half-century. While they are sharpening the tools they are using against Russia, they appear to have few new ones.\n\nEuropeans have said they are not willing to bear the consequences of new limits on the Russian energy that they depend on. And Mr. Biden has said he is not willing to commit troops to Ukraine and risk going to war against Russia. Read more\n\n@nytimes",
        "timestamp": "2022-03-25 00:14:32"
    },
    {
        "message": "Ukrainians pouring into tiny Moldova find a welcoming but strained country.\n\nAnna Sevidova was injured when her home was shelled in Ukraine. Now she’s recovering in a hotel turned refugee home in Moldova, facing an uncertain future for her family.\n\nAs Ukrainian refugees flood into Moldova, one of Europe’s poorest countries says it is reaching a breaking point. With a population of just 2.6 million, Moldova has taken in 107,000 people, making it the highest per-capita recipient of those fleeing the war with Russia. They now account for over 4 percent of Moldova’s population.\n\nThe New York Times traveled to the country in March and met Ukrainians who have recently sought refuge there. Read more\n\n@nytimes",
        "timestamp": "2022-03-24 17:38:02"
    },
    {
        "message": "NATO boosts its readiness, and Ukraine’s, for any possible Russian use of weapons of mass destruction.\n\nNATO allies agreed to provide Ukraine with equipment and training to deal with the fallout from a possible Russian attack using chemical, biological or even nuclear weapons, and the alliance was increasing its own preparedness for any such event, NATO’s secretary general, Jens Stoltenberg, said on Thursday.\n\nMr. Stoltenberg, who was speaking to reporters after a NATO summit in Brussels on Thursday, said that the alliance was worried Russia might deploy chemical or biological weapons — which are banned by international treaty — because it appeared that Moscow was creating a false narrative that the West was about to use them. Read more\n\n@nytimes",
        "timestamp": "2022-03-24 15:40:34"
    },
    {
        "message": "The Biden administration says the U.S. will accept 100,000 refugees from Ukraine.\n\nThe United States will accept 100,000 Ukrainian refugees into the country and will donate $1 billion to help European countries deal with the surge of migrants fleeing Russia’s invasion of their country, a person familiar with the decision said on Thursday.\n\nMore than three million Ukrainians have poured into Poland and other countries as the forces of President Vladimir V. Putin of Russia have bombarded civilian areas in cities across Ukraine.\n\nUnited States officials have repeatedly said they expect that most Ukrainian refugees will want to stay in Europe, close to their homes. But President Biden, who is in Brussels for three back-to-back summits with allies, is expected to announce that the administration will accept 100,000 refugees who want to come to America. Read more\n\n@nytimes",
        "timestamp": "2022-03-24 13:47:15"
    },
    {
        "message": "Ukrainian forces claim to destroy a Russian landing ship.\n\nUkraine’s military said on Thursday that it had destroyed a Russian ship at a port under Russian occupation in southern Ukraine, in what would be a success for the Ukrainians as they seek to keep Russia from reinforcing and resupplying its forces as its forces struggle to gain momentum.\n\nRussia has faced logistical challenges across Ukraine in its monthlong invasion, and its forces have largely stalled in their efforts to advance on major cities. They have been most successful in the south, where an early push out of Crimea and amphibious assaults launched by naval infantry allowed them to gain control over parts of the coastlines of the Black Sea and Sea of Azov.\n\nThe port of Berdyansk, which Russia captured in late February, offered Moscow a way to bring reinforcements and supplies closer to critical areas of fighting in Mariupol and across Ukraine’s eastern front. Read more\n\n@nytimes",
        "timestamp": "2022-03-24 12:29:10"
    },
    {
        "message": "More than half of Ukrainian children have been forced from their homes by war, a U.N. agency says.\n\nRussia’s war in Ukraine has driven more than half the country’s children from their homes, the U.N. children’s agency said on Thursday, calling it one of the largest displacements of children since World War II.\n\nSome 4.3 million Ukrainian children from a total estimated child population of 7.5 million have been displaced, UNICEF said. This includes 1.8 million children who have taken refuge in neighboring countries and more than 2.5 million who are in temporary shelter within the country.\n\nU.N. monitors in Ukraine have reported that 81 children have been killed since the start of the invasion and 104 have been injured. But they emphasize their assessment of civilian casualties is conservative and that the real toll will be much higher.\n\n“This is a grim milestone that could have lasting consequences for generations to come,” Catherine Russell, UNICEF’s director, said in a statement.\n\nRead more\n\n@nytimes",
        "timestamp": "2022-03-24 10:22:47"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\nAs President Biden geared up for an extraordinary set of strategy summits with NATO allies and the European Union on Thursday, Ukrainian forces made gains in beating back Russian troops in the battle for the capital, Kyiv.\n\nRussian troops were pushed back by several miles to the east of Kyiv and appeared to be stopping their advance an digging in defensive positions to the northwest of the city, a senior U.S. defense official said Wednesday evening. Britain’s defense intelligence agency confirmed that assessment, saying that Ukrainian forces were carrying out successful counterattacks on Kyiv’s outskirts.\n\nWith the war entering its second month, Russia’s military has increasingly unleashed artillery, bombs and missiles against civilian targets as its invasion has stalled. The U.S. government has formally concluded that Russian forces had committed war crimes.\n\nAmid fears that President Vladimir V. Putin might turn to more deadly tactics, NATO on Wednesday said it would help Ukraine prepare for possible chemical, biological and even nuclear threats from Russia. The alliance also announced it was doubling its military presence in the countries on its eastern flank near Ukraine.\n\nIn other major developments:\n\nThe White House has assembled a team of U.S. national security officials to sketch out scenarios of how the United States and its allies should respond if Mr. Putin unleashes chemical, biological or nuclear weapons.\n\nIn his nightly address, President Volodymyr Zelensky of Ukraine called for global protests to mark one month since Russia’s invasion. “The world must stop the war,” he said. “Come to your squares, your streets. Make yourselves visible and heard.\"\n\nMr. Biden is not expected to press his European counterparts to cut off their flow of Russian energy. Instead, European leaders are set to announce steps they will take, with the help of the United States, to reduce their dependence on it.\n\nA Russian rocket attack on a residential area in Kyiv appeared to be from a Grad multiple rocket launcher, the first time such weapons have struck the heart of the Ukrainian capital and a further indication that Russian troops have artillery within range of the city center. Read more\n\n@nytimes",
        "timestamp": "2022-03-24 05:43:26"
    },
    {
        "message": "As Biden Visits Europe Over Crisis, NATO Says It’s Doubling Eastern Flank Forces\n\nNATO announced a doubling of its military presence near Ukraine on Wednesday and said the alliance would help the country prepare for possible chemical, biological and even nuclear threats from the Russian invaders, which would be a once-unthinkable expansion in the month-old war.\n\nThe announcement came hours before President Biden landed in Europe for an extraordinary strategy session with the alliance, which was created in 1949 to contain the Soviet Union. The warnings underscored the urgency of efforts to prevent the conflict from spreading beyond Ukraine and entangling NATO in a direct fight with Russia.\n\nMr. Biden’s NATO meeting will be followed by meetings with leaders of the Group of 7 nations and the European Union. The E.U. discussion is expected to explore ways to tighten the severe Western economic sanctions on Russia that are aimed at pressuring President Vladimir V. Putin into halting the war. Read more\n\n@nytimes",
        "timestamp": "2022-03-24 04:39:24"
    },
    {
        "message": "The U.S. government accuses Russian forces of war crimes.\n\nThe U.S. government has formally concluded that Russian forces have committed war crimes in Ukraine, Secretary of State Antony J. Blinken said in a statement on Wednesday.\n\nThe finding lends official weight to expressions of revulsion about Russia’s military conduct from top U.S. officials, including President Biden, who last week called Russian President Vladimir V. Putin “a war criminal.”\n\nBut the statement did not mention Mr. Putin himself, saying only that “members of Russia’s forces” had committed such crimes. State Department officials declined to say whether their findings might implicate Mr. Putin.\n\nRussia has denied its military has purposely targeted civilians, but witness accounts, news reports and photos, videos and satellite imagery demonstrate that Russian forces have increasingly been aiming bombs, rockets and missiles at towns and cities and destroying apartment buildings, schools, factories and hospitals. Read more\n\n@nytimes",
        "timestamp": "2022-03-23 22:34:39"
    },
    {
        "message": "Russia’s attacks on civilian targets have obliterated everyday life in Ukraine.\n\nIn the weeks since Russia began its invasion, at least 1,500 civilian buildings, structures and vehicles in Ukraine have been damaged or destroyed, pulverizing everyday life for people across the country.\n\nThe catalog of destruction has been devastating. Civilians have been killed in their cars. Remnants of a missile were found in a zoo. At least one memorial in the small city of Bucha, close to Kyiv, took gunfire. Bridges and railway stations have been blown up.\n\nThe Times found that the buildings and other civilian infrastructure attacked included at least 23 hospitals and other health care infrastructure, 330 schools, 27 cultural buildings, 98 commercial buildings, of which at least 11 related to food or agriculture, and 900 houses and apartment buildings. At least 10 houses of worship have become targets. Read more\n\n@nytimes",
        "timestamp": "2022-03-23 20:00:58"
    },
    {
        "message": "NATO doubles its battlegroups in Eastern Europe ahead of multiple summits.\n\nNATO is doubling its battlegroups on the alliance’s eastern flank in response to Russia’s continuing war in Ukraine, the group’s secretary general said on Wednesday before a major summit in which President Biden will meet with European allies in Brussels in the coming days.\n\nThe secretary general, Jens Stoltenberg, also focused on what import Russia’s potential use of any chemical or biological weapons in Ukraine could hold for NATO, saying that such use would “fundamentally change the nature of the conflict.” And he upped the rhetoric on China’s role in bringing the conflict to an end, cautioning Beijing not to provide material support to Moscow.\n\n“The first step is the deployment of four new NATO battlegroups in Bulgaria, Hungary, Romania and Slovakia, along with our existing forces in the Baltic countries and Poland,” he said. Read more\n\n@nytimes",
        "timestamp": "2022-03-23 17:50:56"
    },
    {
        "message": "Western assessments indicate Russian forces stalled in much of Ukraine.\n\nThe latest Western intelligence reports and military analyses indicate that Russian forces remain stalled across much of the Ukrainian battlefield four weeks after the invasion began.\n\nA report on Wednesday from British defense intelligence suggested that the battlefield in the north of the country has stayed largely static for days. Russia is “likely conducting a period of reorganization before resuming large-scale offensive operations,” the assessment said.\n\nUkraine warned again that Russia was seeking to bring Belarus, Ukraine’s northern neighbor, into the war, saying it saw signs that Russian and Belarusian military equipment was being moved across Belarus and accumulating along its border with Ukraine.\n\nDespite a lack of momentum, Russian forces still have wreaked devastation in parts of the country. Read more\n\n@nytimes",
        "timestamp": "2022-03-23 15:47:40"
    },
    {
        "message": "Kyiv mayor says Ukrainian forces have pushed Russians from a fraught suburb.\n\nThe mayor of Kyiv, Vitali Klitschko, said on Wednesday that Ukrainian forces had succeeded in pushing back Russian troops from part of a northwestern suburb but warned that the battle for his country could take weeks more, even months.\n\n“Almost the whole of Irpin is in Ukrainian hands,” the mayor said, naming the suburb where Ukrainian and Russian troops have been engaged in street fighting for weeks. Russian troops were close to the eastern suburb of Brovary, he added, and a “big battle” was taking place behind the northern district of Lutezh.\n\nThe mayor gave an outdoor briefing for the news media beside St. Michael’s Cathedral, along with his brother Wladimir, who often accompanies the mayor as an adviser and bodyguard.\n\nBoth men are former world champion heavyweight boxers and sent a message of thanks to the world for standing by Ukraine, and appreciation to the international media for continuing to bear witness, despite the dangers. Three journalists have died while reporting on the war.\n\nRead more\n\n@nytimes",
        "timestamp": "2022-03-23 15:40:03"
    },
    {
        "message": "The E.U. will make 10,000 hospital beds available for Ukrainian refugees.\n\nThe European Union will make at least 10,000 hospital beds available for Ukrainian refugees in need of urgent medical attention, it said Wednesday, noting that more than 3.5 million people had fled into the bloc, almost half of them school-age children.\n\nThe announcement is part of a broader effort to support member nations in providing health care, access to labor markets, education and housing for Ukrainian refugees. Other measures include providing education materials in Ukrainian and financial and logistical support for E.U. citizens who are hosting refugees in their homes.\n\nThe mass of refugees has posed a massive economic and logistical challenge for the E.U., presenting what the United Nations has called Europe’s fastest-growing refugee crisis since World War II. Some early estimates put the bill for housing, transporting, feeding and processing the flood of humanity at $30 billion in the first year alone. Read more\n\n@nytimes",
        "timestamp": "2022-03-23 15:26:48"
    },
    {
        "message": "Putin’s climate envoy steps down from his Kremlin post, reportedly over the Ukraine war.\n\nPresident Vladimir V. Putin’s climate envoy was reported to have become the senior-most Russian government official to quit over the war in Ukraine.\n\nBloomberg reported that the envoy, Anatoly Chubais, had left the country, “citing his opposition” to the war. The state news agency Tass said only that Mr. Chubais, a former deputy prime minister under President Boris N. Yeltsin in the 1990s, had stepped down from his Kremlin post.\n\nA spokeswoman for Mr. Chubais declined to comment.\n\nHis departure would be the most striking example of discord in Russia’s ruling elite over Mr. Putin’s invasion, which appears to have taken even many senior officials by surprise.\n\nA slew of Russian performers and state television journalists have already left the country since the war’s beginning and spoken out against it. But government officials, for now, have stuck to the Kremlin line. Read more\n\n@nytimes",
        "timestamp": "2022-03-23 13:43:37"
    },
    {
        "message": "Ukrainians Try to Push Back Russian Forces Pummeling Their Cities\n\nUkrainian forces pressed to thwart the Russian invasion, mounting counteroffensives on multiple fronts and retaking a town outside of Kyiv on Tuesday, while the more heavily armed Russians, unable so far to gain a decisive upper hand, tried to pound Ukraine’s cities and people into submission.\n\nAs the fighting seesawed around Kyiv, Ukrainian military officials said their forces had prevailed in Makariv, a key crossroads on the western approaches to the city, while in the south of the country they sought to reclaim the Kherson region. The southern port of Mariupol still endured a brutal siege, however, with the government saying that some 100,000 civilians remained trapped in that ruined city with little food, water, power or heat.\n\n“This war will not end easily or rapidly,” Jake Sullivan, the U.S. national security adviser, told reporters on the eve of President Biden’s departure for a NATO summit in Europe. \n\nRead more\n\n@nytimes",
        "timestamp": "2022-03-23 09:28:28"
    },
    {
        "message": "Here are the latest developments in the war in Ukraine.\n\nPresident Biden is heading to Brussels on Wednesday to meet with NATO allies and is expected to announce new sanctions aimed at Russian lawmakers as the United States and its allies aim to pressure Russia from all sides and Ukrainian forces mount a counteroffensive they say has retaken ground outside Kyiv.\n\nPresident Zelensky of Ukraine said in an address to his nation Wednesday morning that any new sanctions should be aimed at people “responsible for this war” and that efforts to “force Russia to peace” are difficult and “sometimes scandalous” but that “step by step we are moving forward.”\n\nOn the ground, Ukraine’s forces have slowed Russia’s advance, though the heavily armed Russian army continues to try pounding Ukrainian cities and people into submission.\n\nUkrianian forces have launched counteroffensives on multiple fronts, and military officials say they had retaken a key town outside of Kyiv on Tuesday. In the south of the country, they sought to reclaim the Kherson region.\n\nThe southern port of Mariupol still endured a brutal siege, however, with the government saying that some 100,000 civilians remained trapped in that ruined city with little food, water, power or heat.\n\nJake Sullivan, the U.S. national security adviser, told reporters that, “This war will not end easily or rapidly.”\n\nThe Pentagon has assessed that Russia’s “combat power” in Ukraine — comprising more than 150,000 troops massed in Belarus and western Russian before the invasion — has dipped below 90 percent of its original strength for the first time, reflecting the losses Russian troops have suffered at the hands of Ukrainian soldiers.\n\nRussia’s military difficulties and mounting economic pressure from sanctions have raised concerns about how Putin will respond. On Tuesday, Dmitri S. Peskov, the spokesman for Putin, repeatedly refused to rule out the possibility of using nuclear weapons, telling CNN that “if it is an existential threat for our country, then it can be.”\n\nIn other major developments:\n\nPresident Zelensky told Italy’s Parliament that “Ukraine is the gate for the Russian army — they want to enter Europe,” and warned that “famine was approaching for several countries” that depended on Ukrainian corn, oil and wheat.\n\nThere are 33 prisons in active conflict zones inside Ukraine, local officials said. Getting drinking water, heat and electricity, to prisons closest to the fighting has been difficult, government officials said.\n\nRussia has withdrawn most of its helicopters from a strategic airport in Kherson, in southern Ukraine, according to satellite images analyzed by The Times, in what experts said could be a telltale sign of Russian military setbacks in the south of the country. Read more\n\n@nytimes",
        "timestamp": "2022-03-23 04:43:49"
    },
    {
        "message": "Walls, Dreams and Genocide: Zelensky’s Speeches Invoke History to Rally Support\n\nHe told U.S. lawmakers that he had a dream, invoking Martin Luther King Jr. to describe Ukraine’s fight against the Russian invasion. He said to the British Parliament that his country would fight until the end, in forests and fields, a vow resonant of Winston Churchill’s exhortations against Nazism. To members of the German Parliament, he spoke of a new wall dividing Europe, echoing the Berlin Wall of the Cold War.\n\nThe passionate speeches, delivered remotely by President Volodymyr Zelensky of Ukraine in his now-ubiquitous military-issue shirt, are part of a rhetorical effort to rally international support — for arms, or aid to his country, or sanctions against Russia.\n\nMr. Zelensky, a former comedian who became president in 2019, is no stranger to performing, and his social-media missives and speeches have transformed him into a global symbol of his country’s resistance to Russian aggression. Read more\n\n@nytimes",
        "timestamp": "2022-03-22 23:28:27"
    },
    {
        "message": "Maps: Tracking the Russian Invasion of Ukraine\n\nThe Ukrainian Army is mounting an aggressive counteroffensive to retake lost territory in the Kherson region of southern Ukraine, according to Ukrainian and U.S. officials.\n\nRussian forces are making advances in the east, but are largely stalled elsewhere. Read more\n\n@nytimes",
        "timestamp": "2022-03-22 19:49:05"
    },
    {
        "message": "Speaking to Italy’s Parliament, Zelensky evokes the threat of famine and the fate of Europe.\n\nIn a speech by video link, President Zelensky warned Italy’s Parliament  that the invasion of his country could become a stepping stone for Russian forces seeking to enter Europe, and that famine would strike in parts of the world if Ukrainian farmers were unable to do their work.\n\n“Ukraine is the gate for the Russian army — they want to enter Europe,” he said. “But barbarity should not enter.”\n\nMr. Zelensky warned that “famine was approaching for several countries” that depended on Ukrainian corn, oil and wheat, including Italy’s “neighbors across the sea,” referring to some North African nations.\n“How can we sow under the strikes of Russian artillery? How can we cultivate when our enemy destroys our fields and our fuel?” he said.\n\nIn response, Prime Minister Draghi of Italy said that the country wanted Ukraine to join the European Union, and praised the “heroic” resistance of the Ukrainians. Read more\n\n@nytimes",
        "timestamp": "2022-03-22 14:53:35"
    },
    {
        "message": "Aleksei Navalny Convicted of Fraud by Russian Court\nThis post has been updated.\n\nA Russian court sentenced the imprisoned opposition leader Aleksei A. Navalny to nine years in a high-security prison on Tuesday and ordered him to pay a fine of about $11,500.\n\n“Navalny committed fraud, that is, the theft of other people’s property through deceit and breach of trust,” the judge said in reading her verdict, according to the news agency Interfax.\n\nProsecutors claimed that Mr. Navalny and his former Anti-Corruption Foundation embezzled people’s donations.\n\nThe verdict, however, was widely seen as a move by the Kremlin to keep Mr. Navalny behind bars beyond the expiration of his current two-and-a-half-year prison term, ostensibly for violating the terms of his parole, in 2023.\n\nFor President Putin, the war against Ukraine has made the fiery opposition leader even more of a liability. Read more\n\n@nytimes",
        "timestamp": "2022-03-22 12:06:35"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\nBesieged cities across Ukraine were bracing for intensifying Russian attacks as President Biden renewed his warning that Russia may be gearing up to use chemical or biological weapons. The president also conferred with European leaders on how to dial up pressure on Russia ahead of his visit to the continent this week.\n\nAn unfounded allegation by the Russian leader, Vladimir V. Putin, that the United States and Ukraine had weapons of mass destruction in the country was “a clear sign he’s considering using” them, Mr. Biden told CEOs at the Business Roundtable on Monday evening. “He’s already used chemical weapons in the past, and we should be careful about what’s to come.”\n\nFrustrated in its attempts to take control of Kyiv and other cities in a war that analysts say is grinding into a stalemate, Russia is resorting to long-range missiles and other weapons to bombard cities from afar. Rescue workers in Kyiv were sifting through the wreckage of one of the strongest such attacks, which destroyed a sprawling mall in the Ukrainian capital. City officials said that at least eight people had been killed at the mall, which housed a multiplex movie theater, a fitness club and fast-food restaurants like McDonald’s and KFC.\n\nThe bulk of Russian forces are still more than 15 miles from the center of Kyiv, which remains the primary objective of the Russian military, British defense officials said.\n\nMr. Biden confirmed that Russia had used a hypersonic missile in Ukraine, the first use of such a weapon in combat, which Moscow had previously said it used on an ammunition depot in western Ukraine.\n\nThe president called it “a consequential weapon” that is nearly impossible to stop, and said that its use was a sign that Russia’s military was running out of options in the face of fierce Ukrainian resistance. “It’s the only thing they can get through with absolute certainty,” he said.\n\nIn other major developments:\n\nIn response to Mr. Biden’s labeling of Mr. Putin as a “murderous dictator” and a “pure thug,” Russia’s foreign ministry said Monday that the comments had put “Russian-American relations on the verge of breaking.”\n\nIn a video address shared online early Tuesday, President Volodymyr Zelensky of Ukraine condemned Russian attacks on protesters in the city of Kherson in the south and strikes in the Zaporizhzhia region in the southeast, where four children were hospitalized.\n\nScant information was available from the strategically positioned city of Mariupol, just 40 miles from the Russian border and key to Russia’s efforts to complete a land bridge to Crimea. The city has been cut off from water, electricity and communications and has been nearly impossible to escape due to fierce fighting. A Ukrainian official accused Russian forces of firing on buses evacuating women and children from the city.\n\nUkraine’s foreign ministry said children had been forcibly relocated from the eastern Donbas region, the site of fighting for control over two separatist areas since 2014. Oleg Nikolenko, the ministry’s spokesman, said in a statement that 2,389 children were taken from their parents on a single day, March 19. The claim could not be independently confirmed.\n\nRead more\n\n@nytimes",
        "timestamp": "2022-03-22 04:18:06"
    },
    {
        "message": "The Smaller Bombs That Could Turn Ukraine Into a Nuclear War Zone\n\nToday, both Russia and the United States have nuclear arms that are much less destructive than the bomb dropped on Hiroshima during World War II. That makes their use perhaps less frightening and more thinkable.\n\nConcern about these smaller arms has soared as Vladimir V. Putin, in the Ukraine war, has warned of his nuclear might, has put his atomic forces on alert and has had his military carry out risky attacks on nuclear power plants. The fear is that if Mr. Putin feels cornered in the conflict, he might choose to detonate one of his lesser nuclear arms — breaking the taboo set 76 years ago after Hiroshima and Nagasaki.\n \n“The chances are low but rising,” said Ulrich Kühn, a nuclear expert at the University of Hamburg and the Carnegie Endowment for International Peace. “The war is not going well for the Russians,” he observed, “and the pressure from the West is increasing.” Read more\n\n@nytimes",
        "timestamp": "2022-03-22 00:03:30"
    },
    {
        "message": "",
        "timestamp": "2022-03-21 20:28:19"
    },
    {
        "message": "",
        "timestamp": "2022-03-21 20:28:18"
    },
    {
        "message": "",
        "timestamp": "2022-03-21 20:28:18"
    },
    {
        "message": "An Ancient City Transformed by War\n\nThe majority of the three million people who have fled Ukraine have passed through Lviv’s train and bus stations. The city, transformed by the war, is overstuffed with people and emotion. Energy and despair. Anger and determination.\n\nSimple rituals, like having coffee in a cafe have taken on a new and sometimes surreal meaning in a radically altered context. Read more\n\n@nytimes",
        "timestamp": "2022-03-21 20:28:17"
    },
    {
        "message": "Russian Court calls Meta, owner of Facebook and Instagram, an extremist organization and bans it.\n\nA Russian court ruled that Meta, which owns Facebook, Instagram and WhatsApp, is an extremist organization and banned it from operating on Russia’s territory.\n\nThe “extremist” label will apply to Instagram and Facebook, but not to WhatsApp, and is effective immediately, according to Tass, a state news agency. The ruling followed Meta’s decision to allow users in Ukraine to call for violence against the Russian Army in the context of the invasion.\n\nDuring arguments in the Tverskoy court in Moscow, the plaintiffs’ lawyers said that individuals will not be prosecuted for using Instagram or Facebook. But, according to an analysis by a legal rights group that tracks internet freedoms in Russia, Net Freedoms Project, the court’s ruling will mean that using Instagram or Facebook logos in public — for example, on a clothing store’s website or on the door of a cafe — could result in up to 15 days in jail.\n\nRead more",
        "timestamp": "2022-03-21 16:23:55"
    },
    {
        "message": "U.K. accuses Russia of hoax phone calls to British cabinet ministers.\n\nRussia was behind two hoax phone calls placed to top British cabinet ministers by a person pretending to be Ukraine’s prime minister, a spokesman for Prime Minister Boris Johnson said Monday.\n\nThe calls — to Defense Secretary Ben Wallace and Home Secretary Priti Patel — were purportedly from Denys Shmyhal, the prime minister of Ukraine. A third call, targeting the culture secretary, Nadine Dorries, did not go through.\n\n“The Russian state was responsible for the hoax telephone calls made to U.K. ministers last week,” said the Downing Street spokesman, who by custom was not identified by name. He did not give more specific details.\n\nMr. Wallace said on Twitter that he had been targeted by an impostor who “posed several misleading questions and after becoming suspicious, I terminated the call.”\n\nRead more",
        "timestamp": "2022-03-21 16:05:58"
    },
    {
        "message": "A Russian missile strike reduces a Kyiv mall to smoldering ruins.\n\nA Russian missile strike reduced a sprawling shopping mall in Kyiv to a smoldering ruin, one of the most powerful strikes to rock the center of the Ukrainian capital since the war began last month.\n\nCity officials said at least eight people were killed, though the toll was likely to rise from the explosion around midnight at the shopping mall, Retroville, in northern Kyiv. It was so powerful that it blew debris hundreds of yards in every direction, shook buildings and flattened one part of the mall. It turned the parking lot into a sea of flames.\n\nRoughly eight hours after the strike, firefighters were still battling pockets of flames while soldiers and emergency crews searched the rubble for any survivors or casualties. By 8 a.m. local time, the rescuers had pulled out six bodies and covered them with plastic, and they held out little hope for finding survivors. A soldier at the scene said body parts littered the wreckage.\n\nRead more",
        "timestamp": "2022-03-21 11:16:21"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\nUkraine rejected a demand to surrender the city of Mariupol by 5 a.m. Monday, as Russian forces broadened their bombardment of the strategic port and forcibly deported thousands of residents, according to city officials and witnesses.\n\nIryna Vereschuk, a deputy prime minister of Ukraine, told Ukrainska Pravda that her country rejected the Russian demand for surrender. She called on Russia to open a humanitarian corridor in Mariupol so thousands of civilians trapped with little food or water can escape.\n\nMilitary experts now describe the war as a bloody stalemate, with Russian troops appearing to lose ground around Kyiv, the Ukrainian capital, while making some gains in the east.\n\nRussia is increasingly turning to long-range missiles and targeting civilians as Ukraine stifles its ground campaign, despite Russia’s superior manpower and weaponry. Mariupol has become a grim symbol of Russian brutality and frustration.\n\nThe situation there deteriorated even more over the weekend, with reports of Russian forces successfully conquering three neighborhoods and Russian naval vessels shelling the city.\n\nAmong the latest targets in Mariupol was an art school, where about 400 residents were hiding, according to city officials who claimed it had been bombed by Russian forces targeting civilians. The number of casualties was not known.\n\nThe week ahead was shaping up to be a busy one for members of the reinvigorated NATO alliance, which is holding an emergency summit in Brussels on Thursday. Poland said it would propose a peacekeeping mission in Ukraine at the meeting, an idea that is at odds with the alliance’s official stance and one the United States rejected on Sunday.\n\nIn other major developments:\n\nPresident Biden, before leaving on a trip to Europe, plans to hold a call on Monday with the leaders of France, Germany, Italy and Britain. He will head to Brussels on Thursday and then to Warsaw to meet with Poland’s president on Friday.\n\nUkrainian officials said that an attack by a Russian tank on a home for seniors in eastern Ukraine’s Luhansk region had killed 56 people on March 11. The incident was belatedly reported, the authorities said, because fighting had made access impossible.\n\nThe deputy commander of Russia’s Black Sea fleet, Andrei Paliy, died in combat in Mariupol, according to the governor of Sevastopol, the Crimean city where the fleet is based. Paliy is one of several high-ranking Russian officers who have been killed in action in Ukraine.\n\nPresident Volodymyr Zelensky of Ukraine called for renewed peace talks with Russia, despite few signs of progress after four days of negotiations last week.\n\nRead more",
        "timestamp": "2022-03-21 04:05:40"
    },
    {
        "message": "Russia Broadens Mariupol Assault as Signs of Stalemate Take Shape\n\nFiring rockets and bombs from the land, air and warships in the Sea of Azov, Russian forces broadened their bombardment of the besieged Ukrainian city of Mariupol on Sunday and have forcibly deported thousands of residents, according to city officials and witnesses.\n\nAmong the freshly devastated was an art school, where about 400 residents were hiding, according to city officials who claimed it had been bombed by Russian forces targeting civilians. The number of casualties was not known.\n\nInto the fourth week of the Russian assault on Ukraine, the strategic port that would give Russia control over much of the southern coast has become a grim symbol of Russian frustration that its superior manpower and weaponry have not forced the quick capitulation of Ukraine. It has also come to symbolize Russia’s brutality, as its forces target civilian sites with long-range missiles to crush the public’s spirit and break the military resistance.\n\nRead more",
        "timestamp": "2022-03-20 22:43:50"
    },
    {
        "message": "Ukraine War Threatens to Cause a Global Food Crisis\n\nThe war in Ukraine has delivered a shock to global energy markets. Now the planet is facing a deeper crisis: a shortage of food.\n\nA crucial portion of the world’s wheat, corn and barley is trapped in Russia and Ukraine because of the war, while an even larger portion of the world’s fertilizers is stuck in Russia and Belarus. The result is that global food and fertilizer prices are soaring. Since the invasion last month, wheat prices have increased by 21 percent, barley by 33 percent and some fertilizers by 40 percent.\n\nThe upheaval is compounded by major challenges that were already increasing prices and squeezing supplies, including the pandemic, shipping constraints, high energy costs and recent droughts, floods and fires.\n\n“Ukraine has only compounded a catastrophe on top of a catastrophe,” said David M. Beasley, the executive director of the World Food Program, the United Nations agency that feeds 125 million people a day.\n\nRead more",
        "timestamp": "2022-03-20 20:24:45"
    },
    {
        "message": "After about 600 hours, 64 workers at the Chernobyl plant have been relieved.\n\nAfter more than three weeks without being able to leave the Chernobyl nuclear power plant in northern Ukraine, 64 workers were able to be rotated out, the plant said on Sunday.\n\nStaff at the plant, which includes more than 200 technical personnel and guards, had not been able to rotate shifts since Feb. 23, a day before Russian forces took control of the site, according to the International Atomic Energy Agency, which serves as a nuclear watchdog for the United Nations.\n\nIn a Facebook post, the plant said that to rotate the 64 workers, 46 volunteers were sent to the site to make sure operations at the plant could continue. It was unclear whether the remaining workers would also have an opportunity to be rotated.\n\nRead more",
        "timestamp": "2022-03-20 19:15:32"
    },
    {
        "message": "As Russian forces pushed toward Kyiv, they stormed an apartment complex in a nearby suburb and held residents hostage. The New York Times spoke with seven people who escaped and obtained security camera footage and videos from witnesses.\n\n“It was really scary,” said Lesya Borodyuk, a 49-year-old resident, tearing up at one point as she spoke. “I wrote to my daughter. I was saying goodbye to her. I told her that probably we will be bombed now.”\n\nThe soldiers made around 200 residents stay, holding many of them hostage in the basements of their own buildings, forcing them to hand over their phones and taking over their apartments. Others were able to avoid detection but still were essentially prisoners in their own homes as Russian forces moved into the buildings, which had housed 560 families, and took up sniping positions.\n\nRead the full article and see more videos.",
        "timestamp": "2022-03-20 16:28:34"
    },
    {
        "message": "Here are the latest developments in the war in Ukraine.\n\nRussian forces made significant gains in Ukraine, advancing into the port of Mariupol, destroying an underground weapons depot and leaving a barracks in ruins following one of the deadliest rocket strikes on Ukraine’s military in the nearly month-old war.\n\nAmid the bloodshed, President Volodymyr Zelensky repeated his calls for meaningful peace negotiations with Russia. “I want everyone to hear me now, especially in Moscow. It’s time to meet. Time to talk,” Mr. Zelensky said in his nightly address.\n\nAs the fighting raged, Ukraine faced a worsening humanitarian crisis, and military losses mounted on both sides. A senior Ukrainian military official said on Saturday that the strike on the barracks, which happened Friday in the southern city of Mykolaiv, had killed more than 40 marines.\n\nAt the city morgue, the bodies of dozens of marines in uniform were laid out side by side in a storage area. A morgue employee would not specify the number of dead brought from the site of the attack.\n\nHere are the latest developments in Ukraine:\n\nRussia is using long-range missiles to devastating effect, even as its ground advance on key targets remain stalled.\n\nRussia claimed it fired a missile capable of hypersonic speed in an attack on an ammunition depot in western Ukraine. Such missiles are at the center of an arms race among the United States, Russia and China.\n\nAt least 847 civilians — including 64 children — have been killed since Russia’s invasion of Ukraine, in what United Nations officials say is almost certainly an undercount.\n\nRead more",
        "timestamp": "2022-03-20 04:32:58"
    },
    {
        "message": "The battle for Kyiv could be the biggest urban battle in decades.\n\nThe city of Kyiv, Ukraine’s capital, covers 325 square miles and roughly two million people remain there after extensive evacuations of women and children. Capturing it, military analysts say, would require a furious and bloody conflict that could be the world’s biggest urban battle in 80 years.\n\n“What we are looking at in Kyiv would dwarf anything we’ve seen since World War II,” said David Kilcullen, a retired lieutenant colonel in the Australian Army who has studied urban combat.\n\nFor comparison, one of the largest urban battles this century was the nine-month siege of Mosul, Iraq, in 2016 and 2017 to oust its Islamic State occupiers. Mosul covers 70 square miles and had a wartime population of about 750,000 people.\n\n“There’s no talk of capitulation for Kyiv,” said Lt. Tetiana Chornovol, the commander of an anti-tank missile unit operating on the outskirts of the city. “Everything is going far better than we thought.”\n\nRead more",
        "timestamp": "2022-03-20 03:02:23"
    },
    {
        "message": "Why Vladimir Putin Invokes Nazis to Justify His Invasion of Ukraine\n\nThe language of Russia’s invasion of Ukraine has been dominated by the word “Nazi” — a puzzling assertion about a country whose president, Volodymyr Zelensky, is Jewish and who last fall signed a law combating anti-Semitism. Vladiimir V. Putin, Russia's president, only began to apply the word regularly to Ukraine’s present-day government in recent months, though he has long referred to Ukraine’s pro-Western revolution of 2014 as a fascist coup.\n\nThe “Nazi” slur’s sudden emergence shows how Mr. Putin is trying to use stereotypes, distorted reality and his country’s lingering World War II trauma to justify his invasion of Ukraine. The Kremlin is casting the war as a continuation of Russia’s fight against evil in what is known in the country as the Great Patriotic War, apparently counting on lingering Russian pride in the victory over Nazi Germany to carry over into support for Mr. Putin’s attack.\n\nRead more",
        "timestamp": "2022-03-19 22:55:12"
    },
    {
        "message": "Russian Rocket Attack Turns Ukrainian Marine Base to Rubble, Killing Dozens\n\nThe headquarters of the 36th Ukrainian Naval Infantry Brigade based in the southern city of Mykolaiv is now a pile of rubble. On Saturday, rescuers continued to search for bodies of missing marines.\n\nAn early morning rocket attack a day earlier destroyed the base’s barracks, where an unknown number of marines were sleeping. It killed as many as 40 marines, according to a senior Ukrainian military official, who spoke on condition of anonymity to reveal sensitive military information.\n\nThat number would make it one of the single deadliest attacks on Ukrainian forces since the start of the war three weeks ago. But there are signs the death toll could be much higher.\n\nAll day on Saturday, vans and trucks with homemade signs saying “Load 200,” the code for military deaths, came in and out of the base’s front gates. \n\nAt the Mykolaiv city morgue, dozens of bodies, some in uniform, were laid out side by side in a storage area.\n\nRead more",
        "timestamp": "2022-03-19 20:26:49"
    },
    {
        "message": "Here are the latest developments in the war in Ukraine.\n\nAs the battle for the besieged Ukrainian city of Mariupol has reportedly moved into the city center after weeks of devastating missile barrages, the United Nations estimates that one in five people in Ukraine have been internally displaced or have fled the country since Russia’s invasion began.\n\nIn Mariupol, which has held out for weeks amid brutal missile assaults, an adviser to Ukraine’s president said on Friday, “There is no chance for lifting the siege of Mariupol.” The mayor told BBC that there was now fighting in the city center. If Mariupol falls, it would be one of the few major cities to be taken by the Russians and would give their forces control of a swath of Ukraine’s southern coastline.\n\nOn Saturday, a Ukrainian official in Mariupol accused Russian forces of taking thousands of Ukrainians against their will across the border into Russia, and a desperate race continued in the hopes of rescuing any survivors entombed for a third night in the ruins of a theater-turned-shelter.\n\nAfter days of a slowed offensive, Russian forces had success hitting military targets in recent days. On Friday, a Russian rocket attack on a Ukrainian military barracks in Mykolaiv killed more than 40 soldiers, according to a senior Ukrainian military official. And on Saturday the Russians said, and the Ukrainians confirmed, that they had hit a weapons depot in the west of Ukraine. Russia claimed that its forces had used advanced hypersonic missiles, but that could not be independently verified.\n\nIn other areas, the Ukrainians say they are pressing to take advantage of the slowed Russian ground offensive. Ukraine’s Army claimed to have taken back towns around Kherson, one of the first cities to fall to Russian forces. And to the west, the defense of the strategic city of Mykolaiv continued to hold, preventing a Russian advance on another key port city, Odessa.\n\nHere are the latest developments:\n\nPresident Volodymyr Zelensky of Ukraine called publicly on Saturday for direct negotiations with President Vladimir V. Putin of Russia, but a senior Turkish official said that Mr. Putin was not ready for such talks.\n\nAround Kyiv — Ukraine’s capital, a key target of the Russian offensive — new satellite imagery appeared to show Russian artillery establishing defensive positions, digging in for a long fight.\nUkrainian celebrities killed in the Russian invasion add an extra dimension to the country’s shock and anguish over the war.\n\nPeople in the city of Lviv in western Ukraine placed 109 colorful, empty strollers on a public square to symbolize children killed in Russian bombardments.\n\nRead more",
        "timestamp": "2022-03-19 16:59:08"
    },
    {
        "message": "As Russia targets civilians, one in five Ukrainians have fled their homes.\n\nMore than a fifth of the 44 million people who were living in Ukraine before Russia invaded the country last month have been internally displaced or have fled to other countries, according to estimates from the United Nations.\n\nAnd for those who remain in the country, millions face a daily struggle for survival as cities hard hit by fighting run low on food, lack clean water, have no access to medical care and operate in many places without heat and electricity.\n\nThe United Nations’ International Organization for Migration said in a report this month that “over 12 million people are estimated to be stranded in affected areas or unable to leave due to heightened security risks, destruction of bridges and roads, as well as lack of resources or information on where to find safety and accommodation.”\n\nRead more",
        "timestamp": "2022-03-19 16:35:55"
    },
    {
        "message": "Here are the latest developments in the war in Ukraine.\n\nPresident Biden warned China’s leader, Xi Jinping, that there would be “implications and consequences” for providing direct military aid to Russia amid a grinding assault in Ukraine that is increasingly aimed at civilian targets.\n\nThe leaders’ nearly two-hour video call came amid intermittent peace talks between Russia and Ukraine, and was the latest example of the international pressure bearing down on Russia’s diminishing circle of allies.\n\nOn Friday, President Vladimir V. Putin of Russia made his first public appearance since ordering the invasion on Feb. 24. He told a crowd in the country’s largest stadium that Russians “have not had such unity for a long time.”\n\nIn Ukraine, Russian forces expanded their attacks into the western parts of the country. A Russian missile strike about four miles from the western city of Lviv destroyed several buildings that were used to repair aircraft, shattering the relative calm in that city and stoking fears that the conflict could spread to other countries in Europe.\n\nHere are the latest developments:\n\nRefugees fleeing Russia’s violence in Ukraine are being targeted for sexual exploitation, human trafficking and child abuse, aid organizations say.\n\nResidents in Mariupol, Ukraine, are burying their neighbors. One video verified by The New York Times shows people digging a hole outside an apartment complex with what appear to be covered bodies on the ground next to them. Another video shows the word “morgue” written on the side of a nearby post office in the Cheryomushki neighborhood.\n\nSome people in China are defying government censors in order to criticize Russia’s attack on Ukraine. The dissenting views have been kept alive by readers on social media platforms like Weibo and WeChat.\n\nThree of Ukraine’s tennis stars — Sergiy Stakhovsky, Andriy Medvedev and Alexandr Dolgopolov — have taken up arms to defend their country.\n\nUkrainian fighters are using a British gift to destroy Russian tanks.\n\nRussia may be heading for a recession, according to the governor of the nation’s central bank. Already, the ruble has lost about 30 percent of its value against the U.S. dollar this year.\n\nRead more",
        "timestamp": "2022-03-19 05:03:12"
    },
    {
        "message": "Citizens of Kyiv\n\nIn the weeks after the invasion of Ukraine, Kyiv, the capital, became a city transformed. Much of its population evacuated. New defense units gathered and took up arms. Field kitchens, aid stations, bomb shelters and evacuation convoys sprouted into functional shapes. The city endured intermittent bombardment. \n\nThis altered streetscape became the uneasy milieu of Alexander Chekmenev, a Ukrainian documentary and portrait photographer who since the 1990s has visually chronicled his country’s post-Soviet life. \n\nChekmenev, who is 52, took care of his family early on, ensuring that his teenage daughter reached safety in Slovakia. He himself remained, venturing out on assignment for The New York Times Magazine to find those who stayed put. Carrying a medium-format Pentax camera, he met some people and approached others as they walked the streets, labored in their new roles or huddled in shelters. \n\nView his portraits of the citizens of Kyiv.",
        "timestamp": "2022-03-19 03:44:29"
    },
    {
        "message": "Biden warns Xi against supporting Russia’s war in Ukraine. \n\nPresident Biden warned President Xi Jinping of China on Friday of repercussions if Beijing decides to give Russia financial or military aid to support its war in Ukraine, White House officials said, but they did not specify what those consequences would be.\n\nMr. Biden laid out for Mr. Xi the punishments that the United States and its allies had imposed on Russia as a result of President Vladimir V. Putin’s invasion of Ukraine last month, said a senior U.S. official, who briefed reporters on the condition of anonymity about the nearly two-hour video call between the two leaders.\n\nThat punishment has mainly taken the form of sanctions that have devastated Russia’s economy, the 11th largest in the world. The implication was that the United States could impose similar sanctions on China, the world’s second-largest economy.\n\nThe call came as Russia is seeking to capture Ukraine’s capital, Kyiv, and second-largest city, Kharkiv, and expand control of the southern coast. But Russian forces are reeling from high casualties — 7,000 or more soldiers killed, according to a conservative American intelligence estimate — and the discovery of critical gaps in its military prowess.\n\nU.S. officials have warned that Mr. Putin is seeking economic help, military hardware and field rations from China. American officials have leaked those findings, perhaps to both embarrass Mr. Putin and put China’s leadership on the spot.\n\nAt a press briefing, Jen Psaki, the White House press secretary, said that after the call, the United States still had concerns about how China would react. “We will continue to watch until we see what actions they take or don’t,” she said.\n\nAsked about the U.S. supplying arms and financial aid to Ukraine while telling China not to supply any to Russia, Ms. Psaki said, “I would remind everybody that Russia is invading Ukraine, not the other way around.” She also said that the material going to Ukraine is purely defensive, adding, “None of the weapons we have sent can be used to launch an invasion of a country like Russia.”\n\nU.S. and European officials see China’s role as a critical one, and decisions by Mr. Xi could push the war in different directions — perhaps toward a cease-fire or more robust diplomatic talks by various parties to negotiate an end to Russia’s campaign, or toward renewed momentum for the Russian forces in their deadly offensive.\n\nMr. Xi, who has built a bond with Mr. Putin over years and has declined to condemn Russia’s actions in Ukraine, gave no indication that he would involve China in efforts for a diplomatic solution, according to an official Chinese readout of the call.\n\nThat summary emphasized the friction between China and the United States over Taiwan before addressing Ukraine. It said Mr. Xi pointed out that “the situation in Ukraine has developed to this point, which China does not want to see,” and reiterated his statements that China would provide humanitarian aid and that Russia and Ukraine should hold peace talks.\n\nThe United States and NATO should also talk with Russia to resolve the crisis, Mr. Xi said, and he used a phrase he and other Chinese officials have employed when blaming troubles on the United States: “Let he who tied the bell on the tiger take it off.”",
        "timestamp": "2022-03-18 21:26:14"
    },
    {
        "message": "Putin makes his first public appearance since the invasion of Ukraine.\n\n\nPresident Putin on Friday made his first public appearance since he ordered Russian troops to invade Ukraine last month, addressing a cheering crowd of tens of thousands of Russians at Moscow’s largest stadium.\n\nThe Luzhniki arena was covered with posters that read “For a world without Nazism” — a nod to one of Mr. Putin’s stated justifications for launching the war in Ukraine, the false claim that Ukraine is run by Nazis.\n\nAs he walked to center stage, Mr. Putin proclaimed that Russians “have not had such unity for a long time.”\n\nHowever, that sense of unity has been called into question by reports that the government mobilized state-linked workers to attend the event, which was officially dedicated to mark the eighth anniversary of Russia’s annexation of Crimea but became an expression of support for the recent invasion of Ukraine.\n\n\nRead more",
        "timestamp": "2022-03-18 21:12:19"
    },
    {
        "message": "Missiles hit Lviv, a safe haven until now, the mayor says.\n\nThe western city of Lviv, about 50 miles from the border with Poland, has been a harbor for Ukrainians fleeing violence since the war began. But on Friday morning, a missile strike about four miles from the city center shattered its relative peace, the city’s mayor said.\n\nMayor Andriy Sadovy said several missiles had struck an aircraft repair plant at the airport complex in Lviv, destroying the buildings. He said that work had previously stopped at the plant and that no casualties had been reported. Smoke could be seen rising from the city’s west, in the general direction of the airport.\n\nAttacks in western Ukraine have been rare since the war began, and Lviv itself has seen few if any. But a Russian airstrike on Sunday at a military base near Poland’s border brought worries of more to come.\n\nRead more",
        "timestamp": "2022-03-18 11:47:16"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\nRussia’s offensive in Ukraine, now in its fourth week, has essentially stalled as its military sustains heavy losses and suffers supply and morale problems, British and American defense officials said on Thursday. But Russian forces are still mounting a siege campaign against major cities, including Kyiv, Kharkiv and Mariupol, often hitting civilian targets and deepening human suffering.\n\nOne of those Russian strikes reduced a theater in Mariupol, where hundreds of people had been sheltering, to a smoldering ruin. Rescuers began pulling out survivors on Thursday, even as bombs continued to fall. With many still unaccounted for and communications in the besieged port city shredded, the extent of the casualties was unknown as of early Friday morning. Also hit this week were a bread line in Chernihiv and a 16-story apartment building in Kyiv, the capital.\n\nThe relentless bombardments have deprived urban populations of food, water and heat. Conditions appear to be no better in some eastern cities controlled by Russia, where witnesses have described desolation and ruin.\n\nThe toll on civilians has led President Biden to sharpen his rhetoric. He has called the Russian president, Vladimir V. Putin, a “war criminal” and a “murderous dictator” over the last two days, prompting protests from the Kremlin. The secretary of state, Anthony J. Blinken, backed up Mr. Biden’s language on Thursday, saying that “intentionally targeting civilians is a war crime.”\n\nHere are the latest developments:\n\nWith Mr. Biden scheduled to talk to China’s leader, Xi Jinping, at 9 a.m. Eastern time on Friday, Mr. Blinken warned China against giving military aid to Russia. He said on Thursday that Mr. Biden would “make clear that China will bear responsibility for any actions it takes to support Russia’s aggression, and we will not hesitate to impose costs.”\n\nThe United Nations, in an emergency session of its Security Council on Thursday, highlighted widespread human suffering in Ukraine, estimating the number of civilian casualties to be 1,900, with 726 people killed — 52 of them children — since the invasion began. The actual numbers are likely a lot higher. The Russian ambassador strongly denied that his country’s forces had deliberately attacked civilians.\n\nRussia has called for another emergency meeting of the Security Council on Friday, to discuss its widely debunked allegations that the United States is helping Ukraine to develop biological weapons. The American and Ukrainian governments have strongly denied the claims, and the U.N. has said it has no evidence of such programs.\n\nThe U.S. House of Representatives voted overwhelmingly on Thursday to strip Russia of its preferential trade status with the United States, moving to further penalize the country’s economy in response to the invasion of Ukraine.\n\nRead more",
        "timestamp": "2022-03-18 05:07:52"
    },
    {
        "message": "Russia Is Destroying Kharkiv\n\nLast month, Dmytro Kuzubov put on his headphones and walked around Kharkiv for hours. He felt that the war would start soon and he wanted to visit some of his favorite places. Kharkiv is his hometown: a vibrant, youthful city of nearly 1.5 million people steeped in academia, art and literature.\n\nThe attacks started a few days later. Unable to take control of the city, Russia has resorted to destroying it. As in Syria and Chechnya, Russia aims to demoralize the city’s inhabitants with overwhelming and indiscriminate firepower. It is following a similar plan in other Ukrainian cities, such as Mariupol and Mykolaiv.\n\n“The most horrible thing was the whistle of jets. I will remember them all my life,” said Mr. Kuzubov, who has since fled Kharkiv, along with hundreds of thousands of others.\n\nIn this article, photos and interviews with residents show what has been lost after three weeks of attacks. Read it here.",
        "timestamp": "2022-03-17 18:59:38"
    },
    {
        "message": "‘Adults and children are emerging’: Survivors are pulled from the rubble of a theater in Mariupol.\n\nRescuers on Thursday began pulling some survivors from the wreckage of a theater in the strategic Ukrainian port city of Mariupol that was struck a day earlier by a Russian attack, according to an adviser to the city’s mayor.\n\nBut more than 24 hours after the attack it was still not clear how many people survived at the site, the Drama Theater of Mariupol, which up to 1,000 people had been using as a shelter in recent days, the adviser, Pyotr Andryushchenko, said in a text message.\n\nUkraine’s human rights ombudsman, Lyudmila Denisova, said that the theater building had withstood the impact of a “high-powered aerial bomb” and later clarified that there was evidence the attack was carried out by a Russian fighter jet. The theater’s basement shielded people from the explosion, Ms. Denisova said in a statement on Facebook.\n\nRead more",
        "timestamp": "2022-03-17 18:16:16"
    },
    {
        "message": "Russian Court Extends Brittney Griner’s Detention\n\nA Russian court has extended the detention of the W.N.B.A. star Brittney Griner to May 19, the Russian news agency Tass reported on Thursday, adding tension to the most dangerous moment in U.S.-Russia relations since the 1962 Cuban missile crisis.\n\nMs. Griner, 31, a seven-time W.N.B.A. All-Star center for the Phoenix Mercury, is being held on drug charges that could carry a sentence of up to 10 years in prison.\n\nThe Russian Federal Customs Service said earlier this month that it had detained the American basketball player after officials found vape cartridges containing hashish oil in her luggage at the Sheremetyevo airport near Moscow in February.\n\nMs. Griner, a two-time Olympic gold medalist, is one of several W.N.B.A. players who compete on international women’s teams in the off-season to supplement paychecks that are a fraction of their counterparts’ salaries in the N.B.A. She has played for the Russian team, UMMC Ekaterinburg, since 2014.\n\nRead more",
        "timestamp": "2022-03-17 16:28:32"
    },
    {
        "message": "A closer look at where Russia’s advance is slowing, and where attacks are increasing.\n\nAs a curfew in Kyiv, Ukraine, ended on Thursday and rescuers dug through the rubble of an attack on a theater in the southeastern city of Mariupol, Western intelligence assessments said that Russian forces were making minimal movement toward capturing additional Ukrainian cities, although they were broadening attacks on civilians.\n\nResidents of Kyiv described a relatively quiet end to a 35-hour curfew that ended on Thursday morning.\n\nIn Kharkiv, Ukrainian forces have held off Russian efforts to fully surround the city, though shelling has left much of it in ruins. And in Kherson, a Black Sea port where Ukrainian forces have been mounting a counteroffensive, the Ukrainian General Staff said on Wednesday that one of its airstrikes had destroyed at least seven Russian helicopters.\n\nRead more",
        "timestamp": "2022-03-17 14:06:07"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\nThe war in Ukraine entered its fourth week on Thursday with no clear signs of a peaceful resolution, hours after President Volodymyr Zelensky made a desperate appeal to the United States and Europe for more aid to help his military fend off invading Russian forces.\n\nThe United States announced another $800 million in aid, in addition to the $13.6 billion that had already been approved, after Mr. Zelensky spoke to Congress on Wednesday as part of his virtual tour to seek moral and financial support from allies. But President Biden stopped short of agreeing to provide what Mr. Zelensky says would be the most valuable tools for repel Russian forces: fighter planes and a no-fly zone over his country.\n\nPeace talks between Russia and Ukraine will enter a fourth day on Thursday. But President Vladimir V. Putin of Russia has sent conflicting signals about his willingness to negotiate — offering optimism for the talks even as Russian forces increasingly target civilians.\n\nOn Thursday morning in Mariupol, a port city that has been under siege for weeks, the fate of hundreds of people inside a shelter was unclear after reports that Russia had bombed it throughout the night.\n\nThe humanitarian toll in Ukraine grows precipitously each day. More than two million people have already left the country as refugees and another two million are displaced inside it.\n\nAll the while, the United States and its allies are pushing Russia further into isolation, imposing sanctions that have pounded its financial system and choked off the flow of foreign currency, stoking fears of a sovereign debt default.\n\nHere’s the latest on the war:\n\nMore than 7,000 Russian soldiers have died since the start of the war, possibly crimping morale, according to American intelligence. That is greater than the number of American troops killed over 20 years in Iraq and Afghanistan.\n\nMr. Zelensky, in his nightly speech, asked world leaders to impose more sanctions on Russian leaders, to help put pressure on the government to end the war.\n\nMr. Biden called Mr. Putin a \"war criminal,\" escalating the clash of words between the two leaders. A top Russian official said the comment was \"unacceptable and unforgivable.\"\n\nRead more",
        "timestamp": "2022-03-17 05:55:44"
    },
    {
        "message": "U.S. officials say Russian troop deaths are climbing, threatening its military’s morale.\n\nRussia’s military has in three weeks lost more than 7,000 soldiers, greater than the number of American troops killed over 20 years in Iraq and Afghanistan, according to American intelligence estimates.\n\nThe American officials, who spoke on the condition of anonymity to discuss operational matters, caution that their numbers of Russian troop deaths are inexact, compiled through analysis of the news media, Ukrainian figures (which tend to be high, with the latest at 13,500), Russian figures (which tend to be low, with the latest at 498), satellite imagery and careful perusal of video images of Russian tanks and troops that come under fire.\n\nPentagon officials say that a high, and rising, number of war dead can destroy the will to continue fighting. One recent intelligence report focused on low morale among Russian troops and described soldiers just parking their vehicles and walking off into the woods.\n\nRead more",
        "timestamp": "2022-03-17 04:02:46"
    },
    {
        "message": "The rhetorical clash between the United States and Russia escalated on Wednesday when President Biden said that he believed President Vladimir V. Putin of Russia was a “war criminal,” and a top Russian official said the comment was “unacceptable and unforgivable.”\n\nMr. Biden was responding to a reporter’s question as he was leaving an event at the White House. Later, the White House press secretary, Jen Psaki, told reporters that Mr. Biden was “speaking from his heart and speaking from what he’s seen on television.”\n\nOn Wednesday, an International Criminal Court prosecutor, Karim Khan, held a virtual meeting with President Volodymyr Zelensky while in Ukraine. Late last month, Mr. Khan said he was seeking authorization to open an investigation into the war, and that his office had already found “a reasonable basis” to believe war crimes had been committed.\nRead more",
        "timestamp": "2022-03-17 02:09:13"
    },
    {
        "message": "Videos show a destroyed Mariupol theater that Ukrainian officials say sheltered hundreds of civilians.\n\nVideos posted to social media on Wednesday show that the Drama Theater of Mariupol, where civilians were seen sheltering in recent days, had been largely destroyed. Walls on two sides of the building, and large parts of the roof, had collapsed.\n\nAbout 1,000 people had been inside but it was not immediately clear how many had survived, said Pyotr Andryuschenko, an assistant to the mayor.\n\nMr. Andryuschenko said that people were sheltering in all parts of the theater, including the basement and the ground floor. “This is an inhuman crime,” he said.\n\nThe city administration said on Telegram that hundreds of people were hiding at the site, and that it was “impossible to estimate the scale” of the strike. “Information about the victims is being clarified,” it said.\n\nMr. Kyrylenko blamed a Russian airstrike for the destruction. Russia’s Defense Ministry denied carrying out the attack. Read more",
        "timestamp": "2022-03-16 23:02:42"
    },
    {
        "message": "U.S. warns Moscow against using chemical or biological weapons.\n\nPresident Biden’s national security adviser, Jake Sullivan, warned his Russian counterpart on Wednesday against “any possible Russian decision to use chemical or biological weapons in Ukraine,” the White House said in a statement.\n\nThe explicit warning to Nikolai P. Patrushev, President Vladimir V. Putin’s main national security adviser, reflected escalating concerns in Washington that the Russians, stymied in their hopes of a quick takeover of the country, could resort to weapons of mass destruction.\n\nOfficials said there was no direct mention of the use of battlefield nuclear weapons, although two officials said the administration sent a separate warning on that issue through other channels in the opening days of the war, when Mr. Putin announced he was placing Russian nuclear forces on alert.\n\nThe White House would not say who initiated Wednesday’s call, though Russia indicated it came at the request of the United States. Read more",
        "timestamp": "2022-03-16 22:38:27"
    },
    {
        "message": "More than 10 people die in a shelling attack, local official says.\n\nMore than 10 people died in a shelling attack in the northern city of Chernihiv on Wednesday, the regional governor said. The people had been in line for bread, according to a Ukrainian media organization, Suspilne News, and the U.S. Embassy in Kyiv.\n\nA video shared by Suspilne News appeared to show around 10 bodies on a sunny street outside a supermarket. The bodies had been blurred in an effect applied after the video was shot. The location and time of the video have been verified by The New York Times.\n\nThe supermarket sits across from a dentist’s office and pharmacy and is surrounded by apartment complexes.\n\nRead more",
        "timestamp": "2022-03-16 19:18:30"
    },
    {
        "message": "Biden announces $800 million in military aid for Ukraine.\n\nPresident Biden said on Wednesday that the United States would send $800 million in additional military assistance to Ukraine, shortly after the country’s president, Volodymyr Zelensky, delivered an impassioned virtual address to Congress in which he appealed for more help in staving off Russia’s invasion.\n\nMr. Biden said that the Russian invasion was producing “appalling devastation and horror” in that country.\n\n“The American people are answering President Zelensky’s call for more help, for more weapons for Ukraine,” he said.\n\nBut Mr. Biden stopped well short of responding to the more direct military intervention that Mr. Zelensky has repeatedly requested, including for the United States and NATO to enforce a no-fly zone over Ukraine.\n\nRead more",
        "timestamp": "2022-03-16 17:58:51"
    },
    {
        "message": "Ukraine’s power grid, unplugged from Russia’s, now syncs to continental Europe’s.\n\nDoing “a year’s work in two weeks,” technical experts on Wednesday finished synchronizing Ukraine’s and Moldova’s power grids with continental Europe’s, the European Commission said, an important step in ensuring a stable electricity supply.\n\nThe grids were previously connected to the Russian and Belarusian ones. The plan to connect to the continental European grid had long been in place, and was expected to be put into effect sometime next year, but the invasion precipitated the switch.\n\nPresident Volodymyr Zelensky of Ukraine thanked European Union leaders for the move to “a single energy system.” Kadri Simson, the European commissioner for energy, tweeted that it was “a historic milestone for our relationship.”\n\nThe technically complex operation means that the Ukrainian and Moldovan power companies are no longer dependent on Russia or Belarus for the stability of power flow in their countries.\n\nThe continental European grid that the two countries have now connected to includes a number of European Union countries, as well as several others in the broader region, including Albania, Switzerland and Turkey.\n\nRead more",
        "timestamp": "2022-03-16 16:07:33"
    },
    {
        "message": "Zelensky delivers an emotional plea to Congress: ‘I call on you to do more.’\n\nPresident Volodomyr Zelensky of Ukraine made an urgent and emotional appeal to Congress on Wednesday to come to his country’s aid as it fights off a brutal Russian invasion, asking help protecting its air space, military assistance and stronger sanctions as part of what he cast as a war for the cause of democracy itself.\n\nIn a remarkably direct appeal by a wartime leader to policymakers in Washington, Mr. Zelensky addressed lawmakers on a large screen in a movie theater-style auditorium under the Capitol, invoking the memories of Pearl Harbor and the Sept. 11, 2001 terrorist attacks — when the United States came under attack — as he pleaded for support saying, “we need you right now.”\n\nIn remarks translated from Ukrainian, he said starkly: “I call on you to do more.”",
        "timestamp": "2022-03-16 13:56:07"
    },
    {
        "message": "Ukrainian forces launch counterattacks outside Kyiv and Kherson.\n\nThe Ukrainian armed forces have launched counterattacks against Russian troops outside the capital, Kyiv, and in the Russian-occupied city of Kherson, according to a senior Ukrainian military official.\n\nThe goal of the operation, which began on Tuesday night and was continuing on Wednesday, was to inflict mass causalities on the Russian military, rather than to win back territory, the official said, speaking on the condition of anonymity to reveal sensitive military information.\n\nThe operation involved attacks by Ukrainian artillery, fighter jets and tanks, the official said. Details of the offensive could not be fully confirmed independently. Satellite pictures from Tuesday show heavy black smoke above the Kherson airport, where the official said Ukrainian forces had targeted Russian military aircraft parked there.",
        "timestamp": "2022-03-16 13:00:21"
    },
    {
        "message": "Facing military setbacks, Russia begins to talk of compromise.\n\nAs Russia’s military progress in Ukraine has slowed and its army has suffered some apparent setbacks, Russian officials say that their negotiations with Kyiv have shown “progress on a number of positions” and that there is “hope that a certain compromise can be reached.”\n\nRussian and Ukrainian representatives were scheduled to talk via video link on Wednesday for a third straight day, their longest round of discussions since Moscow launched its invasion three weeks ago.\n\nRussia has sent mixed signals about the talks’ progress this week. While President Vladimir V. Putin said on Tuesday that Kyiv was “not showing a serious commitment to finding mutually acceptable solutions,” his officials were more optimistic.",
        "timestamp": "2022-03-16 12:32:43"
    },
    {
        "message": "A 12-story residential building is struck in Kyiv, forcing evacuations.\n\nRescue operations were underway on Wednesday at a 12-story apartment building in Kyiv that was hit by Russian shelling, according to the Ukrainian emergency services.\n\nPeople inside the city, which is under a 35-hour curfew imposed by the mayor on Tuesday amid intensifying Russian barrages, described explosions echoing in the night. Air raid sirens also sounded throughout the night.\n\nShortly after 6 a.m., rescuers received a report of a partly collapsed residential building in the city’s Shevchenkivskyi district, the State Emergency Service of Ukraine said on Facebook, and began evacuating people from the building. Two were injured, and at least 37 people were evacuated.\n\nThe area of the city is home to a cluster of universities, and before the invasion was known for lively student bars and restaurants.",
        "timestamp": "2022-03-16 11:21:16"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\nPresident Volodymyr Zelensky of Ukraine is scheduled to speak via video to the U.S. Congress on Wednesday, in another high-stakes appeal for help a day after a dramatic meeting with three European leaders in Kyiv as fires blazed in the wreckage from Russia’s relentless bombardment.\n\nMr. Zelensky is expected to amplify his pleas for more military aid and to increase the pressure on the United States and its allies, which have so far been reluctant to agree to Ukraine’s request for Polish MIG fighter planes.\n\nPresident Biden is planning to announce $800 million in new security assistance to Ukraine on Wednesday shortly after Mr. Zelensky’s speech, according to White House officials. His administration has already pledged aid in the hundreds of millions, but Mr. Zelensky says Ukraine needs far more.\n\nUkrainian officials plan to present the United States with a list of military equipment they need, including armed drones and mobile air-defense systems, as Mr. Zelensky addresses Congress, according to two European diplomats briefed on the request. Beyond the MIG fighter planes, Ukrainian officials have crafted a list of additional matériel the Biden administration might be more willing to give, one of the diplomats said.\n\nMr. Zelensky has tried to rally international support as Ukraine faces a devastating barrage from Russian forces, largely on its own.\n\n“This is their attempt to annihilate the Ukrainian people,” Mr. Zelensky said in a video address to the Canadian Parliament, repeating his plea for NATO to enforce a no-fly zone over the country. “It is an attempt to destroy our future, our nation, our character.”\n\nHere’s a look at other developments:\n\nThe risky visit by the prime ministers of Poland, the Czech Republic and Slovenia unfolded in tight secrecy as they crossed the Ukrainian border by train after dawn. In a statement after the meeting, Mr. Zelensky said the trio “fear nothing,” adding, “I am sure that with such friends, with such countries, with such neighbors and partners, we will really be able to win.”\n\nPresident Vladimir V. Putin of Russia disparaged the second consecutive day of negotiations with Ukraine, undercutting the faint glimmers of hope raised from talks the day before that both sides were looking for a way to halt the war.\n\nMr. Biden announced his own plans to travel to Europe next week to showcase the unity of the NATO alliance in the face of Russian aggression.",
        "timestamp": "2022-03-16 04:24:26"
    },
    {
        "message": "In the weeks since President Volodymyr Zelensky called for foreign fighters to help protect Ukraine, thousands of volunteers from around the world have come to aid the war effort.\n\nSome came to join Ukrainian forces at the front lines in exchange for a paycheck; others are taking up arms to defend urban neighborhoods.\n\nFor several days, our cameras in Lviv, in western Ukraine, followed a group of foreign volunteers, including two Americans, as they navigated how to arm themselves, with the help of a volunteer coordinator from the International Legion for the Territorial Defense of Ukraine. \n\nRead more and watch the full video here: https://nyti.ms/3u3k2O2",
        "timestamp": "2022-03-16 03:04:00"
    },
    {
        "message": "A Russian state television employee who stormed a live broadcast on Monday was interrogated by the police for 14 hours and fined by a Moscow court on Tuesday.\n\n“I spent two days without sleep,” the woman, Marina Ovsyannikova, said in a video recorded outside of the courtroom on Tuesday by Mediazona, an online news site.\n\n“I wasn’t allowed to contact my relatives or people close to me,” Ms. Ovsyannikova said, adding that she was not allowed “access to any legal representation, so I was in a fairly difficult position.”\n\nMs. Ovsyannikova, who worked for Channel 1 in Moscow, was detained on Monday after she burst onscreen during a popular news show, yelling, “Stop the war!” and holding up a sign that read, “They’re lying to you here.”\n\nImmediately after, a Russian human rights group named OVD-Info circulated a prerecorded video in which Ms. Ovsyannikova said she was “deeply ashamed” to have helped make “Kremlin propaganda.”\n\nThe fine issued Tuesday was for that video, not the on-air protest.",
        "timestamp": "2022-03-16 01:07:40"
    },
    {
        "message": "A Fox News crew in Ukraine was caught in fighting, leaving two journalists dead.\n\nA Fox News cameraman and a Ukrainian journalist traveling with him were killed on Monday in Ukraine when their vehicle came under fire outside Kyiv, according to the network and Ukrainian authorities.\n\nThe cameraman, Pierre Zakrzewski, 55, and the Ukrainian journalist, Oleksandra Kuvshynova, 24, were traveling in the same vehicle as the Fox News correspondent Benjamin Hall, who was also injured in the attack in the town of Horenka. Mr. Hall remained hospitalized in Ukraine; Fox News has not shared additional details about his condition.\n\nMr. Zakrzewski was a veteran reporter at Fox News who reported from many war zones. He had been reporting for the network in Ukraine since February. Ms. Kuvshynova was a local journalist working with the Fox News reporting team.",
        "timestamp": "2022-03-16 00:08:35"
    },
    {
        "message": "European Leaders Brave Russian Bombardment in Audacious Visit to Kyiv\n\nThree European leaders staged a defiant show of support for Ukraine on Tuesday, traveling to its besieged capital, Kyiv, even as a relentless Russian artillery bombardment left apartment towers in the city ablaze, forcing terrified residents to flee into the street with only the clothes on their backs.\n\nThe dramatic visit by the prime ministers of Poland, the Czech Republic and Slovenia, which unfolded in tight secrecy as they crossed the Ukrainian border by train after dawn, was a strikingly personal gesture. But it caught other European leaders off guard, angering some and baring uncomfortable divisions in how best to demonstrate Western solidarity with Ukraine.\n\nIt also came as President Vladimir V. Putin of Russia disparaged the second consecutive day of negotiations with Ukraine, undercutting the faint glimmers of hope raised from talks the day before that both sides were looking for a way to halt the war.\n\nRead more",
        "timestamp": "2022-03-15 23:02:56"
    },
    {
        "message": "New E.U. sanctions target Roman Abramovich, Russian steel exports and Moscow-bound luxury goods.\n\nThe European Union formalized a fourth package of sanctions against Russia over its invasion of Ukraine on Tuesday, adding Roman Abramovich, the famous owner of the British Chelsea Football Club, to a long list of Russian businessmen who have been targeted.\n\nThe E.U.’s documentation supporting the sanctions said that Mr. Abramovich has a close relationship with President Vladimir V. Putin of Russia, including “privileged access” that helped him to “maintain his considerable wealth.” Mr. Abramovich, who was also sanctioned in Britain last week, has denied he has close ties to Mr. Putin.\n\nThe new E.U. measures also expand the scope of Europe’s sanctions against Russian economic sectors, forbidding the importation of Russian steel and banning E.U. investment in Russia’s energy sector.\n\nRead more",
        "timestamp": "2022-03-15 21:44:46"
    },
    {
        "message": "India says it’s in talks with Russia about increasing oil imports.\n\nIndia is in talks with Moscow about increasing oil imports from Russia in an effort to keep spiraling prices in check, India’s petroleum minister told Parliament this week. The move comes as New Delhi is also striving to preserve its relationship with Moscow, its biggest supplier of weapons, at a time when India faces an aggressive China on its borders.\n\n“I myself have had a conversation with the appropriate levels of the Russian federation,” Hardeep Singh Puri, India’s minister of gas and petroleum, told lawmakers on Monday. He said the issues being discussed included insurance, freight, and payment arrangements.\n\nIndia depends on imports for about 80 percent of its oil needs, with 3 percent of that coming from Russia. India’s oil and petroleum imports from Russia amount to nearly $1 billion, Alexander Novak, Russia’s deputy prime minister, said in a statement on Friday.\n\nReuters reported earlier that Indian officials were in talks with Russia to import crude oil at a discounted price and that one of India’s main refineries had bought millions of barrels from the trader Vitol to be delivered in May.\n\nMr. Novak, after a call with Mr. Puri, said that Moscow was “interested in further attracting Indian investment to the Russian oil and gas sector and expanding Russian companies’ sales networks in India.”\n\nAs much of the world has shunned Russia and tightened economic sanctions against it since its invasion of Ukraine, India has played a tricky balancing act, simultaneously working with Ukraine and its Western allies while stopping short of voting against Russia in international forums.\n\nIndia has not supported the penalties. But prospects of the United States’ fury if it deals with Russian entities under sanctions nevertheless hang over the trade between New Delhi and Moscow. The relatively small size of their trade — about $9 billion a year, less than one-tenth of Russia’s trade with its largest trading partner, China — is such that even if India helped Russia evade some of the sanctions, it would not amount to sizable relief to Moscow.\n\nOn oil, Indian officials seem to be navigating an evolving gray area and drawing on past experience of arrangements with Moscow where trade continued in local currencies. While the United States has banned Russian oil imports, the European Union has stopped short — issuing sanctions against specific companies without banning the purchase of Russian oil.",
        "timestamp": "2022-03-15 16:49:00"
    },
    {
        "message": "The U.K. targets more oligarchs and Putin allies with sanctions.\n\nThe British government said on Tuesday that it had imposed sanctions on more than 370 individuals it described as oligarchs, political allies or propagandists for President Vladimir V. Putin of Russia, a major new crackdown that brings it closer in line with the European Union on an issue that has long dogged Britain.\n\nThe sanctions, announced by the foreign secretary, Liz Truss,  include a travel ban and will freeze the assets of prominent Russians in business and government, including some of the wealthiest oligarchs and most senior officials in the Kremlin.\n\nAmong those on the latest list: Dmitri A. Medvedev, the former president of Russia; Prime Minister Mikhail Mishustin; Dmitri S. Peskov, the Kremlin press secretary; Maria Zakharova, a spokeswoman for Russia’s foreign ministry; Sergei Shoigu, the defense minister; and Mikhail Fridman, the billionaire founder of Alfa Bank, one of Russia’s largest private banks.",
        "timestamp": "2022-03-15 15:25:29"
    },
    {
        "message": "Video captures the aftermath of new deadly strikes on civilian areas in Kyiv.\n\nUkraine’s capital, Kyiv, endured a new round of strikes on residential areas on Tuesday morning, according to videos verified by The New York Times. Initial reports indicated that four people had died, Mayor Vitali Klitschko said on Telegram.\n\nLocal officials reported that three apartment buildings had come under fire on the northern edge of the city. Large flames were seen through windows on the middle and upper floors of one 16-story residential complex as firefighters tried to beat back the blaze.\n\nFootage also showed older residents being rescued from the severely damaged building and others recounted being trapped inside after the strike.\n\n“Together, we gathered our belongings and we felt the smoke coming,” a resident named Alexander, who was rescued from the building, told Reuters. “We tried to take the stairs to get out, but they were already filled with smoke. So we took the decision to stay in the apartment.”",
        "timestamp": "2022-03-15 14:46:10"
    },
    {
        "message": "Zelensky, speaking in their language, appeals to Russians to end the war.\n\nPresident  Zelensky on Tuesday stepped up his appeals to Russian soldiers and citizens appalled by the war. He sought to step up pressure on the Kremlin by communicating directly to Russians in Russian.\n\nHe praised the courage of a Russian state television employee who burst onto the live broadcast of Russia’s most-watched news show on Monday to protest the war.\n\n“As long as your country has not completely closed itself off from the whole world, turning into a very large North Korea, you must fight,” Mr. Zelensky said. \n\nHe told Russian soldiers that Ukrainian intelligence could listen in on their communications and that it knew about any misgivings they had about the war.\n\n“You will not take anything from Ukraine. You will take lives,” he said. “But your life will also be taken.” He promised all soldiers who surrender that they would be treated with dignity.\n\n“Choose,” he said.",
        "timestamp": "2022-03-15 12:18:34"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\nThree European leaders headed to Kyiv on Tuesday to express the European Union’s “unequivocal support” and offer financial help to Ukraine, a dramatic visit that comes as intense fighting rages around the Ukrainian capital.\n\nTraveling by train, the leaders of the Czech Republic, Poland and Slovenia crossed into Ukraine on Tuesday morning, hours after a series of loud pre-dawn blasts shook Kyiv. \n\nEven as Russia’s advance remains stalled on several fronts, with Ukrainian forces repelling attacks in parts of the east and the south, Russian troops continued to bombard areas around Kyiv, striking residential buildings and other civilian targets. Russia’s Defense Ministry also claimed to have captured the entire Kherson region, possibly strengthening the Kremlin’s ability to push west toward the port city Mykolaiv.\n\nOffering a glimmer of hope amid a worsening humanitarian catastrophe, talks between Russian and Ukrainian negotiators were set to resume on Tuesday.",
        "timestamp": "2022-03-15 12:05:39"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\n— Ukrainian and Russian officials agreed to meet again on Tuesday for another round of direct negotiations, despite the lack of a breakthrough in previous meetings and a deepening humanitarian crisis.\n\n— The talks unfolded against a backdrop of thunderous Russian artillery strikes. The secretary-general of the United Nations, António Guterres, declared that Ukraine was “being decimated before the eyes of the world.”\n\n— In separate talks, President Biden’s national security adviser warned a top Chinese official on Monday against aiding Russia in the war.\n\n— In Russia, a woman walked in on a live broadcast of a Russian state-run news show on Monday evening, holding up a sign that said “They’re lying to you here.”\n\n— Hundreds escaped Mariupol by car, according to the local government. A convoy carrying tons of food, water and medicine failed to break a blockade of the city that has been in place since the start of the war.\n\nRead more",
        "timestamp": "2022-03-15 05:31:28"
    },
    {
        "message": "A protester storms a live broadcast on Russia’s most-watched news show, yelling ‘Stop the war!’\n\nA state television employee burst onto the live broadcast of Russia’s most-watched news show on Monday evening, yelling “Stop the war!” and holding up a sign that said “They’re lying to you here,” in an extraordinary act of protest against Russia’s invasion of Ukraine.\n\nThe woman, Marina Ovsyannikova, worked for Channel 1, the state-run television channel whose news broadcast she stormed, according to a Russian rights group that is giving her legal support. The group also released a video in which Ms. Ovsyannikova says she is “deeply ashamed” to have worked to produce “Kremlin propaganda.”\n\nThe news show, “Vremya,” is among the Kremlin’s flagship propaganda outlets, watched by millions of Russians every evening.\n\nRead more",
        "timestamp": "2022-03-14 23:49:01"
    },
    {
        "message": "Videos show civilian casualties in missile strike on the separatist capital of Donetsk.\n\nA ballistic missile strike on Donetsk, the capital of the breakaway, Russia-backed Donetsk People’s Republic, killed an estimated 20 people and wounded 35 on Monday, according to the regional health minister.\n\nIt was not immediately clear where the missile was fired from, but Russia blamed it on Ukraine.\n\nVideos and photos verified by The New York Times showed dozens of civilians lying dead and wounded on University Street in central Donetsk, and multiple impact points and explosions along the street. Remnants of a large missile were found about 1,400 feet northeast of the street in a square outside the regional government’s headquarters.",
        "timestamp": "2022-03-14 17:47:49"
    },
    {
        "message": "British government announces plan to allow residents to sponsor refugees.\n\nAs the humanitarian toll in Ukraine intensifies, the British government announced on Monday a program for British residents to sponsor Ukrainian refugees, amid widespread criticism of the country’s limited pathways for those fleeing the war.\n\nIntroduced three weeks after the invasion began, the program, called “Homes for Ukraine,” offers a new route for Ukrainian refugees to come to Britain, which had previously been limited to those joining family members already living there.\n\nThe war in Ukraine has resulted in what the United Nations has described as the fastest-growing refugee crisis since World War II. So far, 2.8 million refugees have fled the country, with a majority heading to bordering countries such as Poland, Hungary and Slovakia.",
        "timestamp": "2022-03-14 17:43:31"
    },
    {
        "message": "Hundreds escape besieged Mariupol. Tens of thousands remain trapped.\n\nHundreds of people escaped the besieged Ukrainian city of Mariupol by car on Monday, according to the local government, even as a convoy of vehicles carrying food, water and medicine slowly tried to find a safe path through the battle raging around the city.\n\nRelatives of those still living in Mariupol said fleeing seems to offer the best, and perhaps only, chance for survival.\n\nAn estimated 400,000 people are trapped in the city, which is entering its second week without heat, food or clean water. Attempts to reach the city and evacuate people have failed day after day amid heavy fighting. The convoy on its way Monday was carrying 100 tons of relief supplies, officials said.",
        "timestamp": "2022-03-14 16:05:18"
    },
    {
        "message": "A survivor of a Kyiv attack recalls people ‘running and screaming.’\n\nA missile slammed into an apartment block on the north side of Kyiv just after dawn on Monday. Many residents were fast asleep.\n\nThey had become accustomed to the sounds of shelling after more than two weeks of Russian bombardment, but they never thought their building would be hit.\n\n“We do not have a military target near us,” said Yuriy Yurchik, 30. “We did not think we ourselves would be a target.”\n\nMissile strikes have intensified in recent days as Russia’s military offensive presses closer to the heart of the government.\n\n“I looked out and saw the left part of the building was burning,” Mr. Yurchik said. “On the ground people were running and screaming.”\n\nTwo people were killed and nine wounded in the strike, which occurred in Obolon district in the northern part of Kyiv. The Ukrainian authorities evacuated 70 people from the building to a nearby kindergarten.",
        "timestamp": "2022-03-14 15:02:26"
    },
    {
        "message": "The brother of a slain Ukrainian soldier died in the military base attack.\n\nKyrylo Vyshyvanyi, a Ukrainian military instructor, was killed in the attack on a base near the Polish border in western Ukraine early on Sunday.\n\nThe father of two was 35 years old. His sister, Natalia Bodnar, confirmed his death.\n\nHe was recently interviewed by The New York Times in a video about his brother, Vasyl Vyshyvanyi, a Ukrainian paratrooper who was killed during fighting near Mykolaiv in southern Ukraine on March 3.\n\nWhile driving to Vasyl’s memorial service in Lviv, Kyrolo reflected solemnly that “God takes away the best ones.”\n\nA few days later, those words would resonate with the Vyshyvanyi family.",
        "timestamp": "2022-03-14 11:33:25"
    },
    {
        "message": "Live Updates: Russia and Ukraine Hold Talks After Bloody Weekend\n\n— Russian and Ukrainian negotiators resumed talks on Monday, holding a virtual meeting as Ukrainian officials hinted at progress in negotiations. A priority of the meeting was efforts to provide assistance and facilitate the evacuation of hundreds of thousands of civilians from Mariupol and other cities facing Russian bombardment.\n— China dismissed U.S. allegations that Russia had asked it for military equipment and economic support. \n— Kyiv was hit by heavy artillery strikes on Monday morning, after days of heavy fighting in the suburbs. One projectile struck an apartment building, blowing out windows and causing a fire. At least two people died, according to local authorities.\n— Fighting damaged a 16th-century monastery and cave complex that is a highly revered Orthodox Christian site for believers in both Russia and Ukraine.",
        "timestamp": "2022-03-14 10:39:22"
    },
    {
        "message": "Tens of thousands of Russians are fleeing their country, losing hope as war unfolds.\n\nRussians are leaving their country for Istanbul in the tens of thousands and are looking to start new lives in that major city in Turkey. Those finding their way there are only the tip of the iceberg of a migration spurred by the invasion of Ukraine under orders from President Vladimir V. Putin of Russia.\n\nThey have left jobs and family behind, in many cases have savings in Russian bank accounts that they can no longer access, and some have even given up on the prospects of comfortable middle-class lives or careers in their native country.\n\nMany fear that an increasingly isolated Russia, where journalists and activists can face arrest if they are deemed to be spreading “false information” about the war, will be inhospitable to them. Some were workers in tech, law and other industries. Others are musicians and artists who see no future for their crafts.\n\nRead more",
        "timestamp": "2022-03-14 05:39:03"
    },
    {
        "message": "Russia and Ukraine Set to Meet After Brutal Weekend of Fighting\n\nUkrainian and Russian officials expressed optimism that they would make progress in peace talks Monday, even in the wake of a Russian airstrike a few miles from NATO’s doorstep that killed at least 35 people and deepened fears that the war in Ukraine could spread.\n\nMykhailo Podolyak, a Ukrainian presidential adviser and a member of Kyiv’s delegation, said Russia “is much more sensitive to Ukraine’s position” in a Telegram video Sunday. The Kremlin said it would not rule out the possibility of a meeting between President Vladimir V. Putin and his Ukrainian counterpart, Volodymyr Zelensky.\n\nRead more",
        "timestamp": "2022-03-14 04:41:52"
    },
    {
        "message": "Russia Asked China for Military and Economic Aid for Ukraine War, U.S. Officials Say\n\nRussia asked China to give it military equipment and support for the war in Ukraine after President Vladimir V. Putin began a full-scale invasion last month, according to U.S. officials.\n\nRussia has also asked China for additional economic assistance, to help counteract the battering its economy has taken from broad sanctions imposed by the U.S. and European and Asian nations, according to an official.\n\nJake Sullivan, the White House national security adviser, is scheduled to meet on Monday in Rome with Yang Jiechi, a member of the Chinese Communist Party’s elite Politburo. \n\n“We are communicating directly, privately to Beijing that there will absolutely be consequences for large-scale sanctions evasion efforts or support to Russia to backfill them,” Sullivan said on CNN on Sunday.\n\nRead more",
        "timestamp": "2022-03-13 23:44:29"
    },
    {
        "message": "Fearing beatings and arrests, Russians protest their country’s war.\n\nWith the Russian government showing little tolerance for public demonstrations of opposition to its war in Ukraine, the turnout was light at dozens of protests across Russia on Sunday — and many of those who did openly dissent were quickly rounded up by the police.\n\nProtesters chanted “No to war!” and “Ukraine is not our enemy” and some held posters saying “Ukraine, you are right” or just blank sheets of paper. But that was enough for the police, wearing heavy-duty anti-riot gear and with their faces covered by balaclavas, to prevent people from gathering even in groups as small as three.\n\nOverall, more than 860 Russians were detained at the protests on Sunday, bringing the total number of arrests at antiwar demonstrations to more than 14,500, according to OVD Info, a human rights group that tracks arrests in Russia.\n\nRead more",
        "timestamp": "2022-03-13 21:20:00"
    },
    {
        "message": "Brent Renaud, an American journalist, is killed in Ukraine.\n\nAn award-winning filmmaker and journalist, Mr. Renaud, 50, was killed while reporting in a suburb of Kyiv. Another journalist was wounded.",
        "timestamp": "2022-03-13 17:12:07"
    },
    {
        "message": "Ukraine Live Updates: Russian Airstrikes Kill at Least 35 at Base Near Polish Border\n\nRussia took direct aim on Sunday at a hub for Western arms shipments and fighters in Ukraine, launching a barrage of airstrikes at a military base near Poland that killed at least 35 people.\n\nA day after warning that weapons flowing into Ukraine from Western allies were “legitimate targets,” Russia assaulted the base 12 miles from the border with Poland, where American troops are deployed to bolster NATO’s defenses. Ukrainian officials said that Russian planes fired about 30 missiles, 22 of which were intercepted by Ukraine’s air defenses.\n\nThe base, known as the International Peacekeeping and Security Center, was a training ground for up to 1,000 foreign fighters that Ukraine plans to use to help fight Russia, a Ukrainian military official said.\n\nUkrainian officials called Russia’s strike, which also wounded at least 134 people, a “terrorist attack,” and they renewed calls for NATO to establish a no-fly zone.\n\nRead more",
        "timestamp": "2022-03-13 16:55:41"
    },
    {
        "message": "Here are the latest developments in Ukraine.\n\n— Russian rockets rained down across Ukraine before dawn on Sunday, including strikes on the outskirts of Lviv that appeared to target a military base where foreign fighters including Americans were being trained.\n\n— Russia warned on Saturday that arms sent to Ukraine would be considered “legitimate targets” for Russian forces. Hours later, the U.S. promised an additional $200 million in arms and equipment for Ukraine.\n\n— Outside Kyiv, Russia renewed its attack with fierce fighting in the suburbs as it tried to tighten a cordon around the capital.\n\n— Hundreds of people protested in Melitopol over the detention of the city’s mayor, who had refused to cooperate with occupying Russian forces.\n\n— The disarmament chief of the United Nations said the agency had no evidence of any biological weapons program in Ukraine. Russia had accused the U.S. of a plot involving biological weapons labs in Ukraine and migratory birds, bats and insects.",
        "timestamp": "2022-03-13 06:25:57"
    },
    {
        "message": "19 surrogate babies are trapped in a Kyiv basement, kept alive by nannies.\n\nDown a dusty stairwell, hidden from the shelling that has become the grim background noise of Kyiv, Ukraine’s capital, Ludmila Yashenko fusses with the babies. There are 19 of them, sleeping or cooing in neatly arranged cribs, fed regularly from tubs of baby formula.\n\nMs. Yashenko and other nannies bounce the babies on their laps and straighten their bibs, even as they watch television, wide-eyed, to learn the latest news from the war.\n\nThe babies were born to surrogate mothers, with their biological parents still outside the country. Because of the war, the citizenship of the newborns is unclear, as is the question of who their legal guardians are, since under Ukrainian law their biological parents must be present to confirm their nationality.\n\nThere is also the question of how, or if, they can possibly be taken to safety.\n\nRead more",
        "timestamp": "2022-03-13 05:55:03"
    },
    {
        "message": "In western Ukraine, a village buries one of its own.\n\nWhen Mariana Lopushanska texted with her boyfriend on the evening of March 2, they made plans for their future together.\n \n“I’m not kidding,” Senior Lt. Vasyl Vyshyvanyi wrote to her. “When I’m back, I’ll have a baby with you.”\n \n“I want you to come back as fast as possible,” Ms. Lopushanska responded. “We’ll have everything, a girl and a boy. The main thing is for you to be well.”\n \nHours later, Lt. Vyshyvanyi was killed in combat.\n \nRead more",
        "timestamp": "2022-03-12 22:50:23"
    },
    {
        "message": "Street battles hit a Kyiv suburb, some of the closest fighting to the capital yet.\n\nIn Irpin, just outside the capital city of Kyiv, Ukrainian and Russian soldiers were fighting a street-by-street battle on Saturday, turning what was a leafy suburb just two weeks ago into a suburban battleground.\n \nRussian troops have gotten this close to the capital only once or twice before. And although the loss of the town would not necessarily mean an immediate advance on Kyiv, a Russian victory here would help tighten the cordon around the city, according to military analysts.\n \nRead more",
        "timestamp": "2022-03-12 22:26:44"
    },
    {
        "message": "U.S. Officials Say Superyacht Could be Putin’s\n\nAmerican officials are examining the ownership of a $700 million superyacht currently in a dry dock at an Italian seacoast town, and believe it could be associated with President Vladimir V. Putin of Russia, according to multiple people briefed on the information.\n\nUnited States intelligence agencies have made no final conclusions about the ownership of the superyacht — called the Scheherazade — but American officials said they had found initial indications that it was linked to Mr. Putin. The information from the U.S. officials came after The New York Times reported on Tuesday that Italian authorities were looking into the 459-foot long vessel’s ownership and that a former crew member said it was for the use of Mr. Putin.",
        "timestamp": "2022-03-12 17:10:44"
    },
    {
        "message": "After a night of shelling, Ukrainians assess the damage and try to make their way to safer ground.\n\nSome of the last remaining civilians in Irpin and Bucha, towns on Kyiv’s northwestern rim, fled toward the capital on Saturday morning after a night of heavy shelling, while in Mykolaiv, in Ukraine’s south, residents assessed the damage at an apartment building hit by shelling in the night.",
        "timestamp": "2022-03-12 16:51:41"
    },
    {
        "message": "The low rumble of heavy artillery fire echoed across Kyiv on Friday as Russian forces renewed their ground offensive and widened their bombardment of Ukraine.\n\nIn other major developments:\n\n— President Biden said the United States would join the European Union and other allies in stripping Russia of normal trade relations to punish and isolate President Vladimir V. Putin of Russia for his invasion of Ukraine. Biden also said he would ban imports of some Russian goods, including seafood, vodka and nonindustrial diamonds. “Putin must pay the price,” he said.\n\n— The United Nations said on Friday that at least 564 civilians had been killed and another 982 people had been injured by Russian forces so far in the war in Ukraine, but acknowledged that the full casualty toll was most likely much higher. In Mariupol, Ukrainian officials said, the death toll has reached 1,552 since the beginning of Russia’s siege and bombing of the city.\n\n— Russia on Friday began the process of declaring Meta, the parent company of Facebook and Instagram, an “extremist organization” and started blocking access to Instagram. \n\nRead more",
        "timestamp": "2022-03-11 23:25:49"
    },
    {
        "message": "Welcome to the Telegram channel from The New York Times. This channel is devoted to our coverage from around the world, including the Russia-Ukraine war. See the latest at https://www.nytimes.com/world.",
        "timestamp": "2022-03-11 23:24:59"
    }
]