[
    {
        "message": "",
        "timestamp": "2021-03-17 16:14:50"
    },
    {
        "message": "",
        "timestamp": "2021-03-17 16:14:50"
    },
    {
        "message": "Is Cyberpunk 2077 Communist?\nhttps://youtu.be/qfVysnH1Cwc\n#Video",
        "timestamp": "2021-03-16 17:28:30"
    },
    {
        "message": "Tates Workers Threatened With Deportation Ahead of Union Vote",
        "timestamp": "2021-03-15 00:07:33"
    },
    {
        "message": "\"Since the real purpose of socialism is precisely to overcome and advance beyond the predatory phase of human development, economic science in its present state can throw little light on the socialist society of the future.\"\n\nOn March 14 1879 ,  Albert Einstein was born. He was theoretical physicist,  widely acknowledged to be one of the greatest physicists of all time. He was also a defender of socialist ideology even in the days of the fiercest anti-communist propaganda.\n#Date\n#Quote",
        "timestamp": "2021-03-14 20:38:01"
    },
    {
        "message": "#News #USA\n1 in 7 American Children in Poverty",
        "timestamp": "2021-03-14 10:13:26"
    },
    {
        "message": "On March 13, 1930, the Moscow Labor Exchange closed. \n\nThe last job assignment was given to the locksmith Mikhail Shkunov. The Soviet Union became the first country in the world that  ended unemployment.\n#Date #History #USSR",
        "timestamp": "2021-03-13 19:26:53"
    },
    {
        "message": "#USA #News\nOne in Five Renters Behind on Rent",
        "timestamp": "2021-03-13 11:22:24"
    },
    {
        "message": "On March 12, 1940 the Winter War ended.\n\n The USSR and Finland signed a peace treaty, according to which the Soviet Union received Vyborg and Western Karelia.\n\nPhoto: Soviet officer examines Finnish handcuffs he found in Vyborg Castle.\n#History #Date",
        "timestamp": "2021-03-12 20:12:01"
    },
    {
        "message": "#Quote #Lenin\nLenin on Liberty under Socialism",
        "timestamp": "2021-03-12 13:06:16"
    },
    {
        "message": "A list of Stalin's property made after several hours after his death:\n\"1. Notepad, grey leather cover;\n2. Notebook, red leather cover; \n3. Personal notes made on separate sheets and tear-off sheets. Sixty-seven sheets numbered; \n4. Notebook with general notes, red cover; \n5. 5 smoking pipes with 4 boxes and special devices for them, tobacco. In the study of Comrade Stalin: books, desk accessories and souvenirs in the comrade Stalin's cabinet are not included. \n \nBedroom and closet: \n6. 2 white colored tunics (Both have medals \"Sickle and Hammer\" of the Hero of Socialist Labour attached); \n7. 2 grey tunics; \n8. 2 dark-green colored kitels; \n9. 10 pants; \n...\nA savings book was found in the bedroom with 900 rubles written in it.\"\n\n#History #USSR",
        "timestamp": "2021-03-10 11:03:01"
    },
    {
        "message": "#USA #News\nFiat Chrysler Guilty of Bribing UAW Officials",
        "timestamp": "2021-03-10 08:47:08"
    },
    {
        "message": "Today is the 87th birthday of the Soviet cosmonaut Yuri Gagarin, the first human in space.\n\nPhoto: Gagarin in 1950s.",
        "timestamp": "2021-03-09 19:38:05"
    },
    {
        "message": "International Women’s Day",
        "timestamp": "2021-03-08 08:56:49"
    },
    {
        "message": "#Lenin #Quote\nLenin on Competition",
        "timestamp": "2021-03-07 10:29:39"
    },
    {
        "message": "#Lenin #Quote\n\nLenin on Political Revolution",
        "timestamp": "2021-03-06 08:57:03"
    },
    {
        "message": "\"Summing up Stalin's life and activity as a fighter against tsarism, against capitalism and its agents, for Marxism-Leninism, for socialism and communism, for the victory of the October Revolution, the Soviet state, for the construction of socialism in the USSR, for the defeat of the fascist invaders in the Patriotic War, we must first of all not repeat imperialist slanderous fabrications.\n\n But in the revolutionary, scientific, Party-like, Leninist way of evaluating the positive and negative, not to allow petty-bourgeois sensationalism, overblowing and substituting mistakes and shortcomings of everything historically great that Stalin has done for the Party, the people and the country.\" \n\nFebruary, 1990.",
        "timestamp": "2021-03-05 21:01:15"
    },
    {
        "message": "On March 5, 1953, Joseph Vissarionovich Stalin, revolutionary Bolshevik, one of the greatest theorists of Marxism, a disciple of Lenin, the leader of the Soviet state, the leader of the CPSU, passed away.\n\nOn the occasion of this date, we want to recall the words of an excellent Soviet statesman, an economic and party figure, who defended the honorable name of Stalin up to his death – Lazar Kaganovich.",
        "timestamp": "2021-03-05 21:01:15"
    },
    {
        "message": "#History #Photo\nA speaker at a Communist Party of Australia street meeting in Sydney in the early 1940s",
        "timestamp": "2021-03-05 14:29:01"
    },
    {
        "message": "#Stalin #Quote\nStalin on the Withering Away of the State",
        "timestamp": "2021-03-05 09:25:25"
    },
    {
        "message": "#Lenin #Quote\nLenin on Freedom under Capitalism",
        "timestamp": "2021-03-04 10:31:09"
    },
    {
        "message": "\"The Communist\"  cover by Jacob Burck, October 1930.\n\n\nJacob Burck was a cartoonist in the Communist Party USA's orbit from 1926 to 1936.\n#Poster",
        "timestamp": "2021-03-03 21:57:01"
    },
    {
        "message": "Soviet ambassador to the UK Ivan Maisky (1884-1975) cuts the bars of the fence of the Soviet Embassy to donate the metal to the British industry. London, 1943.\n#History #Photo #WW2",
        "timestamp": "2021-03-03 09:53:06"
    },
    {
        "message": "#Quote #Lenin\nLenin on Workers",
        "timestamp": "2021-03-03 01:27:16"
    },
    {
        "message": "#news #USA\nU.S. Has Worst Worker Benefits in Developed World",
        "timestamp": "2021-03-02 08:37:22"
    },
    {
        "message": "https://youtu.be/yujWHmHV4oQ",
        "timestamp": "2021-02-28 20:16:01"
    },
    {
        "message": "#History #USSR \nThe first computer-made cartoon was created in USSR. And it was about cats.\n\nIn 1968 a group of soviet physicians and mathematicians created a mathematical model for the motion of a cat (\"Koshyechka\" on russian). They wrote a program for the soviet BESM-4 computer. \n\nBESM-4 printed hundreds of frames on paper using alphabet symbols that were latter filmed in sequence thus creating the first computer animation of a character: a walking cat.",
        "timestamp": "2021-02-28 20:16:01"
    },
    {
        "message": "#Stalin #Quotes #USSR\n\nStalin on Unemployment",
        "timestamp": "2021-02-28 18:47:26"
    },
    {
        "message": "#History #USSR \nSoviet PC controlling gadgets concept by Pavel Kovalev, 1989.",
        "timestamp": "2021-02-27 15:39:01"
    },
    {
        "message": "#History #USSR #Date #Quotes\n\"Marxism gave me the greatest happiness a person could wish for: the knowledge of where to go, the calm certainty of the ultimate outcome of the cause which I have associated my life with.\"\n\nOn February 26, 1869, Lenin's wife, Nadezhda Krupskaya was born. She was a revolutionary, made a great contribution defeating illiteracy in Russia and building the system of modern education in the Soviet Union.\n\nPhoto: young Krupskaya, 1880s.",
        "timestamp": "2021-02-26 22:30:20"
    },
    {
        "message": "#Date #History #Quotes \nOn the same day, in 1903, Julius Fučík, a Czechoslovak journalist and writer, and a member of the Communist Party of Czechoslovakia, was born. \n\nFučík was a literary and theatrical critic, a publicist, and an underground anti-fascist during World War II. His most famous book, \"Notes from the Gallows\", was written in a Nazi prison. It was written on pieces of cigarette paper and smuggled out by sympathetic prison warders.",
        "timestamp": "2021-02-23 23:29:01"
    },
    {
        "message": "In 1918, during the Russian Civil War, “Socialist Homeland is in Danger!” decree was published, calling for the first mass draft into the Red Army. This day became known as “Red Army Day”.\n\nAs in the case of May 9, Russian capitalists obscured the true essence of Red Army Day, replacing it with patriotic calls to “defend the fatherland”, i.e. to maintain the existing order, which oligarchs profit from. But what kind of extra-class “fatherland” can we talk about under the rule of capitalism with its monstrous social inequality and exploitation?\n\nRejecting the lies of the capitalists, one thing is clear – for the majority of the people it will be possible to speak about real “defense of the Fatherland” only after the establishment of the rule of the working class and the emergence of a new socialist state.\n#History #USSR",
        "timestamp": "2021-02-23 17:56:58"
    },
    {
        "message": "",
        "timestamp": "2021-02-22 19:10:13"
    },
    {
        "message": "\"Visit Soviet Russia\", \"Every Worker Should Participate!\".\nSome ads in CPUSA newspaper \"Daily Worker\". Would you travel to the USSR if you could?\nThe first was published on April 21, 1928, the second – June 29, 1928.\n#History #USA",
        "timestamp": "2021-02-22 19:10:13"
    },
    {
        "message": "",
        "timestamp": "2021-02-21 20:00:22"
    },
    {
        "message": "173 years ago, on February 21, 1848, Karl Marx and Friedrich Engels published the \"Manifesto of the Communist Party\"\n\n\"This little booklet is worth whole volumes: to this day its spirit inspires and guides the entire organised and fighting proletariat of the civilised world\". (Vladimir Lenin - \"Friedrich Engels\")\n\nWe highly recommend you to read this book.",
        "timestamp": "2021-02-21 20:00:22"
    },
    {
        "message": "#Theory #Trotskyism\nExplaining Trotskyism, its historical development and its main features that do damage to the communist movement in our article (translation from Greek).\n\"...The need for this analysis is due to the following factors:\n\nFirstly, the capitalist system actively uses Trotsky’s image, making ahistorical attacks on Lenin and Stalin, and questioning the construction of socialism in the USSR. On the 89th anniversary of the October Revolution, the struggle over Trotsky’s statements on the alleged impossibility of the victory of socialism in Russia is gaining momentum.\n\nSecondly, a number of organizations both in our country and abroad, calling themselves Trotskyists or using Trotskyist theory, are increasing their efforts amongst the youth, especially in schools and universities, as well as among the working class. These groups are too small to be a threat in the communist movement, but under the guise of “revolutionarism” they reproduce bourgeois and opportunist views...\"",
        "timestamp": "2021-02-21 17:41:07"
    },
    {
        "message": "#news #USA\n\nWorking Age Americans Dying at Higher Rates",
        "timestamp": "2021-02-20 01:53:06"
    },
    {
        "message": "#Photo #Lithuania\n\nVilnius, Lenin Square, early 50s.",
        "timestamp": "2021-02-19 20:42:13"
    },
    {
        "message": "#USA #news\n\nAmazon Pushes Workers to Graveyard Megacycle Shifts",
        "timestamp": "2021-02-19 10:18:21"
    },
    {
        "message": "\"Who dares to intervene in Greek internal affairs?!\" \nSoviet caricature by Boris Efimov, 1949.\nAfter the liberation of the country from German troops a civil war broke out, where the UK (and then the US) supported the Greek monarcho-fascists against the pro-communist Democratic Army. American capitalists helped the monarcho-fascists, sending $300 million aid, military equipment and advisors. \n#History #Poster",
        "timestamp": "2021-02-18 15:26:15"
    },
    {
        "message": "#History\n\"What are the Soviets?\" In despite of the conviction of many comrades, they are not necessarily “Councils of Workshop Delegates” to give as nearly exact a title as possible. What they are, and what distinguishes them from every other body of men in history —including even “Councils of Workshop Delegates” in non-revolutionary periods — is: the central fighting organiяations of the struggling proletariat during the period of revolution; first assuming the most elementary, then winning one by one the remaining functions of the State organisation of the capitalist class; and finally emerging from the struggle as the State organisation of the victorious proletariat during the Period of Communist reconstruction.\"\n– What Are Soviets? by W. E. Harding.  The Communist Review, May 1921, Vol. 1, No. 1.\n\nPhoto: Communists armed with batons, fight police during a demonstration against unemployment. 1930. Tower Hill, London.",
        "timestamp": "2021-02-17 17:30:05"
    },
    {
        "message": "#news #USA\n\nFunding Cuts Reduce Public Health Jobs By 20%",
        "timestamp": "2021-02-17 12:44:44"
    },
    {
        "message": "#Photo #History\nThe first Congress of the Communist Party of the United States in 1919",
        "timestamp": "2021-02-16 06:19:51"
    },
    {
        "message": "#news #USA\n\nLowest Paid Wage Worker Employment Drops 14%",
        "timestamp": "2021-02-16 01:01:55"
    },
    {
        "message": "#History  #Statistics\n\"USSR – the country with the lowest mortality rate\". Tables show mortality and growth rates of the USSR compared to other countries, while the graph shows decline in the mortality rate in the USSR from 1913 to 1956.",
        "timestamp": "2021-02-15 10:42:04"
    },
    {
        "message": "#quote #USSR #Lenin\n\nLenin on Peaceful Assumption of Power\n\nThe working class would, of course, prefer to take power peacefully (we have already stated that this seizure of power can be carried out only by the organized working class which has passed through the school of the class struggle), but to renounce the revolutionary seizure of power would be madness on the part of the proletariat, both from the theoretical and the practical-political points of view; it would mean nothing but a disgraceful retreat in face of the bourgeoisie and all other propertied classes.\n\nVladimir Lenin, A Retrograde Trend in Russian Social-Democracy",
        "timestamp": "2021-02-15 10:35:48"
    },
    {
        "message": "#Agitation  #History #USSR \n\"Spiritual pack – kulak's pillar. Kolkhozes will destroy kulaks completely.\"\n\nArtists- \"Kukryniksy\"\n\nThe date of painting refers to the 1920s",
        "timestamp": "2021-02-14 07:37:12"
    },
    {
        "message": "#quotes  \n\"Under Socialism, you would not be allowed to be poor. You would be forcibly fed, clothed, lodged, taught, and employed whether you liked it or not. If it were discovered that you had not character and industry enough to be worth all this trouble, you might possibly be executed in a kindly manner; but whilst you were permitted to live, you would have to live well.\"\n\nGeorge Bernard Shaw",
        "timestamp": "2021-02-13 10:54:12"
    },
    {
        "message": "#quote #USSR #Lenin\n\nThe proletariat should not ignore peaceful methods of struggle—they serve its ordinary, day-to-day interests, they are necessary in periods of preparation for revolution—but it must never forget that in certain conditions the class struggle assumes the form of armed conflict and civil war; there are times when the interests of the proletariat call for ruthless extermination of its enemies in open armed clashes. \n\nVladimir Lenin, Lessons of the Commune",
        "timestamp": "2021-02-13 10:36:24"
    },
    {
        "message": "#GDR  #Photo #Germany\nMay day demonstration in the town of Heiligenstadt, GDR 1983.",
        "timestamp": "2021-02-12 07:11:09"
    },
    {
        "message": "#quote #Engels\n\nThe law is sacred to the bourgeois, for it is his own composition, enacted with his consent, and for his benefit and protection. He knows that, even if an individual law should injure him, the whole fabric protects his interests; and more than all, the sanctity of the law, the sacredness of order as established by the active will of one part of society, and the passive acceptance of the other, is the strongest support of his social position.\n\nFriedrich Engels, Condition of the Working Class in England",
        "timestamp": "2021-02-12 00:44:34"
    },
    {
        "message": "#Photo #Africa \nMembers of the Communist Party meeting in Cape Town, circa 1930's.",
        "timestamp": "2021-02-11 21:24:06"
    },
    {
        "message": "#History #Agitation #Spain \nA Republican poster of the Civil war in Spain.\n(1936-1939)",
        "timestamp": "2021-02-11 16:51:13"
    },
    {
        "message": "#quote #USSR #Lenin\n\nLenin on Workers’ Organization\n\nIn its struggle for power the proletariat has no other weapon but organization. Disunited by the rule of anarchic competition in the bourgeois world, ground down by forced labor for capital, constantly thrust back to the “lower depths” of utter destitution, savagery, and degeneration, the proletariat can, and inevitably will, become an invincible force only through its ideological unification on the principles of Marxism being reinforced by the material unity of organization, which welds millions of toilers into an army of the working class.\n\nVladimir Lenin, One Step Forward, Two Steps Back",
        "timestamp": "2021-02-11 09:12:58"
    },
    {
        "message": "#Photo #History #Great_Depression \n\n “Why can’t you give my dad a job” \nThis photo has taken around 1937.",
        "timestamp": "2021-02-10 21:17:55"
    },
    {
        "message": "#Agitation #Africa\n\n\"Africa is fighting \nAfrica will win\"\n\nArtist:Viktor Koretsky\nDate of creation: mid-20th century",
        "timestamp": "2021-02-10 16:53:32"
    },
    {
        "message": "#news #USA\n\nGoogle & Adecco Silence Contract Workers Over Wages",
        "timestamp": "2021-02-10 13:36:13"
    },
    {
        "message": "#quotes  #Stalin\n\"Mankind is divided into rich and poor, into property owners and exploited; and to abstract oneself from this fundamental division, and from the antagonism between poor and rich, means abstracting oneself from fundamental facts.\"\nJoseph Stalin \n(Interview  with H.G  Wells September 1937)",
        "timestamp": "2021-02-09 21:04:08"
    },
    {
        "message": "#Date #History #Russian_Civil_war\n#Movies\nOn February 9, 1887, the hero of the Civil War Vasily Ivanovich Chapaev was born-the head of the Red Army, a participant in the First World War and the Civil War.\n\n We recommend you to watch the film of 1934 year for those who want to know the biography of this wonderful person and for those who appreciate good classic Soviet films. (Included English subtitles)\nhttps://youtu.be/T6KDKMgALps",
        "timestamp": "2021-02-09 16:34:01"
    },
    {
        "message": "#news #USA\n\nOlder Workers Account for All Job Growth Over 20 Years",
        "timestamp": "2021-02-09 10:02:55"
    },
    {
        "message": "#Date #History #DDR #German\nOn February 8, 1950, the Ministry of State Security of the GDR (Stasi) was founded.\n\nIt was the official state security service of the German Democratic Republic (GDR). It has been described as one of the most effective intelligence and secret police agencies ever to exist",
        "timestamp": "2021-02-08 21:40:07"
    },
    {
        "message": "Explaining the real problems of the American healthcare and how to solve them in the new video:\nhttps://youtu.be/jOMu7Uy__SQ",
        "timestamp": "2021-02-08 18:02:57"
    },
    {
        "message": "#Photo #USA\nOne of the organizers of the Communist Party of the United States (1919), participant in the Great October Socialist Revolution, author of the book Ten Days That Shook the World American writer and journalist John Reed (1887 - 1920) at a meeting in Nakhichevan.",
        "timestamp": "2021-02-08 17:28:39"
    },
    {
        "message": "#History  #USA  #quotes \n\"The goal of the Socialist Party is Socialism, not a reformed capitalism. Its tactics must be those that will bring about Socialism. \n\nIf those who are advocating reversion can show that these proposals will help to establish Socialism, and are not merely personal views and predilections in regard to the war, which have no relation to a Socialist policy, then the party should be ready to listen to them.\n\n If they can not show that then their advice deserves no consideration. To prove that Socialism will be attained, not by a working class movement ﬁghting a class struggle for the reorganization of our industrial system, but through an alliance with the enemy we are ﬁghting, that is the impossible task before those who are urging the party to change its position.\"\n\n\"Where do We Stand?\" (1918)\n\nC. E. Ruthenberg - Marxist politician and a founder and head of the American Communist Party",
        "timestamp": "2021-02-08 12:58:34"
    },
    {
        "message": "#news #USA\n\nWorkers Lose $3.7 Trillion Earnings During Crisis",
        "timestamp": "2021-02-08 02:02:48"
    },
    {
        "message": "In connection with this date, it is worth recalling the crimes of the Kolchak army.\n\n1918-December 25-26: Massacre of several hundred socialist militants and workers imprisoned at Omsk by units of General I.N. Krasilnikov (Admiral Kolchak's Army), 1919 Mid-April: Massacre of 670 prisoners (militant Socialist-Revolutionaries, workers) incarcerated in Ufa, 1919-May: Massacre of 350 prisoners incarcerated in Chita, 1919- July 10-14: Pogrom in Yekaterinburg. Approximately 2,200 victims, mostly Jewish.\n\nIt is worth recalling that Kolchak's close ties with the United Kingdom and the United States are well documented. \n\nHistorians with impeccably objective credentials point to Kolchak's contacts with foreign interests. As the historian Oleg Budnitsky notes, the fact that Kolchak became the leader of the anti-Bolshevik movement in Siberia is not accidental. \"Without a doubt, the fact that he was well-known, relatively well-known to political figures in the United Kingdom and the United States, played a huge role.\" \n\nThis was the first major victory over the capitalist reaction. This proved that even bestial cruelty will not help the doomed ruling class to subdue the people who have raised their heads.",
        "timestamp": "2021-02-07 16:56:04"
    },
    {
        "message": "#History #Russia #Date #Agitation #Art\nOn February 7, 1920, a war criminal, an English agent, a leader of the counter-revolution and an anti-people dictator, Alexander Kolchak, was executed by firing squad.",
        "timestamp": "2021-02-07 16:53:18"
    },
    {
        "message": "#History  #Korean_war  #Photo\nOn February 7, 1951, units of the 11th division of the South Korean army commit a mass murder of civilians (705 people, 85% women, old people and children) in kunah (counties) Sancheon and Hamyang Do (provinces) Gyeongsangnam-We who were suspected of sympathizing with the Communists.",
        "timestamp": "2021-02-07 14:36:04"
    },
    {
        "message": "#quote #USSR #Lenin",
        "timestamp": "2021-02-06 23:59:58"
    },
    {
        "message": "#Photo #History #UK\nCommunists in London celebrating May Day. 1928",
        "timestamp": "2021-02-06 15:34:56"
    },
    {
        "message": "#USA #Agitation #Art\nHugo Gellert poster for Daily Worker circa 1935 \n(Merrill C. Berman Collection, New York Historical Society)",
        "timestamp": "2021-02-06 08:23:04"
    },
    {
        "message": "#news #USA\n\nU.S. Capitalists Gain $1.1 Trillion During Crisis\n\nhttps://us.politsturm.com/u-s-capitalists-gain-1-1-trillion-during-crisis/",
        "timestamp": "2021-02-05 20:20:36"
    },
    {
        "message": "#quotes #USA\n\"Bolshevism is not something strange and new. It is not a blind, raging force of destruction. If at present its triumph is accompanied by bloodshed and destruction it is because the bankruptcy of capitalism precipitated a cataclysm and the workers are obliged to build the new order amidst the wreckage of the old and with those who proﬁted from their former oppression and exploitation placing every obstacle possible in their path. Bolshevism is Marxian Socialism in action. It is the social revolution underway. It is the workers on the road to victory and a better world.\"\n \n\"The Bolshevists: Grave-Diggers of Capitalism\" (1919) – C. E. Ruthenberg (american Marxist  politician and a founder and head of the Communist party of USA).",
        "timestamp": "2021-02-05 18:10:50"
    },
    {
        "message": "#USSR #History #Agitation.\n\n\"They have abundance only for the rich, while we strive for abundance for all. \nAbout 20 million Americans can't afford to buy more then 1 liter of milk in a month and to consume more then 6 kilograms of meat in a year\"\nSoviet agitation poster by V. Govorkov, 1957",
        "timestamp": "2021-02-05 07:01:29"
    },
    {
        "message": "The Yalta Conference of 1945, a conference of the heads of government of the three powers allied in the Second World War of 1939-1945-the USSR, the USA, Great Britain: Chairman of the SNK of the USSR I. V. Stalin, US President F. D. Roosevelt and British Prime Minister W. Churchill with the participation of foreign ministers, chiefs of staff, etc. the advisors. \n\nIt took place in Yalta on February 4-11, at a time when, as a result of the powerful offensive attacks of the Soviet Army, which transferred military operations to German territory, the war against Hitler's Germany entered the final stage. The war plans of the Powers for the final defeat of fascist Germany were agreed upon, their attitude towards Germany after its unconditional surrender was determined, and the basic principles of the general policy towards the post-war organization of the world were outlined. \n\nIt was decided that after the German armed resistance was finally crushed, the armed forces of the USSR, the United States and Great Britain would occupy Germany; and the troops of each of the mentioned powers would occupy a certain part (zone) of Germany. It also provided for the creation of a coordinated allied administration in Germany and the establishment of control, carried out through a specially created control body consisting of the commanders-in-chief of the three powers, with the seat in Berlin. At the same time, it was indicated that France would be invited to take over a certain zone of occupation and participate as the fourth member of this control body. \n\nThe specific resolution of the issue of occupation zones of Germany was achieved before the K. K. in the European Advisory Commission and recorded in the Protocol of the Agreement between the governments of the USSR, USA and the United Kingdom occupation zones of Germany and about the management of 'Big Berlin''dated September 12, 1944. The participants of the conference stated that their unwavering goal is to destroy German militarism and Nazism and to create guarantees that ' Germany will never again be able to violate",
        "timestamp": "2021-02-04 15:42:41"
    },
    {
        "message": "#history\nFebruary 4, 1945 76 years ago \nThe Crimean (Yalta) Conference has begun",
        "timestamp": "2021-02-04 15:41:35"
    },
    {
        "message": "And from under the ceiling\nscreeches \na rabid canary.\nMarx was looking and looking from the wall...\nBut suddenly\nstretched his mouth,\nand yelled:\n\"Suburbanity's threads entangled the revolution.\nScarier then Wrangel is philistine life.\nHurry\nbreak canaries' heads –\nso that communism\nwouldn't be broken by them!\"\nThe photo: Vladimir Mayakovsky with his posters.",
        "timestamp": "2021-02-04 15:01:46"
    },
    {
        "message": "#history #USSR\nThe \"Soviet-styled\" patterns look really interesting even nowadays. However, in 1920s not all the people accepted the textile with the sickle and hammer – main symbols of the Soviet Union. A lot of communists viewed these things as mockery of their ideals: they fought to the death for these sacred symbols, while someone wears them as the part of the dress. \"On Rubbish\" poem, written by the famous Soviet poet Vladimir Mayakovsky, is the perfect example:\n...And in the evening\nthis or that scum,\nis looking.\nAt his wife,\nstudying the piano, and \nsays,\nchilling with samovar:\n\"Comrade Nadya!\nIncrease for the holiday –\n24 thousand rubles.\nTariff.\nWell, I'll buy myself\nPacific-Oceaned breeches,\nto look from \nthe trousers\nas coral reef!\"\nAnd Nadya:\n\"Dresses with emblems for me.\nWithout sickle and hammer you can't go out!\nWhat\nwill I wear\ntoday\non the dancing-party in the Revvoyensoviet?!\"\nMarx' portrait on the wall.\nThe frame is red.\nLying on \"Izvestiya\", a kitten warms up.",
        "timestamp": "2021-02-04 15:00:31"
    },
    {
        "message": "#quote #USSR #Stalin\nStalin on Bourgeois Constitutions\n\nBourgeois constitutions tacitly proceed from the premise that society consists of antagonistic classes, of classes which own wealth and classes which do not own wealth; that no matter what party comes into power, the guidance of society by the state (the dictatorship) must be in the hands of the bourgeoisie; that a constitution is needed for the purpose of consolidating a social order desired by, and beneficial to, the propertied classes.\n\nJoseph Stalin,\nOn the Draft Constitution of the U.S.S.R",
        "timestamp": "2021-02-04 09:32:58"
    },
    {
        "message": "",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "#History #USSR #Art\nThe fabrics produced by the Soviet factories in 1920s were distinguished not only by motley patterns, but also by \"propaganda\" patterns.",
        "timestamp": "2021-02-03 19:29:50"
    },
    {
        "message": "#quote #Lenin #theory\n\nThe American trusts are the supreme expression of the economics of imperialism or monopoly capitalism. They do not confine themselves to economic means of eliminating rivals, but constantly resort to political, even criminal, methods.\n\nVladimir Lenin,\nA Caricature of Marxism and Imperialist Economism",
        "timestamp": "2021-02-03 00:44:58"
    },
    {
        "message": "#news\nAmazon Pushes For In-Person Union Vote Despite COVID\n\nArticle:\nhttps://us.politsturm.com/amazon-pushes-for-in-person-union-vote-despite-covid/",
        "timestamp": "2021-02-02 10:37:17"
    },
    {
        "message": "#history #USSR\nOn February 1, 1932, the Magnitogorsk Metallurgical Plant and the Nizhny Novgorod Aircraft Building Plant were commissioned.",
        "timestamp": "2021-02-01 23:03:55"
    },
    {
        "message": "#quote #Lenin #theory\nAccording to the theory of socialism, i.e., of Marxism (non Marxist socialism is not worth serious discussion nowadays), the real driving force of history is the revolutionary class struggle; reforms are a subsidiary product of this struggle, subsidiary because they express unsuccessful attempts to weaken, to blunt this struggle, etc. According to the theory of bourgeois philosophers, the driving force of progress is the unity of all elements in society who realise the “imperfections” of certain of its institutions. The first theory is materialist; the second is idealist. The first is revolutionary; the second is reformist. The first serves as the basis for the tactics of the proletariat in modern capitalist countries. The second serves as the basis of the tactics of the bourgeoisie.\n\nVladimir Lenin, Once Again About the Duma Cabinet",
        "timestamp": "2021-02-01 09:50:32"
    },
    {
        "message": "#History #USSR #WW2 #Art\nLenin's portrait painted on the piece of parachute silk by the Soviet partisans. Paints were obtained from a decoction of herbs.",
        "timestamp": "2021-01-31 18:06:29"
    },
    {
        "message": "The social networks all across the globe are controlled by capitalists. They do what they want, and they want to remove any possibilities for communists to agitate people. We've created a Telegram channel, where you can get latest posts from Politsturm International. Class struggle news, Marxist-Leninist theory, history of the communist movement, useful facts and statistics – you can find all of these here. Join our channel and discuss our posts with comrades across the world!",
        "timestamp": "2021-01-31 14:53:21"
    },
    {
        "message": "#history #USSR \n\"Universal military training is the key to victory. Comrade! You must master your rifle just as scythe!\"\nA Soviet poster of the Civil war period.",
        "timestamp": "2021-01-31 14:43:59"
    },
    {
        "message": "#quote #Lenin #theory\nDisarmament is the ideal of socialism. There will be no wars in socialist society; consequently, disarmament will be achieved But whoever expects that socialism will be achieved without a social revolution and the dictatorship of the proletariat is not a socialist.\n\nVladimir Lenin, The “Disarmament” Slogan",
        "timestamp": "2021-01-31 14:39:47"
    },
    {
        "message": "Hello! This is Politsturm International channel. Politsturm is a Marxist-Leninist project aimed at reestablishing communist movement across the world. Class struggle news, history of the communist movement, the Soviet Union, the world socialist system, etc. – we produce a lot of content.",
        "timestamp": "2021-01-30 15:57:05"
    }
]