[
    {
        "message": "",
        "timestamp": "2023-03-23 09:50:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-23 09:50:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-23 09:50:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-23 09:50:02"
    },
    {
        "message": "Happy birthday revolutionary socialist, \"guerrilla intellectual\" and pan-African activist Walter Rodney!\n\nIn his landmark book “How Europe Underdeveloped Africa”, Rodney explained how European “development” was the flip-side of African “underdevelopment”. He methodically proved how centuries of European colonial exploitation have exhausted Africa of its wealth while enriching the West. \n\nBorn into a working-class family in what was then British Guyana, in the 1960s Rodney taught at Jamaica's University of the West Indies while also holding public lectures on the streets known as “groundings”. There crowds gathered to discuss radical political ideas and these sessions played a key role in the development of revolutionary thinking in the Caribbean.\n\nIn 1968, Rodney was banned from Jamaica forcing him to return to his home country, Guyana. In 1980 he was assassinated by a car bomb, an attack widely believed to have been a political assassination orchestrated by the state.",
        "timestamp": "2023-03-23 09:50:02"
    },
    {
        "message": "Listen to Gaddafi's former spokesman, Moussa Ibrahim, explain what Libya has lost since NATO's war and watch the full interview here.\n\nWhen Muammar Gaddafi overthrew King Idris in a 1969 military coup, Libya was one of the poorest countries in Africa. Despite oil being discovered in the early 1950s, much of that wealth went into the hands of foreign companies. At the same time, British, U.S. and other foreign military bases were dotted around the country.\n\nShortly after seizing power, Gaddafi nationalized Libya's oil and kicked out all foreign military forces, including closing one of the US' biggest bases abroad, the Wheelus Air Base.\n\nBy the time NATO invaded Libya, it was the richest country in Africa and had the highest level of human development on the continent, achievements that NATO obliterated.\n\nListen to Gaddafi's former spokesman, Moussa Ibrahim, explain what Libya has lost since NATO's war.",
        "timestamp": "2023-03-22 18:41:43"
    },
    {
        "message": "More than a billion and a half Muslims around the world will soon venture out to buy dates. Don't be tricked into buying dates produced on occupied Palestinian land! Watch now to learn more ☝️",
        "timestamp": "2023-03-22 15:55:04"
    },
    {
        "message": "Clashes erupted again on Tuesday across France as protesters furious at President Emmanuel Macron’s attempt to raise the retirement age from 62 to 64 clashed with police. In Paris protesters took to the streets to vent their fury a day after the French government survived two no confidence votes. \n\nProtests against the reform have been going on since mid-January but tensions were inflamed on Friday when Macron asked Prime Minister Elisabeth Borne to force the reform through the National Assembly without a vote. \n\nDespite that polls show 70% of the French population is opposed to the reforms, Macron has refused to back-down. He has ruled out withdrawing the reform holding a referendum or dissolving the National Assembly.\n\nUnions have been at the forefront of the protests with garbage collectors and refinery workers particularly prominent. As a result, trash has built up on the streets in Paris and oil deliveries into France have been disrupted. A day of strikes and protests has been called for Thursday.",
        "timestamp": "2023-03-22 13:51:01"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 11:54:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 11:54:02"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 11:54:02"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 11:54:02"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 11:54:01"
    },
    {
        "message": "On this day in 1931, Indian socialist revolutionary Bhagat Singh and his comrades, Sukhdev Thapar and Shivaram Rajguru, were executed by India's British colonial rulers.\n\nThe three were in their early '20s when they were executed and in his short life, Singh became one of the most influential revolutionaries in India's independence movement.\n\nIn 1928, Singh, Thapar and Rajguru killed British colonial police officer, James Saunders in Lahore, to avenge the murder of independence leader Lala Lajpat Rai at the hands of British colonial police. Singh mistook Saunders for Police Superintendent James Scott, who he had intended to assassinate. Scott had ordered the police baton charge on Rai that eventually ended in his death.\n\nOn March 23, 1931, Bhagat Singh and his two fellow revolutionaries were hanged. As they marched towards the gallows, they reportedly chanted \"Down with British Imperialism\" and \"Down with capitalism!\".",
        "timestamp": "2023-03-22 11:54:01"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:48"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:48"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:47"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:47"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:46"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:46"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:45"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:45"
    },
    {
        "message": "",
        "timestamp": "2023-03-22 09:50:45"
    },
    {
        "message": "French workers continue to rebel against President Emmanuel Macron’s attempt to force through his pension bill raising the retirement age from 62 to 64. Macron ordered Prime Minister Elisabeth Borne to force the amendment through the National Assembly without a vote.\n\nSince Friday, clashes have been raging across France between protesters and police. While Macron appeared defiantly on TV last night, on the capital's streets police used tear gas against protesters who set garbage cans of fire to repel them. \n\nA national day of strikes and protests has been declared for Thursday as unions demand the withdrawal of the pension reform bill. \n\nIn the National Assembly opposition politicians sang the national anthem and held up banners indicating their opposition to the retirement age being set at 64 as a special constitutional power known as article 49.3 was used to force the law through. Polls have consistently shown that most French citizens are against the changes.",
        "timestamp": "2023-03-22 09:50:44"
    },
    {
        "message": "For Women’s History Month, watch Lady Izdihar discuss the phrase of Russian revolutionary, Vladimir Lenin, “every kitchen maid must learn to run the state”. With this call, Lenin urged women to join their local Soviet worker’s council and become an important part of the revolution. \n\nJust a few months after seizing power in 1917, the Bolsheviks issued a new family code which separated marriage from the church, allowed marrying women to choose a surname and provided extended grounds for women to divorce. In 1920, the Soviet Union became the first country to legalize abortion, and then the first country to criminalize marital rape in 1922.\n\nLabor laws were also reformed to help women enter the workplace on an equal basis to men. For example, they were given equal rights in terms of insurance in case of illness from work and eight weeks of paid maternity leave. Men and women were also granted a minimum wage and paid holiday leave.",
        "timestamp": "2023-03-21 15:51:01"
    },
    {
        "message": "On this day in 1947, U.S. Cold War paranoia reached its pinnacle when President Harry Truman signed Executive Order 9835 to tackle alleged communist infiltration.\n\nAlso known as the \"loyalty order\" it paved the way for 3 million government employees to come under investigation, and was the prelude to the anti-communist witch hunts known as McCarthyism led by Republican Senator Joseph McCarthy.\n\nThe order enabled the FBI to research the associations and beliefs of federal employees and if “derogatory information” was found they could launch investigations using confidential witnesses. Employees could be fired if “reasonable doubts” existed about their loyalty to the U.S. There was no right of appeal against the decision made by loyalty boards.\n\n300 government employees were dismissed for allegedly being a security risk while 5,000 offered voluntary resignations following investigations with many taking place during humiliating public congressional hearings. No espionage charges were launched.",
        "timestamp": "2023-03-21 13:55:06"
    },
    {
        "message": "What is it like to be a young Black man dealing with racism in Britain? Our documentary, Armed & Dangerous: Britain's Racist Police, captures a poignant moment featuring a group of young men from an inner city London estate sharing their experiences of racist policing. \n\nYou'll see how institutional racism influences every level of society from daily social situations like people clutching their bags tighter when they walk past, to police stopping and searching them for no good reason. While Razak and his friends may seem to brush off these encounters with laughter, the truth behind their smiles reveals a deeper pain and frustration. \n\nDon't miss out on the chance to watch the full documentary and gain a new perspective on the realities of racism in Britain. Watch the full documentary now.",
        "timestamp": "2023-03-21 12:02:32"
    },
    {
        "message": "\"Thanks to EFF\" is trending on social media in the wake of yesterdays massive National Shutdown across South Africa organized by the Economic Freedom Fighters (EFF).\n\nTwitter was filled with thousands of posts and pictures of things South Africans were able to do with electricity running, with tweeters thanking the Marxist-Leninist EFF. During the shutdown, public utility company, ESKOM, suspended its power blackouts which have been one of the main triggers of public anger towards the ANC government. \n\nMeanwhile, South Africa was painted red as thousands responded to the EFF's call for a nationwide day of strikes and protests against a range of issues gripping South Africa, from rolling power-cuts (load-shedding), to gender-based violence, unemployment and high crime rates.\n\nEFF Commander in Chief, Julius Malema, was leading a sit-in protest outside Ramaphosa's office. The shutdown was peaceful, despite the government deploying the army on the streets for one month in response to growing public unrest.",
        "timestamp": "2023-03-21 10:40:17"
    },
    {
        "message": "Listen to Muammar Gaddafi's former spokesman, Moussa Ibrahim, call out Western journalists for behaving like \"servants\" of their governments during NATO's war on Libya.\n\nWatch the full interview now for his insights on media bias, NATO's real motives for the invasion and its crimes in Libya.",
        "timestamp": "2023-03-20 16:34:34"
    },
    {
        "message": "The Peruvian Indigenous-led uprising against the right-wing coup last December has now passed the 100 day mark. The symbolic milestone sparked renewed protests and clashes in the capital Lima.\n\nThe arrest of democratically elected leftist President Pedro Castillo last December on  the orders of the un-elected right-wing congress sparked nationwide protests against de-facto President Dina Boluarte. The U.S. and Europe immediately recognized the coup government.\n\nCastillo says U.S. imperialism, which seeks to plunder Peru's rich lithium resources, was behind the coup that ousted his government. He is being held in a high-security prison in Lima.\n\nHuman rights organizations have condemned racist repression of the protests by Peru's police. The focal point of the uprising is in the majority Indigenous south. At least 70 people have been killed in the protests as police forces have used lethal force on multiple occasions throughout the course of the uprising.",
        "timestamp": "2023-03-20 14:55:03"
    },
    {
        "message": "The Economic Freedom Fighters' (EFF) National Shutdown is paralyzing large parts of South Africa as massive crowds flood the streets across several cities. The day of strikes and protests has been prepared for months, with the EFF saying it mobilized people \"house by house\"\n\nSouth African police arrested at least 87 people earlier in the day in connection with the shutdown and seized nearly 25,000 items they claimed would be used for barricade construction. Head of EFF Julius Malema announced at an earlier press conference \"We dont care what the judges say. No one can stop a revolution.\"\n\nThe EFF is calling for the resignation of President Cyril Ramaphosa, saying the country is \"on the brink of collapse\" under his government.\n\nSouth Africa is suffering a devastating energy crisis thanks to deteriorating infrastructure. The government is responding with unpopular \"load-shedding\" -  rolling power blackouts. The EFF called load-shedding \"the final nail in the coffin\" for the lives of the South African people.",
        "timestamp": "2023-03-20 13:08:11"
    },
    {
        "message": "Resistance to wildly unpopular pension reforms continues to escalate across France, after President Emmanuel Macron forced them through without a parliamentary vote.\n\nClashes raged on the streets of the capital, despite bans on assembly in several hotspots in Paris. Meanwhile, strikes at petrol refineries were stepped up after unions shut down one of France's biggest Total refineries in Normandy.\n\nPolice arrested 169 protesters across the country on Saturday alone, and tried to crush the protests with water cannons, tear gas and pepper spray.\n\nUnions have announced a 9th day of nationwide strike and protest this coming Thursday with one of France's biggest unions, the CGT, declaring \"the endgame is now\".",
        "timestamp": "2023-03-20 10:30:24"
    },
    {
        "message": "Did you know about the ethnic cleansing of Black people during NATO's war on Libya? \n\nOn the 12th anniversary of the war, watch this video that recalls one of the most under-reported tragedies of the conflict.",
        "timestamp": "2023-03-19 14:55:04"
    },
    {
        "message": "",
        "timestamp": "2023-03-19 12:53:04"
    },
    {
        "message": "",
        "timestamp": "2023-03-19 12:53:04"
    },
    {
        "message": "",
        "timestamp": "2023-03-19 12:53:04"
    },
    {
        "message": "",
        "timestamp": "2023-03-19 12:53:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-19 12:53:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-19 12:53:02"
    },
    {
        "message": "20 years ago, the U.S. launched its illegal invasion and subsequent occupation of Iraq based on the lie that Iraq would deploy weapons of mass destruction. \n\nThe war caused the deaths of over one million Iraqis and committed countless war crimes. Read the slides as we remember this terrible day. 👉",
        "timestamp": "2023-03-19 12:53:02"
    },
    {
        "message": "For the 12th anniversary of NATO's invasion of Libya, we interviewed Muammar Gaddafi's former spokesman, Moussa Ibrahim. Watch the full interview now.\n\nNATO's invasion of this African Union member state was justified on the pretext of \"protecting civilians\", a claim for which no credible evidence was ever presented. The real goal was to overthrow Muammar Gaddafi's government for its role in spearheading pan-African integration and liberation. France in particular, was especially eager to crush Gaddafi's moves to launch a pan-African currency, the Golden Dinar, backed by Libya's huge gold reserves. \n\nIn this interview, Ibrahim recalls NATO's crimes during the war, what Libya was like before it, his government's efforts to lead African liberation from Western neocolonialism, and how Libya paid the ultimate price for challenging the West. \n\nIbrahim also discusses the prospects for Gaddafi's son, Saif al-Islam, to be Libya's next leader.",
        "timestamp": "2023-03-19 10:54:01"
    },
    {
        "message": "On this day in 1871, the Paris Commune took control of the city, overthrowing the bourgeois French government for a thrilling two months! 🚩 But did you know that it was on those very barricades that the revolutionary anthem, The Internationale, was born? 🔥 Listen up to Izdihar explain the history. 🎶",
        "timestamp": "2023-03-18 15:58:02"
    },
    {
        "message": "Ahead of the 20th anniversary of the illegal U.S. invasion and subsequent occupation of Iraq, listen to how Iraqis remember the devastating war that raged for more than eight years.\n\nLess than five years after the war began, in January 2008, research by leading British pollster, Opinion Research Business (ORB), reported that at least one million Iraqis had died as a result of the war. OPR found that twenty per cent of Iraqi households had suffered at least one death.",
        "timestamp": "2023-03-18 13:55:05"
    },
    {
        "message": "",
        "timestamp": "2023-03-18 12:01:13"
    },
    {
        "message": "",
        "timestamp": "2023-03-18 12:01:13"
    },
    {
        "message": "",
        "timestamp": "2023-03-18 12:01:12"
    },
    {
        "message": "",
        "timestamp": "2023-03-18 12:01:12"
    },
    {
        "message": "Nakuru, Kenya – A woman lifts a cooking pot during anti-government protests amid Kenya's severe cost-of-living crisis that has left many Kenyans struggling to make ends meet.\n\nNablus, Occupied Palestine – A protester returns a tear gas grenade that was fired by Israeli forces against Palestinians resisting against illegal Israeli outposts in the occupied West Bank.\n\nAthens, Greece – A protester confronts riot police units amid nationwide protests following the deadliest train crash in the country's history that left 57 dead.\n\nEdinburgh, Scotland – Hundreds of trans-rights activists protest an event aimed to undermine LGBTQ+ inclusivity in schools.\n\nLondon, England – Protests erupt against Tory government proposals to detain refugees arriving in the country \"without prior permission\" for up to 28 days.\n\n[2/2]",
        "timestamp": "2023-03-18 12:01:11"
    },
    {
        "message": "",
        "timestamp": "2023-03-18 12:01:04"
    },
    {
        "message": "",
        "timestamp": "2023-03-18 12:01:04"
    },
    {
        "message": "",
        "timestamp": "2023-03-18 12:01:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-18 12:01:03"
    },
    {
        "message": "This week's photo dump featuring people in struggle and major events worldwide.\n\nLeft to right 👉\n\nParis, France – Millions of workers have been on the streets across the country to resist pension reforms which President Emanuel Macron is forcing through without  a vote.\n\nLahore, Pakistan – Supporters clash with riot police trying to resist the arrest of ex-prime minister, Imran Khan.\n\nKathmandu, Nepal – Farmers take to the streets en masse against loan sharks, saying they have been defrauded by microfinance companies.\n\nTecoluca, El Salvador – Some of the 65,000 people arrested  in right-wing President Nayib Bukele's \"anti-gang\" crackdown pictured in dehumanizing conditions at this \"mega-prison\". Bukele has vowed they  will \"never return\".\n\nKhartoum, Sudan – Young protesters sit on make-shift barricades during anti-coup protests that have gripped the country for over a year and left more than 125 protesters dead.\n\n[1/2]",
        "timestamp": "2023-03-18 12:01:02"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 16:15:11"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 16:15:11"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 16:15:10"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 16:15:10"
    },
    {
        "message": "For St. Patrick's Day ☘️, we remember the Argentinian revolutionary in whose veins \"flowed the blood of Irish rebels\".",
        "timestamp": "2023-03-17 16:15:10"
    },
    {
        "message": "For St. Patrick's Day, we honor the leader of Ireland's revolutionary socialist struggle, James Connolly.\n\nConnolly founded the Irish Socialist Republican Party in 1898 and in 1903 the Irish Transport & General Workers' Union, which became the largest union in Ireland and led the 1913 Dublin Lockout. \n\nConnolly also played a leading role in the Easter Rising of 1916 against Britain, waged at the height of WWI under the slogan: \"England's misfortune is Ireland's opportunity\". On May 12, Connolly and other leaders of the rising were tried by a secret British court-martial that lasted only a few minutes and executed by firing squad. \n\nConnolly believed sacrificing his life was necessary to inspire Irish people to take up arms against British rule, which indeed it would come to do in the years and decades that followed. Shortly before his execution his wife Lille said to him: \"Your life, James, your beautiful life.\" to which he replied: \"Well, Lillie, hasn't it been a beautiful life, and isn't this a good end?",
        "timestamp": "2023-03-17 13:55:07"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 11:51:56"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 11:51:56"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 11:51:55"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 11:51:55"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 11:51:54"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 11:51:54"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 11:51:53"
    },
    {
        "message": "",
        "timestamp": "2023-03-17 11:51:53"
    },
    {
        "message": "Today, millions of people around the world celebrate Irish St. Patrick's Day, a festival from the tiny island of Ireland. ☘️ Do you know why? Read on 👉",
        "timestamp": "2023-03-17 11:51:53"
    },
    {
        "message": "Thousands of workers across Greece have joined a 24-hour strike in protest of the country's austerity measures and privatization policies following a fatal train crash in Tempi that claimed the lives of 57 people. The tragedy has led to weeks of protests in the country.\n\nAccording to police reports, over 25,000 demonstrators flooded the streets of Athens. Video footage of the strike shows intense clashes between the riot police and protesters, who were seen hurling Molotov cocktails.\n\nThe All-Workers Militant Front (PAME), the union federation that organized the strike, has accused the right-wing government of Greece of prioritizing profits over human lives. \"You count profits and losses - We count human lives!\" PAME said in a statement, calling for an end to austerity and privatization, which they hold responsible for the crash.",
        "timestamp": "2023-03-17 10:14:25"
    },
    {
        "message": "Outrage burst through the streets of Paris following the announcement that President Emmanuel Macron will force through his wildly unpopular pension reforms without a vote in France’s National Assembly.\n\nMacron is triggering article 49.3 of the French constitution which permits the government to declare a bill “adopted” without a vote in the National Assembly - the lower house of the French Parliament.\n\nHead of the French Communist Party, Fabien Roussel, said: “This government is not worthy of our Fifth Republic, of French democracy. Until the very end, parliament has been ridiculed, humiliated.” \n\nMacron’s government initially claimed the reforms, which will raise the retirement age and force people to work more consecutive years, were designed to make the system “fairer”. It has more recently admitted that the true goal was “savings”. Macron, a former investment banker, last year awarded himself a pay rise, bringing his monthly salary to 15,737 euros citing \"inflationary pressures\"",
        "timestamp": "2023-03-16 17:55:05"
    },
    {
        "message": "Emmanuel Macron clings on to pension reforms - China to broker peace in Ukraine? - South Africa braces for national shutdown - UK gripped by #ToryCostOfGreed crisis. \n\nHere's this week's news in 90 seconds. ☝️",
        "timestamp": "2023-03-16 16:26:47"
    },
    {
        "message": "",
        "timestamp": "2023-03-16 11:54:05"
    },
    {
        "message": "",
        "timestamp": "2023-03-16 11:54:04"
    },
    {
        "message": "",
        "timestamp": "2023-03-16 11:54:04"
    },
    {
        "message": "",
        "timestamp": "2023-03-16 11:54:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-16 11:54:03"
    },
    {
        "message": "",
        "timestamp": "2023-03-16 11:54:02"
    },
    {
        "message": "",
        "timestamp": "2023-03-16 11:54:02"
    },
    {
        "message": "",
        "timestamp": "2023-03-16 11:54:01"
    },
    {
        "message": "Today we remember the worst single poison gas attack against civilians in history, the Halabja massacre ordered by Saddam Hussein in 1988 against the Kurdish city during the Iran-Iraq war. \n\nThe UN classified the massacre as genocide. Over 7,000 people were killed, most of them civilians. The massacre was part of a major counterinsurgency campaign against oppressed Kurds who joined the Iranians in the fight against Hussein.\n\nThe massacre was made possible by direct and indirect support from the U.S. and Germany, which manufactured and supplied the poison gas. The Halabja massacre left many victims suffering the long term effects, including cancer, skin diseases, infertility, and congenital deformities.",
        "timestamp": "2023-03-16 11:54:01"
    },
    {
        "message": "Watch Irish MEP Clare Daly demand that Europe \"stop playing US war games\" and put its own interests first.\n\nThe EU's mimicking of US policies in response to the Ukraine war, particularly sanctions on Russia,  has left the bloc crippled with energy & cost of living crises and \"an angry nuclear power on our doorsteps\" to boot.",
        "timestamp": "2023-03-16 10:05:52"
    },
    {
        "message": "Watch red. media's debut doc \"Armed and Dangerous: Britain's Racist Police\" \n\nOur documentary delves into the experiences of Britain’s Black community, including insights from Kaba’s family and other families who have lost loved ones due to racist police violence.",
        "timestamp": "2023-03-15 18:27:01"
    },
    {
        "message": "Clashes are happening on the streets of Paris between police and protesters who have been tirelessly resisting President Emanuel Macron's neoliberal pension reforms for months.\n\nVideo footage shows police firing tear gas grenades and using batons to brake up the massive crowds. Protesters are trying to defend themselves by throwing pyrotechnics and other objects at police. Police arrested at least 32 protesters over the weekend.\n\nThe French Senate recently voted 195 to 112 in favor of enforcing the reforms, which ignited a new round of protests. The General Confederation of Labor (CGT), one of France's largest unions, responded with the words: \"This is the final stretch\" and \"The endgame is now.\"\n\nUnions and political organizations have protested over 250 times in Paris against the planned pension reforms. This year has already seen seven national strike days, where countless workers across France have walked off their jobs.",
        "timestamp": "2023-03-15 17:21:33"
    },
    {
        "message": "Watch now - \"Deadly Bloom: Flower Farms in Kenya\".\n\nDiscover the shocking truth behind the flowers sold in florists and supermarkets worldwide from this hard-hitting investigation. In the documentary, red. exposes extreme abuses by multinational corporations in Kenya's cut flower industry which supplies 40% of Europe's roses. Despite making millions, these companies pay workers as little as $55 a month and force them to use chemicals banned by the Stockholm Convention, according to toxicologists and doctors we spoke to during our five-month investigation. \n\nOur findings reveal a link between the illegal chemical use and disproportionate rates of sickness, miscarriage, and infertility amongst flower farm workers in Kenya, who face death threats when they speak out. \n\nDon't miss this red. documentary that will open your eyes to the hidden realities of the cut flower industry in Kenya.",
        "timestamp": "2023-03-15 16:01:44"
    },
    {
        "message": "The Economic Freedom Fighters Party is urging South Africans to join the \"National Shutdown\" on March 20, and \"take on white monopoly capital\" in South Africa. The EFF says the country is \"on the brink of collapse\" and is calling for the  resignation of President Cyril Ramaphosa.\n\nAt today's press conference, Commander in Chief of the Marxist-Leninist EFF, Julius Malema, announced that his party will mobilize people at every level to paralyze the country promising the \"mother of all shutdowns.\" \n\nThe South African Federation of Trade Unions (SAFTU) is joining the protest which is a response to a multitude of crises hitting South Africa, including collapsing infrastructure that has prompted the government practice of rolling electricity blackouts known as load-shedding.\n\nSouth Africa's inflation rate has risen to as high as nearly 8% in recent months, according to Trading Economics. The EFF says the ruling ANC government would rather submit to Western forces than find solutions to the country's crises.",
        "timestamp": "2023-03-15 13:22:20"
    },
    {
        "message": "Watch U.S. State Department spokesman Ned Price claim that his country's foreign policy has left the Middle East \"more stable\" and \"more prosperous.\"\n\nPrice was responding to assertions that China's stunning diplomatic success in restoring ties between arch rivals Saudi Arabia and Iran, was evidence that President Joe Biden's administration has lost in the Middle East. Price insisted that the United States is \"deeply engaged with the Middle East.\"\n\nA quarter of the U.S'. 400 wars since 1776 have targeted the Middle East and Africa, according to a new large-scale study by Tufts University. \n\nHundreds of thousands of civilians have lost their lives from U.S. wars and attacks in the Middle East since 2000 alone, particularly in Afghanistan, Iraq, Yemen, Libya and Syria.",
        "timestamp": "2023-03-15 09:55:44"
    },
    {
        "message": "Burkinabe revolutionary, Thomas Sankara compares imperialism to a \"bad student...which never learns the lessons of its failures.\" \n\nThomas Sankara was a communist revolutionary leader who became President of Burkina Faso in 1983. His revolutionary ideology drew inspiration from Marxism-Leninism, pan-Africanism, women's liberation and anti-imperialism. Sankara was assassinated in 1987 in a coup that several critics have alleged was backed by France. \n\nFrance colonized Burkina Faso until 1960 and upon coming to power Sankara's government took several steps to reduce France's ongoing neocolonial control of the country. One of Sankara's first moves was to rename the country from Upper Volta to Burkina Faso, meaning \"land of the upright people\".",
        "timestamp": "2023-03-14 18:44:01"
    },
    {
        "message": "Kenyan MP Glady Boss Shollei says western multinationals' use of illegal chemicals that poison Kenyan flower farm workers is \"indicative of what the west thinks of Africa\".\n \nLearn the shocking truth about Kenya’s flower industry in our upcoming documentary, “Deadly Bloom: Flower Farms in Kenya”, out tomorrow @ 1700 CET.",
        "timestamp": "2023-03-14 17:53:04"
    },
    {
        "message": "Watch Floyd Shivambu, Deputy President of South Africa's Economic Freedom Fighters, condemn the Inter-Parliamentary Union's (IPU) focus on the war in Ukraine at the expense of humanitarian crises in countries like Afghanistan and Yemen. \n\nIn his address, the Marxist-Leninst parliamentarian and freedom fighter, Shivambu, says it's \"unacceptable\" that the IPU gets \"bogged down\" with the \"interests of countries which historically are associated with colonialism and repression of the world\".\n\nThe 146th IPU is being held in Manama, Bahrain, bringing together delegations from 179 parliaments around the world.",
        "timestamp": "2023-03-14 15:58:26"
    },
    {
        "message": "What does apartheid look like in practice? Look no further than Israeli-occupied Palestine. \n\nIn 2002, Israel built the \"Separation Wall\" which slices through Palestinian communities, neighborhoods and agricultural land. Often referred to as the \"Apartheid Wall\", the United Nations has long branded it \"illegal\". Unlike the US-Mexico border wall or the India-Bangladesh border fence, the Separation Wall cuts through areas within a country.\n\nVideo footage shows an Israeli checkpoint through the wall in the occupied West Bank village of Hablah. Palestinians must pass through this checkpoint to reach their daily destinations. Complicated and constantly changing regulations, permits and militarization of checkpoints are part of Israel's \"bureaucratic maze\" policy, a crucial feature in the relentless repression of Palestinians.\n\nThe human rights organization Machsom Watch writes \"Israel’s policy of denying Palestinians their right to enter territories has become an instrument of controlling an entire population.\"",
        "timestamp": "2023-03-14 14:11:54"
    },
    {
        "message": "Happy birthday Albert Einstein! One of the most intelligent people in the world and, what is lesser known, a socialist!\n\nEinstein's most well-known work on socialism is his text \"Why Socialism?\" published in 1949. Einstein argued that capitalism, focusing on profit and competition, led to economic inequality, exploitation and conflicts between social classes.\n\nAt the height of U.S. anti-communist paranoia, the U.S. government suspected Einstein of being a communist spy, and former FBI director J. Edgar Hoover called him \"an extreme radical\". By the time of Einstein's death in 1955, the FBI had collected over 1,400 documents on his activities.\n\nEinstein fled Nazi Germany to the U.S. in 1933. Although he was subjected to intense surveillance and lived trough McCarthyism, he never backed down from his commitment to his revolutionary principles.",
        "timestamp": "2023-03-14 12:08:25"
    },
    {
        "message": "When Israelis protest the \"future of democracy\" but are fine with ethnic cleansing, occupation and apartheid. 🤷‍♀️",
        "timestamp": "2023-03-14 09:53:08"
    },
    {
        "message": "When famous British author, H.G. Wells, interviewed Soviet leader Joseph Stalin for the New Statesman magazine, American journalists were shocked. \n\nBut probably not for the reason you assume, listen to Izdihar explain ☝️",
        "timestamp": "2023-03-13 15:55:05"
    },
    {
        "message": "On the anniversary of Grenada's revolution, listen to its socialist leader, Maurice Bishop, breaking down why the United States saw it as a threat.\n\nUnder Bishop's premiership, the Grenadian government rolled out free public health care, reduced illiteracy, and fought for workers and women's rights while combating imperialism and the apartheid regime in South Africa.",
        "timestamp": "2023-03-13 13:55:05"
    },
    {
        "message": "Tupac read Stalin, have you?",
        "timestamp": "2023-03-13 12:22:47"
    },
    {
        "message": "Welcome to the red. Telegram channel! The owners of redfish have agreed to transfer this channel to our team. \n\nWe will bring you documentaries and news of people's struggles against capitalism, imperialism, discrimination, and racism from all around the world. \n\nStay tuned, and invite your friends!\n\nAlso, check out our new website and other social media channels.\n\n\nInstagram\nTikTok\nYouTube\nTwitter\nFacebook\nWebsite",
        "timestamp": "2023-03-13 12:13:53"
    }
]