[
    {
        "message": "🚨 A handful of Leftist Big Tech Overlords are deciding what ideas are acceptable & dictating what info spreads online. & now they're deciding who is allowed to make a living on the internet. Big Tech has become the single greatest threat to our freedoms.",
        "timestamp": "2019-07-10 18:21:21"
    },
    {
        "message": "What does it say about the Democrat field that arguably their largest donor is joining the race himself??? \nHe must not think much of their abilities.",
        "timestamp": "2019-07-09 22:22:34"
    },
    {
        "message": "MIRIAM ADELSON: A time of miracles | Las Vegas Review-Journal",
        "timestamp": "2019-07-07 23:44:04"
    },
    {
        "message": "Cliff Sims: Honest question:\n\nWhat’s the rational argument against asking about citizenship on the Census?\n\nCensus results determine the number of Representatives each state sends to Congress. \n\nWhy would non-citizens help determine representation in Congress when they can’t even vote?\n\n🤷🏼‍♂️",
        "timestamp": "2019-07-07 23:41:51"
    },
    {
        "message": "NEW: Trump Supporters Group 🇺🇸\n\nIt's the best Trump supporters group on Telegram!\n\nBe advised this group is for serious supporters of President Trump only. We have discussions, memes, AMAs, and more.\n\nJoin here:\nhttps://t.me/Trump_Supporters",
        "timestamp": "2019-07-07 03:00:27"
    },
    {
        "message": "Ari Fleischer: I don’t care what your politics are, this tribute to our military on America’s Independence Day is beautiful and inspiring.",
        "timestamp": "2019-07-05 15:48:20"
    },
    {
        "message": "A great crowd of tremendous Patriots this evening, all the way back to the Washington Monument! #SaluteToAmerica🇺🇸 https://t.co/nJghdfqIhX",
        "timestamp": "2019-07-05 15:46:06"
    },
    {
        "message": "Dear liberals,\n\nPlease stop attacking our men in MAGA hats.\n\nWe don’t attack your men in dresses.\n\nThank you.",
        "timestamp": "2019-07-05 00:26:51"
    },
    {
        "message": "Ryan Saavedra: Trump drives Democrats so insane that he is getting them to burn the American flag on the 4th of July — while he is running for re-election. \n\nHis best talent is getting his enemies to expose who they really are",
        "timestamp": "2019-07-03 23:12:45"
    },
    {
        "message": "Hahahahaha. So good and so true.",
        "timestamp": "2019-06-30 20:57:31"
    },
    {
        "message": "Twitter has announced they will begin hiding President Trump’s tweets so people can’t see them.\n\nThis is exactly what Laura Loomer told us would happen when she confronted Jack Dorsey in Congress last year.\n\nShe is still banned from social media.",
        "timestamp": "2019-06-30 20:54:33"
    },
    {
        "message": "Dear liberals,\n\nIf a million Russians came across our border to vote for Trump, would you still be okay with that?\n\nAsking for a buddy.",
        "timestamp": "2019-06-30 06:43:07"
    },
    {
        "message": "And I thought Hillary was bad the last time around! #DemocraticDebate",
        "timestamp": "2019-06-28 03:17:23"
    },
    {
        "message": "FLASHBACK: Barack Obama laments the \"problem\" of illegal immigration in a presidential debate \n#DemDebate2",
        "timestamp": "2019-06-28 02:53:42"
    },
    {
        "message": "They should be.\n\nOlivia Nuzzi: A source close to the Biden campaign tells me his staff is “freaking out” about his poor performance tonight.",
        "timestamp": "2019-06-28 02:48:26"
    },
    {
        "message": "Before Biden spent 40 years in The Swamp & made himself rich, they called him “Blue Collar Joe.” Now he stands on stage and threatens to rejoin the Paris Climate Accord that would crush the REAL blue collar workers who built (and are now rebuilding!) our Nation. SAD!",
        "timestamp": "2019-06-28 02:43:18"
    },
    {
        "message": "Dear #floppyJoe Obama didn’t get everyone to agree on climate change. The biggest offenders China and India got a 10 year free pass that would cost American workers trillions and they would never live up to it anyway.\n\nBut we all know why you’re protecting China $$$ #ChinaJoe",
        "timestamp": "2019-06-28 02:39:54"
    },
    {
        "message": "In all fairness to JFK with today’s dem platform he wouldn’t even be on the stage. \nThis isn’t your grandparents Democrat party. #DemocratDebates",
        "timestamp": "2019-06-28 02:39:11"
    },
    {
        "message": "Kamala Harris was for locking up non-violent offenders for a looooong time, before she was against it. Don’t be fooled, it took a Republican President to pass the FIRST STEP ACT!",
        "timestamp": "2019-06-28 02:39:00"
    },
    {
        "message": "If we are going to discuss California’s environmental issues let’s not forget feces... lots and lots of feces... everywhere #DemocratDebates",
        "timestamp": "2019-06-28 02:38:40"
    },
    {
        "message": "Joe Biden has been in government, at some of the highest positions for nearly half a CENTURY! Now he wants to fix Washington? He’s the problem!",
        "timestamp": "2019-06-28 02:38:17"
    },
    {
        "message": "That’s a first. Joe calls his own time being up... mostly because it seemed like he couldn’t remember where he was going. Amazing stuff. #demdebate2 #demdebate",
        "timestamp": "2019-06-28 02:37:43"
    },
    {
        "message": "Dan Crenshaw: You forgot the part where R’s asked for a vote on humanitarian aid 17 times before today.\n\n17 times.\n\nStop misleading people.",
        "timestamp": "2019-06-28 02:37:33"
    },
    {
        "message": "Who’s the biggest hypocrite? A socialist who makes millions through capitalism or a “government reformer” who’s never had a job outside of government? \nTough choice between Bernie and Biden on this one. #DemDebate2 #demdebate",
        "timestamp": "2019-06-28 02:36:38"
    },
    {
        "message": "Interesting that everyone is being very deferential to Obama on this. Let’s be clear where this started.",
        "timestamp": "2019-06-28 02:36:30"
    },
    {
        "message": "Lindsey Graham: The immigration debate is turning into complete slander against the brave men and women serving our nation on the border.  \n\nIt’s sad that the Mexican government is more willing to work with President Trump than the Democrats are.\n\n#DemocraticDebate",
        "timestamp": "2019-06-28 02:35:58"
    },
    {
        "message": "Weird I distinctly remember Senator Gillinrand coming through our offices pleading with my father for $$$. \nAt the same time she was tryin to sell me on how much she loved the Second Amendment to woo me. \n\nPoliticians gonna politician.",
        "timestamp": "2019-06-28 02:35:27"
    },
    {
        "message": "Canadian Socialized healthcare:\n\n1 million Canadians had to wait weeks for healthcare—the highest number ever recorded\n\nPatients forfeited $1,800 in lost wages by waiting for healthcare\n\nWait times increased 377% under socialized medicine\n\nThis is Bernie's healthcare plan\n\nShare!",
        "timestamp": "2019-06-28 02:35:11"
    },
    {
        "message": "OMG, I mean 11pm is really late and all... Good thing nothing happens in the middle of the night he may want to be up for. #Benghazi 🙄 #DemDebate2\n\nBiden’s Spox Says He’ll Be Too Tuckered Out After The Debate To Talk With Media - The Daily Caller",
        "timestamp": "2019-06-28 02:34:24"
    },
    {
        "message": "FACT CHECK: Harris LIES twice in first answer.\n\n90% of ALL AMERICANS got a tax cut under @trump.\n\nPaychecks rising faster for low/middle income Americans than high earners.",
        "timestamp": "2019-06-28 02:33:40"
    },
    {
        "message": "Who’s ready for the second night of the circus? It took a lot of practice to look that bad last night, I bet tonight will be even worse. #DemDebate",
        "timestamp": "2019-06-28 02:33:21"
    },
    {
        "message": "Is Joe Biden practicing his Spanish right now?",
        "timestamp": "2019-06-28 02:33:06"
    },
    {
        "message": "Get ready guys. It’s almost time. All aboard the crazy train. #demdebate #2",
        "timestamp": "2019-06-28 02:32:51"
    },
    {
        "message": "Comfortably Smug: If Biden were a Republican he'd be deplatformed by now, called a racist, mysoginist, problematic old white man trying to bring back segregation. \n\nBut he's a Dem, so instead, frontrunner!",
        "timestamp": "2019-06-27 19:34:47"
    },
    {
        "message": "t.me/CharlieKirk",
        "timestamp": "2019-06-27 15:20:27"
    },
    {
        "message": "I have a feeling that any world leader watching these people speaking right now is praying for a Democrat win in 2020. They know they would walk all over these clowns and therefore America.",
        "timestamp": "2019-06-27 02:57:35"
    },
    {
        "message": "@TrumpWarRoom: FACT: President Trump's administration launched a global campaign to decriminalize homosexuality and is promoting protections for #LGBT people in countries that persecute them. #DemDebate",
        "timestamp": "2019-06-27 02:57:08"
    },
    {
        "message": "@KamVTV: Hey Booker, President Trump was successful implementing prison reform that is  helping black Americans with the lack of effort put forth by former President Barack Obama.\n\nWhere were you at during Obamas presidency? \n\nAll talk no action at this Dem Debate.",
        "timestamp": "2019-06-27 02:33:29"
    },
    {
        "message": "Wow!!! Booker taking credit for first step act when @trump is the guy that made that an issue and got it done is pretty amazing. \n\nNice try though.",
        "timestamp": "2019-06-27 02:32:44"
    },
    {
        "message": "Leftist commentators are just like us.\n\nhttps://twitter.com/americarising/status/1144065120013836290?s=21",
        "timestamp": "2019-06-27 02:32:21"
    },
    {
        "message": "Wait until Warren starts speaking Cherokee.",
        "timestamp": "2019-06-27 02:04:42"
    },
    {
        "message": "RatiOH MY GOD!!! Aka... no one believes you.",
        "timestamp": "2019-06-27 00:51:31"
    },
    {
        "message": "Who wants to play a game?\n\nEach time a Democrat offers something for free or blames Trump for something, take a drink.\n\nCaution: One may suffer alcohol poisoning within the first ten minutes of the debate.\n\n#DemDebate",
        "timestamp": "2019-06-27 00:09:00"
    },
    {
        "message": "Rep. Dan Crenshaw goes off on Google rep over recent leaked emails calling @realBenShapiro @jordanpeterson and Dennis Prager \"Nazis using the dogwhistles\":\n\n\"What kind of education do people at Google have?...Three of three of these people had family members killed in the Holocaust.\"\n\nhttps://twitter.com/nateonthehill/status/1143949680088367105?s=21",
        "timestamp": "2019-06-26 21:03:34"
    },
    {
        "message": "NEW: Trump Supporters Group 🇺🇸\n\nIt's the forum of choice for The President of The United States, Donald Trump!\n\nBe advised this forum is for serious supporters of President Trump only. We have discussions, memes, AMAs, and more.\n\nJoin here:\nhttps://t.me/Trump_Supporters",
        "timestamp": "2019-06-26 19:53:58"
    },
    {
        "message": "Working on my summer dad bod with some new swag from the Trump store. Great stuff for you to work your dad or any other bod you may be working. Check it out TrumpStore.com #dadbod",
        "timestamp": "2019-06-26 19:07:38"
    },
    {
        "message": "Carpe Donktum: My home The_Donald on @reddit has been quarentined on the day of the first Democratic Debate... Coincidence?\n\nAbsolutely not.\n\nA community of over 700,000 Patriots..  suddenly silenced...",
        "timestamp": "2019-06-26 19:06:48"
    },
    {
        "message": "Jack Posobiec: This is what happens when you try to access Reddit’s r/The_Donald page",
        "timestamp": "2019-06-26 19:05:30"
    },
    {
        "message": "Watch til the end... 😂😂😂\n\nCNN Politics: WATCH: Attorney General William Barr plays the bagpipes at a Justice Department event",
        "timestamp": "2019-06-26 19:02:21"
    },
    {
        "message": "The radical left doesn’t just want to blacklist conservatives from having a voice on social media, they want to blacklist them financially too. \n\nFinancial Blacklisting: Sleeping Giants and Soros-Backed Group Pressure Mastercard to Censor the Right https://t.co/5s00nTzG90",
        "timestamp": "2019-06-26 15:16:27"
    },
    {
        "message": "REMINDER: Joe Biden publicly supported TPP and voted for NAFTA. “Middle-class” Joe spent his almost 50 years in Washington selling out America’s working-class to China...And he managed to make himself a millionaire in the process. https://t.co/wdDTm0CH6y",
        "timestamp": "2019-06-26 15:15:44"
    },
    {
        "message": "For the last 50 years our biggest net export has been The American Dream, but because of @trump we’ve brought that American Dream home, where it belongs. \n\nHe’s doing this for you, your children, and for your grandchildren.\nLet’s Keep America Great! #2020",
        "timestamp": "2019-06-26 15:15:09"
    },
    {
        "message": "Tim Pool: Google's Gennai made a classic PR blunder of responding immediately to breaking news. She didn't know what Veritas had.\n\nShe issued a statement and then a day later was contradicted with evidence from Veritas proving that Google staff recommend censoring based on politics.",
        "timestamp": "2019-06-26 07:32:15"
    },
    {
        "message": "This is what Instagram’s “unbiased algorithm” thinks a conservative following Politico wants to see? https://twitter.com/senronjohnson/status/1143569629350125568?s=21",
        "timestamp": "2019-06-26 07:18:05"
    },
    {
        "message": "Mexico doing more to protect America than democrats. The dems have lost their way... they are not your grandfather’s democrat party any longer and haven’t been for far too long.\n\nhttps://twitter.com/realsaavedra/status/1143282121743618048?s=21",
        "timestamp": "2019-06-24 23:06:19"
    },
    {
        "message": "This is really scary if you don’t think there’s bias coming from the social media masters watch this. \n\nIf we don’t act now it will only get worse. \n\nInsider Blows Whistle & Exec Reveals Google Plan to Prevent \"Trump situation\" in 2020 on Hidden Cam\n\nhttps://www.youtube.com/watch?v=re9Xp6cdkro",
        "timestamp": "2019-06-24 22:27:00"
    },
    {
        "message": "Exclusive: Mexican Officials Confirm U.S. Warned Them About Suspected ISIS Terrorists Headed to Border.\n\nhttps://t.co/GEh14VRkiC",
        "timestamp": "2019-06-24 20:08:23"
    },
    {
        "message": "WOW!!!\n\n👇\nhttps://twitter.com/realdsteinberg/status/1142645481643880448?s=21",
        "timestamp": "2019-06-23 20:52:43"
    },
    {
        "message": "OMG... and another. I guess he’s trying to prove my last tweet correct. You can’t make this up.\n\nhttps://twitter.com/realsaavedra/status/1142568941539094529?s=21",
        "timestamp": "2019-06-23 07:01:43"
    },
    {
        "message": "WTF, Again??? Does Joe Biden have a Democrat friend that wasn’t a segregationist? I mean it’s getting ridiculous. \n\nBiden References Another Former Segregationist While Campaigning\n\nhttps://t.co/FhCyd7r8iW",
        "timestamp": "2019-06-23 07:01:12"
    },
    {
        "message": "I wonder what Bernie Sanders and Elizabeth Warren think about Joe Biden’s long-history of trying to cut social security benefits for elderly Americans?\n\nhttps://twitter.com/donaldjtrumpjr/status/1142533975489110017?s=21",
        "timestamp": "2019-06-23 07:00:40"
    },
    {
        "message": "Ever wonder what it would look like for a presidential candidate to build their entire stump speech around Jeb! “please clap” style moments? Ladies and gentlemen, I present Eric Swalwell.\n\nhttps://twitter.com/daveweigel/status/1142253030945021952?s=21",
        "timestamp": "2019-06-23 06:59:46"
    },
    {
        "message": "You know the “I’d love to have a beer with that guy” scale so many politicians get measured by? I think it’s safe to say that exactly ZERO people would want to have one with Eric Swalwell.\n\nSwalwell Says He And Fellow Democrats Are Heroes Like The Avengers\n\nhttps://t.co/QJQuBUANWC",
        "timestamp": "2019-06-23 06:59:30"
    },
    {
        "message": "Hey AOC - guess who knows more about concentration camps than you? These Holocaust survivors. They have a message for you. Why don’t you listen - for once.\n\nGreat video by TPUSA\n\nShare this so media can’t ignore\n\nhttps://twitter.com/donaldjtrumpjr/status/1142476472340361223?s=21",
        "timestamp": "2019-06-23 06:59:06"
    },
    {
        "message": "So American taxpayers should just throw another 11,000,000 or more people into an already strained system and pay for it? What do you think that does to the system? What happens to the quality of care, that you pay for, for you and your kids? It gets worse I assure you.\n\nhttps://twitter.com/realsaavedra/status/1142125040525164544?s=21",
        "timestamp": "2019-06-23 06:58:19"
    },
    {
        "message": "Yea that’s the same?!? WTF? The clown show of freshman Dems in Congress is the best thing to ever happen to the GOP. No rational person can listen to them and not see that the Liberal Elite have lost their minds.\n\nhttps://twitter.com/calebjhull/status/1142155324138373130?s=21",
        "timestamp": "2019-06-23 06:57:48"
    },
    {
        "message": "'Good Morning America' Slams Biden For Dodging Nepotism Questions Over Ukraine, China Dealings | Zero Hedge\n\nhttps://t.co/tTD9dOPY5x",
        "timestamp": "2019-06-23 06:56:48"
    },
    {
        "message": "Burgess Owens Torches Democrats: Party Of ‘Slavery, KKK, Jim Crow, Killed Over 40% of Black Babies’ | Daily Wire\n\nhttps://t.co/T3qv3dwg9F",
        "timestamp": "2019-06-20 23:23:38"
    },
    {
        "message": "Just because Obama couldn’t get it done doesn’t make it impossible.\n\nHaving fun last night recalling Obama’s famous “there’s no magic wand for GDP growth above 1.5% Trump”\n\nWell abracadabra bud here’s 3.2% #yourewelcome\n\nhttps://twitter.com/donaldjtrumpjr/status/1141525160404705280?s=21",
        "timestamp": "2019-06-20 05:53:52"
    },
    {
        "message": "When you’re a lib and even the New York Times calls you out for stupidity.\n\nhttps://twitter.com/nytpolitics/status/1141195950230257664?s=21",
        "timestamp": "2019-06-19 21:21:13"
    },
    {
        "message": "Let's play a little role reversal: What do you think would be the media's reaction if Donald Trump Jr. took $1.50 from the Chinese — not $1.5 BILLION like Joe Biden's son — just 1.5 dollars?\n\nThey would lose their godd*mn minds!\n\nhttps://twitter.com/donaldjtrumpjr/status/1141361863940333568?s=21",
        "timestamp": "2019-06-19 21:14:02"
    },
    {
        "message": "Something tells me CNN and the rest of the main stream media will ignore this.\n\nhttps://twitter.com/calebjhull/status/1141380400893349889?s=21",
        "timestamp": "2019-06-19 19:25:35"
    },
    {
        "message": "Left Wing Media Hacks Rush To Defend AOC's Absurd Nazi Comparison\n\nhttps://t.co/QRkLnYAuXo",
        "timestamp": "2019-06-19 06:28:15"
    },
    {
        "message": "Great time on stage kicking off President Trump's 2020 run today in Orlando, Florida. This group is having more fun here than they would across town at Disney!!! 🤣🇺🇸🤣🇺🇸🤣 #maga #florida #fl #2020 #kag\n\nhttps://www.instagram.com/p/By3r6oQl4V6/?igshid=1nfkv09nv5xkf",
        "timestamp": "2019-06-19 05:42:35"
    },
    {
        "message": "NEW: Trump Supporters Group 🇺🇸\n\nIt's the forum of choice for The President of The United States, Donald Trump!\n\nBe advised this forum is for serious supporters of President Trump only. We have discussions, memes, AMAs, and more.\n\nJoin here:\nhttps://t.me/Trump_Supporters",
        "timestamp": "2019-06-19 05:09:52"
    },
    {
        "message": "This is how deranged the left is. Imagine trying to normalize this to a teen and even preteen audience!?! \n\nMaybe start with STEM before jumping to prostitution as a career choice for our young women. \n\nNothing is sacred to these sickos and they’re influencing our youth.\n\nhttps://twitter.com/teenvogue/status/1140372239537377280?s=21",
        "timestamp": "2019-06-18 16:08:26"
    },
    {
        "message": "Fact check: True... or at least that’s what I’m going with. 🤣🤣🤣\n\nDad bods are more attractive to women than rock hard abs: survey https://t.co/LeWuRonutt via New York Post",
        "timestamp": "2019-06-18 15:36:21"
    },
    {
        "message": "Democrats long for a country that will tolerate absolutely no dissent from their extremist socialist agenda and will do anything to ensure the people who voted for my father are unable to organize again.\n\nVote Trump -- The stakes in 2020 are too high!!!\n\nhttps://t.co/AgFsbO1DJ2",
        "timestamp": "2019-06-18 15:32:07"
    },
    {
        "message": "Peter Navarro: Trump‘s Tariffs Accomplished More in Two Days Than Congress in 20 Years\n\nhttps://t.co/vn5T1BhY9b",
        "timestamp": "2019-06-17 18:40:30"
    },
    {
        "message": "Happy fourth anniversary of getting into politics President Trump. #maga.\n\nhttps://twitter.com/danscavino/status/1140086060296355840?s=21",
        "timestamp": "2019-06-17 01:59:45"
    },
    {
        "message": "US Reliance On OPEC Oil Hits 30-Year Low - Thanks @realdonaldtrump 🇺🇸👍🇺🇸👍🇺🇸\n\nhttps://t.co/IaOjMBASie",
        "timestamp": "2019-06-14 07:16:25"
    },
    {
        "message": "Michael Avenatti is sued for allegedly siphoning paraplegic's $4 million settlement - Reuters\n\nhttps://t.co/WQulglXW2y",
        "timestamp": "2019-06-14 07:16:08"
    },
    {
        "message": "Talk about taking foreign help.\n\nHillary Clinton hired a foreign spy. He talked to Russians and put together an oppo research document. It wasn’t verified, but the FBI used it to spy on the Trump campaign.\n\nhttps://twitter.com/jim_jordan/status/1139208834814218240?s=21",
        "timestamp": "2019-06-14 07:15:41"
    },
    {
        "message": "Hold on a second. If a campaign staffer meets a foreign official affiliated with, say, the Israeli government, and that official relays information which reflects poorly on a rival campaign, we're now saying it's a crime to simply *listen* to that information? Are you nuts?\n\nhttps://twitter.com/mtracey/status/1139178495312048128?s=21",
        "timestamp": "2019-06-14 07:15:09"
    },
    {
        "message": "Socialism failed in: \n\n🇩🇪 East Germany\n\n☭ The Soviet Union\n\n🇰🇭 Cambodia \n\n🇨🇺 Cuba\n\n🇨🇳 China\n\n🇻🇳 Vietnam\n\n🇰🇵 North Korea\n\n🇪🇹 Ethiopia\n\n🇵🇱 Poland\n\n🇷🇴 Romania\n\n🇻🇪 Venezuela\n\nSo why does Bernie Sanders and AOC believe socialism will work in America? #DemocraticSocialism\n\nhttps://twitter.com/prageru/status/1138883930499584000?s=21",
        "timestamp": "2019-06-14 07:14:31"
    },
    {
        "message": "Very proud to have a President do what what he said he was going to do. For decades now Trump has been signaling the alarm against the hollowing out of America. Other countries have been “Dumping” and screwing over America for too long. Time to get tough! #maga #tbt\n\nhttps://twitter.com/donaldjtrumpjr/status/971870502204727298?s=21",
        "timestamp": "2019-06-14 07:11:27"
    },
    {
        "message": "I may not see eye to eye with Jon Stewart on politics, but I think he’s 100% right to fight for this very noble cause on behalf of some incredible Americans. Well done Jon.\n\nhttps://twitter.com/axios/status/1138897063708700674?s=21",
        "timestamp": "2019-06-12 22:49:52"
    },
    {
        "message": "https://t.me/CandaceOwens",
        "timestamp": "2019-06-12 20:24:23"
    },
    {
        "message": "Joe Biden: 'Politicians Can Take Away' First Amendment 'If We Want' \n\nDoes Joe Biden still think that politicians can take away your First Amendment rights if they want? Seems if you believe something that extreme you’re not likely changing your mind.\n\nhttps://t.co/yNcBwk2g7f",
        "timestamp": "2019-06-12 01:31:01"
    },
    {
        "message": "Biden listing all of the things that he hasn’t accomplished in his first HALF CENTURY (yes 50 years) as a DC politician but will somehow magically get done now is pretty much the definition of irony... and the swamp.",
        "timestamp": "2019-06-11 21:00:38"
    },
    {
        "message": "Wow. Biden sounds more like a dictator to me. A presidential candidate saying this should be a very big deal but I’m sure no one in the MSM will cover it. RT\n\nJoe Biden 1974: 'Politicians Can Take Away' First Amendment 'If We Want'\n\nhttps://t.co/lF7YSDrRm9",
        "timestamp": "2019-06-11 08:19:14"
    },
    {
        "message": "And the Democrats in Congress will still pretend there’s no crisis. What a disgrace. \n\nISIS plotted to send terrorists through US-Mexico border\n\nhttps://t.co/RDWTIgRazH",
        "timestamp": "2019-06-07 18:06:20"
    },
    {
        "message": "William Barr is asking questions the media don't want asked\n\nhttps://t.co/XsltvFlNJo",
        "timestamp": "2019-06-06 18:48:08"
    },
    {
        "message": "Who wants to bet he (or anyone else) won’t investigate???\n\nCummings' Wife Funneled Money From Charity To For-Profit Company, Financials Reveal | Zero Hedge\n\nhttps://t.co/33eS5rec6V",
        "timestamp": "2019-06-06 18:42:59"
    },
    {
        "message": "https://t.me/DBongino",
        "timestamp": "2019-06-06 07:00:39"
    },
    {
        "message": "Donald Trump Jr.: Biden ‘Incentivized’ to Dismiss China Threat Because ‘His Son Took $1.5 Billion' from China\n\nhttps://t.co/bCI99semcv",
        "timestamp": "2019-06-05 21:14:28"
    },
    {
        "message": "John Dowd Blasts Mueller Over Selective Quotes In Russia Report - The Daily Caller\n\nhttps://t.co/HpBYK0jVRi",
        "timestamp": "2019-06-05 00:47:03"
    },
    {
        "message": "Why Did The Obama Administration Ignore Reports Of Russian Meddling?\n\nhttps://t.co/YXAB0GQvsh",
        "timestamp": "2019-06-05 00:24:01"
    },
    {
        "message": "Buckingham Palace... an incredible experience with Her Majesty The Queen. Truly unforgettable. 🇺🇸🇬🇧🇺🇸🇬🇧🇺🇸",
        "timestamp": "2019-06-05 00:23:12"
    }
]