[
    {
        "message": "Golden Nugget's Parent Tries to Halt Proposed Deal, but SPAC Says No\n\nThe Fast Acquisition special-purpose-acquisition company rejected Fertitta Entertainment’s move, claiming the holding company didn’t meet a documents deadline.\n\n#Markets",
        "timestamp": "2021-12-03 01:29:47"
    },
    {
        "message": "Google Delays Required Office Return for Employees\n\nThe tech company will wait until next year to decide when its office-return plan will take effect, encouraging staff to come in as conditions allow.\n\n#Technology",
        "timestamp": "2021-12-03 01:29:43"
    },
    {
        "message": "Quarles Says Fed Will Need to Raise Rates to Cool Inflation\n\nThe Fed governor said it was time for the central bank to prepare to raise interest rates because inflation was likely to stay above the Fed’s 2% target for longer than anticipated.\n\n#US_business",
        "timestamp": "2021-12-03 01:28:51"
    },
    {
        "message": "Kroger's Modest Margins Could Become a Strength\n\nThe grocery chain, which reported better-than-expected quarterly results, continues to invest in price competitiveness, which could position it well going forward.\n\n#Markets",
        "timestamp": "2021-12-03 00:29:54"
    },
    {
        "message": "Notable & Quotable: School Money for Adults\n\n‘Spending on curriculum, textbooks, supplies and sundries is a small portion of school budgets.’\n\n#Opinion",
        "timestamp": "2021-12-03 00:29:52"
    },
    {
        "message": "Kroger Sales Rise as Consumers Stay Home to Eat\n\nThe grocer raised its full-year guidance, but said higher supply-chain costs are hurting its profit.\n\n#US_business",
        "timestamp": "2021-12-03 00:28:52"
    },
    {
        "message": "OPEC, Russia Agree to Keep Boosting Oil Output, Jolting Prices\n\nThe producers agreed to continue pumping more crude, sticking to a long-term plan despite new worries over demand raised by the Omicron coronavirus variant.\n\n#WorldNews",
        "timestamp": "2021-12-03 00:28:40"
    },
    {
        "message": "Whether Omicron Wreaks Havoc or Not, the U.S. Dollar Is a Buy\n\nThe greenback should do well if the economy shrugs off the new Covid-19 variant, or serve as a haven if it doesn’t.\n\n#Markets",
        "timestamp": "2021-12-02 23:29:57"
    },
    {
        "message": "FTC Challenges Nvidia's $40 Billion Deal for Arm Holdings\n\nThe Federal Trade Commission sues to block the U.S. chip supplier’s proposed takeover of the chip-design specialist, arguing the deal is anticompetitive.\n\n#Technology",
        "timestamp": "2021-12-02 23:29:47"
    },
    {
        "message": "Low Initial Jobless Claims Reflect Tight Labor Market\n\nInitial jobless claims, a proxy for layoffs, totaled a seasonally adjusted 222,000 last week, following the prior week’s report showing the lowest number in 52 years.\n\n#US_business",
        "timestamp": "2021-12-02 23:28:52"
    },
    {
        "message": "Credit-Card Applications Hit Pandemic High\n\nClose to 27% of U.S. consumers said in October that they had applied for a credit card in the past 12 months, the highest level since 2019.\n\n#Markets",
        "timestamp": "2021-12-02 22:29:59"
    },
    {
        "message": "U.S. to Lead Effort to Curb Authoritarians' Access to Surveillance Tools\n\nThe Biden administration said it would launch an initiative with friendly nations to coordinate export policies for technology that can be used to suppress human rights.\n\n#Technology",
        "timestamp": "2021-12-02 22:29:56"
    },
    {
        "message": "Glaxo Says Antibody Drug Is Likely Effective Against Omicron\n\nEarly laboratory studies suggest that the treatment is effective against the Omicron variant, setting it apart from similar therapies that appear to work less well against the strain.\n\n#US_business",
        "timestamp": "2021-12-02 22:28:53"
    },
    {
        "message": "The Pros and Cons of 'Direct Indexing'\n\nThe biggest advantage is that it increases the ability to offset gains with tax losses.\n\n#Markets",
        "timestamp": "2021-12-02 21:29:54"
    },
    {
        "message": "Wages Are Going Gangbusters in the U.S.---Elsewhere, Not So Much\n\nIt is a stark divergence as the global economy recovers from the Covid-19 pandemic, with implications for how quickly central banks tighten monetary policy in response to price pressures.\n\n#US_business",
        "timestamp": "2021-12-02 21:28:52"
    },
    {
        "message": "Scientists Studying Omicron See Rise in Covid-19 Reinfections\n\nScientists in South Africa tracking the spread of the variant are seeing a rise in coronavirus reinfections in people who had recovered from Covid-19, suggesting previous infection provides less protection against the new variant.\n\n#WorldNews",
        "timestamp": "2021-12-02 21:28:39"
    },
    {
        "message": "Vir Biotechnology, Digital World Acquisition, Apple: What to Watch in the Stock Market Today\n\nApple shares were ticking lower; Vir Biotechnology said its Covid-19 treatment had been successful in a study\n\n#Markets",
        "timestamp": "2021-12-02 20:29:59"
    },
    {
        "message": "Covid-19 and the Right to Travel\n\nBans and quarantines are constitutionally suspect when applied against U.S. citizens.\n\n#Opinion",
        "timestamp": "2021-12-02 20:29:55"
    },
    {
        "message": "David Steinberger-Led Group Buys Ebook Publisher Open Road\n\nThe parties declined to disclose terms of the deal, but a person familiar with the sale said Open Road, which had been primarily owned by a group of institutional investors, sold for between $60 million and $80 million.\n\n#US_business",
        "timestamp": "2021-12-02 20:28:51"
    },
    {
        "message": "Blinken Warns Russia's Lavrov Over Ukraine Buildup\n\nThe top U.S. diplomat warned his counterpart from Moscow of a strong reaction if it interferes further in Ukraine, showing friction over Russian troop deployments near the border.\n\n#WorldNews",
        "timestamp": "2021-12-02 20:28:40"
    },
    {
        "message": "Blackstone's Tony James to Retire\n\nHamilton “Tony” James, who helped transform Blackstone from a small private-equity shop into an investment giant with $731 billion in assets, is leaving the company in January.\n\n#Markets",
        "timestamp": "2021-12-02 19:29:59"
    },
    {
        "message": "What Jerome Powell Couldn't Say in His Speech, and Doesn't Know\n\nThe Fed chief sticks to untested new policy tools while inflation transforms the American economy.\n\n#Opinion",
        "timestamp": "2021-12-02 19:29:56"
    },
    {
        "message": "Holiday Crowds Flock Back to New York City\n\nThe rebound follows a surge in Covid-19 infections a year ago that kept many visitors away.\n\n#US_business",
        "timestamp": "2021-12-02 19:28:52"
    },
    {
        "message": "U.S. to Restart 'Remain in Mexico' Program for Asylum Seekers\n\nThe Biden administration’s agreement with Mexico allows the U.S. to resume a controversial Trump-era policy, but with some changes.\n\n#WorldNews",
        "timestamp": "2021-12-02 19:28:40"
    },
    {
        "message": "HSBC, Credit Suisse, Others Fined for 'Sterling Lads' Currency Cartel\n\nEU authorities fined four banks close to $400 million for manipulating the foreign-currency market by exchanging sensitive information and trading plans, including through an online chat room.\n\n#Markets",
        "timestamp": "2021-12-02 18:29:59"
    },
    {
        "message": "Businesses Offer Higher Wages, but Who Will Accept Them?\n\nLatest NFIB employment survey shows a continuing labor shortage.\n\n#Opinion",
        "timestamp": "2021-12-02 18:29:56"
    },
    {
        "message": "Smart Bandages, Vehicle-Damage Trackers and More Data-Collecting Devices of the Future\n\nStartups and scientists are developing next-generation sensors to gauge everything from disease detection to office use.\n\n#Technology",
        "timestamp": "2021-12-02 18:29:55"
    },
    {
        "message": "China Sets Boeing 737 MAX Directive for Flight Resumption\n\nThe Civil Aviation Administration of China ordered certain software installation and a revision of the flight manual, among other changes. It didn’t specify when China would allow the flights to resume.\n\n#US_business",
        "timestamp": "2021-12-02 18:28:52"
    },
    {
        "message": "Omicron Makes Foreign Travel a Risky Venture Again\n\nThe new coronavirus variant is triggering a fresh patchwork of travel restrictions around the world, throwing up new obstacles to overseas travel just as it was starting to bounce back from last year’s Covid-19 measures.\n\n#WorldNews",
        "timestamp": "2021-12-02 18:28:39"
    },
    {
        "message": "Apollo to Buy Griffin Capital Units\n\nThe deal will add about $5 billion of assets under management in products designed for individual investors.\n\n#Markets",
        "timestamp": "2021-12-02 17:29:59"
    },
    {
        "message": "Big Tech Privacy Moves Spur Companies to Amass Customer Data\n\nMarketers are staging sweepstakes, quizzes and events to gather people’s personal information and build detailed profiles—a response to Apple’s “opt in” policy for apps and Google’s plan to restrict user tracking in its browser.\n\n#Technology",
        "timestamp": "2021-12-02 17:29:55"
    },
    {
        "message": "The Scramble for EV Battery Metals Is Just Beginning\n\nGlobal miners have an opportunity to sell ESG-friendly natural resources to the automotive and energy industries, but it will require investment.\n\n#US_business",
        "timestamp": "2021-12-02 17:28:52"
    },
    {
        "message": "Turkey's Erdogan Names Loyalist as Finance Minister Amid Lira Rout\n\nThe incumbent at the finance ministry resigned after clashes with the longtime president’s unconventional economic policies that have intensified a currency crisis shaking the country.\n\n#WorldNews",
        "timestamp": "2021-12-02 17:28:40"
    },
    {
        "message": "As Covid-19 Drags On, Americans Hoard Cash\n\nThe lingering pandemic has made many people too nervous about potential worst-case scenarios to dip into their savings.\n\n#Markets",
        "timestamp": "2021-12-02 16:30:18"
    },
    {
        "message": "Metaverse Lures Investors\n\nExchange-traded funds have sprung up to cater to growing appetite for metaverse investments.\n\n#Technology",
        "timestamp": "2021-12-02 16:29:58"
    },
    {
        "message": "Green Power Purchases Shielded Some Companies From Energy Crunch\n\nMore companies have been locking in long-term supplies of renewable energy in recent years as a way to cut greenhouse-gas emissions. For some, the deals offered another benefit in 2021: protection from higher prices as a surge in demand scrambled energy markets.\n\n#US_business",
        "timestamp": "2021-12-02 16:28:52"
    },
    {
        "message": "U.S. to Restart 'Remain in Mexico' Program for Asylum Seekers\n\nThe Biden administration’s agreement with Mexico allows the U.S. to resume a controversial Trump-era policy, but with some changes.\n\n#WorldNews",
        "timestamp": "2021-12-02 16:28:39"
    },
    {
        "message": "Chips Stacked High at GlobalFoundries\n\nGlobalFoundries is one of the semiconductor space’s most richly valued companies, at nearly 78 times forward earnings, but a strong base of future business already in the books should help it grow into that valuation.\n\n#Markets",
        "timestamp": "2021-12-02 15:30:03"
    },
    {
        "message": "FAA Chief Steve Dickson Takes On Fight Over 5G and Aviation Safety\n\nThe cautious regulator is at odds with the telecom industry ahead of next month’s planned rollout of new wireless services.\n\n#Technology",
        "timestamp": "2021-12-02 15:29:57"
    },
    {
        "message": "FAA Chief Steve Dickson Takes On Fight Over 5G and Aviation Safety\n\nThe cautious regulator is at odds with the telecom industry ahead of next month’s planned rollout of new wireless services.\n\n#US_business",
        "timestamp": "2021-12-02 15:28:53"
    },
    {
        "message": "Foreign Travel Was Just Opening Up. Omicron Means It's a Minefield Again.\n\nThe new variant is triggering a fresh patchwork of national travel restrictions around the world, throwing up new obstacles to overseas travel just as it was starting to bounce back from last year’s Covid-19 measures.\n\n#WorldNews",
        "timestamp": "2021-12-02 15:28:41"
    },
    {
        "message": "The Scramble for EV Battery Metals Is Just Beginning\n\nGlobal miners have an opportunity to sell ESG-friendly natural resources to the automotive and energy industries, but it will require investment.\n\n#Markets",
        "timestamp": "2021-12-02 14:30:01"
    },
    {
        "message": "WeWork to Restate Results Due to Error With Its SPAC Acquirer\n\nWeWork said in a securities filing that it would restate several quarters of results, including its latest quarter’s, and that management has concluded there was a material weakness in its internal control.\n\n#US_business",
        "timestamp": "2021-12-02 14:28:52"
    },
    {
        "message": "China Protests 'Politicization of Sports'\n\nThe Women’s Tennis Association made good on threats to halt its events in the country amid concerns over the safety of star player Peng Shuai.\n\n#WorldNews",
        "timestamp": "2021-12-02 14:28:40"
    },
    {
        "message": "Renewable Natural Gas Firm Opal Fuels to Go Public in $2 Billion SPAC Merger\n\nOpal converts methane emissions from landfills and dairy farms into renewable natural-gas fuel for trucking customers like UPS. It is valued at $2 billion in its SPAC deal.\n\n#Markets",
        "timestamp": "2021-12-02 13:30:12"
    },
    {
        "message": "Macau Casinos Shut High-Roller Rooms Tied to Arrested Operator\n\nShares of casino operators tumbled on news of the suspension of Suncity VIP rooms, while the junket operator’s leader, Alvin Chau, resigned following his arrest on illegal gambling and money-laundering allegations.\n\n#US_business",
        "timestamp": "2021-12-02 13:28:52"
    },
    {
        "message": "Digital Yuan Faces Obstacles in Winning Hearts and Minds\n\nBeijing has convinced financial policy makers everywhere of its resolve to create a digital version of its currency. The challenge is getting consumers interested.\n\n#WorldNews",
        "timestamp": "2021-12-02 13:28:39"
    },
    {
        "message": "Bond Investors Bet on Low Peak Interest Rates\n\nYields on government debt indicate the central bank won’t raise short-term rates above 2%, suggesting to some investors either economic weakness or market complacency.\n\n#Markets",
        "timestamp": "2021-12-02 12:30:00"
    },
    {
        "message": "Digital Yuan Faces Obstacles in Winning Hearts and Minds\n\nBeijing has convinced financial policy makers everywhere of its resolve to create a digital version of its currency. The challenge is getting consumers interested.\n\n#Technology",
        "timestamp": "2021-12-02 12:29:56"
    },
    {
        "message": "Chris Cuomo Addresses CNN Suspension, Saying 'It Hurts'\n\nThe news anchor says he respects the process under way at the cable news network during his Sirius XM radio show.\n\n#US_business",
        "timestamp": "2021-12-02 12:28:52"
    },
    {
        "message": "Australia Adopts Magnitsky Sanctions Rules\n\nAustralia’s new rules will allow it to target people and entities allegedly engaged in malicious cyberactivity and corruption with sanctions, including asset freezes and travel bans.\n\n#WorldNews",
        "timestamp": "2021-12-02 12:28:40"
    },
    {
        "message": "What Is Cryptocurrency, and How Does It Work?\n\nNeed to Know: We answer some commonly asked questions about this hot, but little understood, asset.\n\n#Markets",
        "timestamp": "2021-12-02 11:30:15"
    },
    {
        "message": "Snowflake Revenue More Than Doubles\n\nThe Montana-based company, which went public last year and has yet to reach profitability, posted revenue of $334.4 million to generate a net loss of $154.9 million.\n\n#US_business",
        "timestamp": "2021-12-02 11:28:52"
    },
    {
        "message": "Turkey's Erdogan Names Loyalist as Finance Minister Amid Lira Rout\n\nThe incumbent at the finance ministry resigned after clashes with the longtime president’s unconventional economic policies that have intensified a currency crisis shaking the country.\n\n#WorldNews",
        "timestamp": "2021-12-02 11:28:40"
    },
    {
        "message": "Stock Futures Rise on Latest Omicron Comments\n\nU.S. stock futures rose as investors digested the latest headlines on the Omicron variant ahead of fresh data on the labor market.\n\n#Markets",
        "timestamp": "2021-12-02 10:30:01"
    },
    {
        "message": "Disney Elects Susan Arnold as Board Chairman, Replacing Robert Iger\n\nDisney is turning to an executive with extensive experience, but she will lead a board that has had to weather an unprecedented period of turmoil in recent years.\n\n#US_business",
        "timestamp": "2021-12-02 10:28:52"
    },
    {
        "message": "U.S. and South Korea to Update Wartime Plans for North Korea\n\nIn recent months, the Kim Jong Un regime has unleashed smaller-range weapons tests, including new submarine-launched ballistic missile technology and a weapon fired from a train.\n\n#WorldNews",
        "timestamp": "2021-12-02 10:28:40"
    },
    {
        "message": "Stock Futures Gain Amid Omicron Volatility\n\nU.S. stock futures edged up in an extension of the week’s volatile trading as investors grappled with uncertainty surrounding the Omicron variant of Covid-19.\n\n#Markets",
        "timestamp": "2021-12-02 09:30:02"
    },
    {
        "message": "Square Changes Its Name to Block\n\nThe name change comes shortly after the company’s CEO, Jack Dorsey, stepped down at Twitter and aligns with his interest in bitcoin and blockchain.\n\n#US_business",
        "timestamp": "2021-12-02 09:28:51"
    },
    {
        "message": "Five Publishers Sue Shopify Over 'Textbook Pirates'\n\nPublishers say e-commerce company should be responsible for policing its customers, while Shopify says it takes actions against sellers that violate its policies.\n\n#US_business",
        "timestamp": "2021-12-02 08:28:51"
    },
    {
        "message": "WeWork to Restate Results Due to Error With Its SPAC Acquirer\n\nWeWork said in a securities filing that it would restate several quarters of results, including its latest quarter’s, and that management has concluded there was a material weakness in its internal control.\n\n#Technology",
        "timestamp": "2021-12-02 07:29:49"
    },
    {
        "message": "Big Tech's Liability Shield Is Under Siege\n\nHouse lawmakers are moving ahead with legislation making internet platforms more accountable to online users, in what is expected to be a showdown between Washington and Silicon Valley.\n\n#US_business",
        "timestamp": "2021-12-02 07:28:51"
    },
    {
        "message": "Supply Imbalances Continued to Hold Back U.S. Growth This Fall, Fed's Beige Book Says\n\nBusinesses report “persistent difficulty in hiring and retaining employees” as labor shortage continued.\n\n#US_business",
        "timestamp": "2021-12-02 06:28:52"
    },
    {
        "message": "Macau Casinos Shut High-Roller Rooms Tied to Arrested Operator\n\nShares of casino operators tumbled on news of the suspension of Suncity VIP rooms, while the junket operator’s leader, Alvin Chau, resigned following his arrest on illegal gambling and money-laundering allegations.\n\n#Markets",
        "timestamp": "2021-12-02 05:29:54"
    },
    {
        "message": "Yellen Defends Spending Plans Amid Growing Angst Over Higher Inflation\n\nThe Treasury secretary and Federal Reserve chief Jerome Powell address lawmakers’ concerns in a second day of testimony.\n\n#US_business",
        "timestamp": "2021-12-02 05:28:52"
    },
    {
        "message": "Match Group Settles Lawsuit Over Tinder's Valuation\n\nThe company said it would pay $441 million to plaintiffs, including Tinder’s co-founders, who had alleged that Match undervalued the dating app to cheat them out of billions of dollars.\n\n#US_business",
        "timestamp": "2021-12-02 04:28:53"
    },
    {
        "message": "Is Inflation Sticking Around? Bicycle Makers Offer Some Clues\n\nManufacturers are pricing next year’s bikes now, and higher costs for components and supply-chain holdups, combined with still-strong demand, mean increases are coming.\n\n#US_business",
        "timestamp": "2021-12-02 04:28:52"
    },
    {
        "message": "Nuclear-Fusion Startup Lands $1.8 Billion as Investors Chase Star Power\n\nCommonwealth Fusion Systems has raised more than $1.8 billion from the likes of Bill Gates and George Soros as startups join the quest to generate carbon-free energy like the sun.\n\n#US_business",
        "timestamp": "2021-12-02 04:28:52"
    },
    {
        "message": "Racy Affair Saga Between Bezos and Enquirer Reaches Final Chapter\n\nInvestigations by federal officials on phone-hack and extortion claims haven’t led to public action. The government’s response marks a quiet end to a bizarre saga that captivated the business and media worlds.\n\n#US_business",
        "timestamp": "2021-12-02 04:28:52"
    },
    {
        "message": "Omicron Could Widen Blue-Red Economic Divide\n\nIf the new Covid-19 variant fuels a full-blown wave of the disease, red states will likely lose more lives, while blue states will lose more jobs.\n\n#US_business",
        "timestamp": "2021-12-02 04:28:52"
    },
    {
        "message": "Covid-19 Cases Nearly Double in South Africa as Omicron Reaches More Countries\n\nThere are signs the Omicron variant is more transmissible, as well as hints that vaccines help in subduing severe symptoms.\n\n#WorldNews",
        "timestamp": "2021-12-02 04:28:41"
    },
    {
        "message": "The Secret Power of Reconnecting With Old Friends\n\nThere’s a special boost that only old friends can give us. Here’s why we need it now.\n\n#Lifestyle",
        "timestamp": "2021-12-02 04:28:08"
    },
    {
        "message": "Toxic Positivity Is Very Real, and Very Annoying\n\nForcing ourselves or others to always be positive can be harmful to our well-being and our relationships. There’s a better approach.\n\n#Lifestyle",
        "timestamp": "2021-12-02 04:28:08"
    },
    {
        "message": "Daylight-Saving Time Ends Sunday. Four Ways to Win the Transition.\n\nThe fall back of the clock is coming. Those seeking to renew routines or become morning people can take advantage of the time switch.\n\n#Lifestyle",
        "timestamp": "2021-12-02 04:28:08"
    },
    {
        "message": "10 Haunted House Ideas to Make Your Home Extra Spooky This Halloween\n\nOne-up your neighbors’ yard displays with these pro ideas—from customizable headstones to computer-animated eyes. Plus a jack o’lantern that outshines them all.\n\n#Lifestyle",
        "timestamp": "2021-12-02 04:28:08"
    },
    {
        "message": "Capital One Is Latest Bank to Ditch Overdraft Fees\n\nThe lender will stop charging $35 for overdrafts and nonsufficient funds early next year.\n\n#Markets",
        "timestamp": "2021-12-02 04:27:57"
    },
    {
        "message": "Stocks Fall as Omicron Fuels More Volatility\n\nU.S. stocks fell in a choppy trading session, dragged down by news that the first known case of the Omicron variant was identified in the U.S.\n\n#Markets",
        "timestamp": "2021-12-02 04:27:57"
    },
    {
        "message": "With Higher Rates on the Horizon, Some Pandemic-Favorite Stocks Are Suffering\n\nThe prospect of higher interest rates is diminishing investors’ appetite for riskier corners of the stock market, with stocks including Snap, Zoom and Peloton having slid in recent months.\n\n#Markets",
        "timestamp": "2021-12-02 04:27:57"
    },
    {
        "message": "Pelosi and Florida\n\nWhenever it’s time to hand over the gavel, why not head to the Sunshine State?\n\n#Opinion",
        "timestamp": "2021-12-02 04:27:50"
    },
    {
        "message": "Deterring Russia in Ukraine\n\nVladimir Putin is probing to see if the U.S. really would push back.\n\n#Opinion",
        "timestamp": "2021-12-02 04:27:49"
    },
    {
        "message": "Justice Sotomayor Gets Political on Abortion\n\nShe loses her cool during the Supreme Court’s oral argument.\n\n#Opinion",
        "timestamp": "2021-12-02 04:27:49"
    },
    {
        "message": "The Pentagon's Bureaucratic Posture Review\n\nA 10-month study reflects little strategic urgency about growing global threats.\n\n#Opinion",
        "timestamp": "2021-12-02 04:27:49"
    },
    {
        "message": "Advantage, Women's Tennis Association\n\nThe WTA announces it is suspending all tournaments in China.\n\n#Opinion",
        "timestamp": "2021-12-02 04:27:49"
    },
    {
        "message": "Snowflake Revenue More Than Doubles\n\nThe Montana-based company, which went public last year and has yet to reach profitability, posted revenue of $334.4 million to generate a net loss of $154.9 million.\n\n#Technology",
        "timestamp": "2021-12-02 04:27:16"
    },
    {
        "message": "Square Changes Its Name to Block\n\nThe name change comes shortly after the company’s CEO, Jack Dorsey, stepped down at Twitter and aligns with his interest in bitcoin and blockchain.\n\n#Technology",
        "timestamp": "2021-12-02 04:27:16"
    },
    {
        "message": "Big Tech's Liability Shield Is Under Siege\n\nHouse lawmakers are moving ahead with legislation making internet platforms more accountable to online users, in what is expected to be a showdown between Washington and Silicon Valley.\n\n#Technology",
        "timestamp": "2021-12-02 04:27:15"
    },
    {
        "message": "Match Group Settles Lawsuit Over Tinder's Valuation\n\nThe company said it would pay $441 million to plaintiffs, including Tinder’s co-founders, who had alleged that Match undervalued the dating app to cheat them out of billions of dollars.\n\n#Technology",
        "timestamp": "2021-12-02 04:27:15"
    },
    {
        "message": "Nuclear-Fusion Startup Lands $1.8 Billion as Investors Chase Star Power\n\nCommonwealth Fusion Systems has raised more than $1.8 billion from the likes of Bill Gates and George Soros as startups join the quest to generate carbon-free energy like the sun.\n\n#Technology",
        "timestamp": "2021-12-02 04:27:15"
    },
    {
        "message": "For Big Miners, U.S. Workers Are Most Reluctant to Get Vaccinated\n\nMining companies operate in some of the least developed countries on the planet, but it is in the world’s richest nation where they are finding it hardest to persuade staff to get inoculated.\n\n#US_business",
        "timestamp": "2021-12-02 04:26:04"
    },
    {
        "message": "Global Inflation Set to Be Higher for Longer, Says OECD\n\nThe pickup in inflation rates around the world will be longer-lasting and sharper than previously anticipated, with a growing risk that households and businesses grow accustomed to faster price rises, the research group said in its latest forecasts.\n\n#US_business",
        "timestamp": "2021-12-02 04:26:04"
    },
    {
        "message": "Credit-Card Applications Hit Pandemic High\n\nClose to 27% of U.S. consumers said in October that they had applied for a credit card in the past 12 months, the highest level since 2019.\n\n#US_business",
        "timestamp": "2021-12-02 04:26:04"
    },
    {
        "message": "Not Sure How Much You Should Be Paid? Colorado Could Offer Some Clues\n\nThe Wall Street Journal sifted through more than 5,000 job openings at some of the biggest employers in the state that requires Amazon, Palantir, Walmart and others to disclose expected pay ranges.\n\n#US_business",
        "timestamp": "2021-12-02 04:26:03"
    },
    {
        "message": "Some Professional Degrees Leave Students With High Debt, Not High Salaries\n\nDegrees in dentistry and veterinary medicine are increasingly leaving many students with ruinous debt, threatening the industries in which they hoped to provide a public service, a WSJ data analysis found.\n\n#US_business",
        "timestamp": "2021-12-02 04:26:03"
    },
    {
        "message": "Russia Expels U.S. Diplomats in Latest Tit-for-Tat Action\n\nRussia ordered U.S. Embassy staff who have been in Moscow for more than three years to leave the country by Jan. 31, in the latest round of tit-for-tat expulsions between Washington and Moscow.\n\n#WorldNews",
        "timestamp": "2021-12-02 04:25:11"
    },
    {
        "message": "Afghan Journalists in Exile Keep Spotlight on Their Homeland\n\nFree media was a major achievement of Western efforts in Afghanistan. Now, it struggles for survival under Taliban intimidation.\n\n#WorldNews",
        "timestamp": "2021-12-02 04:25:10"
    },
    {
        "message": "World War II Bomb Explodes in Munich, Injuring Four\n\nThe bomb, dropped from an aircraft more than 70 years ago, exploded during construction works near the city’s main train station.\n\n#WorldNews",
        "timestamp": "2021-12-02 04:25:10"
    },
    {
        "message": "Turkish Central Bank Props Up Collapsing Lira\n\nThe central bank sold foreign reserves after the lira reached new lows following comments by President Recep Tayyip Erdogan in defense of his unorthodox economic policies.\n\n#WorldNews",
        "timestamp": "2021-12-02 04:25:10"
    },
    {
        "message": "Global Inflation Set to Be Higher for Longer, Says OECD\n\nThe pickup in inflation rates around the world will be longer-lasting and sharper than previously anticipated, with a growing risk that households and businesses grow accustomed to faster price rises, the research group said in its latest forecasts.\n\n#WorldNews",
        "timestamp": "2021-12-02 04:25:10"
    }
]