[
    {
        "message": "https://www.youtube.com/watch?v=Yoj8Sleb9XQ",
        "timestamp": "2024-03-09 04:50:05+00:00"
    },
    {
        "message": "The US has sent Israel more than 100 arms shipments since October 7, to bomb Gaza. Polls show 52% of North Americans and 62% of Democrats oppose these weapons sales. \n\nThe only political group that supports giving weapons to Israel is Donald Trump voters.\n\nBiden is defying the Democratic Party’s base, while allying with Trump and the Republicans.\n\nhttps://geopoliticaleconomy.com/2024/03/08/us-israel-100-arms-sales-oppose-biden/",
        "timestamp": "2024-03-09 04:48:21+00:00"
    },
    {
        "message": "The European Union’s top diplomat, Josep Borrell, admitted that the “era of Western dominance has indeed definitively ended”.\n\nHe warned that the EU must not divide the world into “the West against the Rest”, as “many in the ‘Global South’ accuse us of ‘double standards’”.\n\nhttps://geopoliticaleconomy.com/2024/02/26/western-dominance-ended-eu-josep-borrell/",
        "timestamp": "2024-03-04 14:53:33+00:00"
    },
    {
        "message": "The Financial Times reported back in December that Israel had turned Gaza into one of the most heavily bombed areas in history.\n\nThe destruction has only gotten significantly worse since then.\n\nhttps://geopoliticaleconomy.com/2023/12/07/gaza-most-heavily-bombed-area-history/",
        "timestamp": "2024-02-23 03:49:42+00:00"
    },
    {
        "message": "The US used its veto power to block a fourth UN Security Council resolution that called for a humanitarian ceasefire in Gaza.\n\nThe Biden administration keeps sending weapons to Israel, helping it violate an ICJ ruling that says Netanyahu must respect the Genocide Convention and stop killing Palestinians. \n\nhttps://geopoliticaleconomy.com/2024/02/21/us-veto-un-resolution-gaza-israel-hague-genocide/",
        "timestamp": "2024-02-23 03:37:09+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=JzEc5GbSbIU",
        "timestamp": "2024-02-10 16:21:18+00:00"
    },
    {
        "message": "Russia’s President Vladimir Putin condemned the “boogeyman” anti-China propaganda that Trump ally Tucker Carlson spewed in his interview in Moscow, while mocking the ex Fox News host for applying to join the CIA.\n\nhttps://geopoliticaleconomy.com/2024/02/10/putin-tucker-carlson-china-cia/",
        "timestamp": "2024-02-10 16:21:13+00:00"
    },
    {
        "message": "Numerous reports in major media outlets have documented how the US government has used the Drug Enforcement Administration (DEA) in order to spy on and try to destabilize left-wing governments in Latin America.\n\nDEA meddling schemes have targeted Venezuela’s President Nicolás Maduro, Bolivia’s President Evo Morales, and Mexico’s President Andrés Manuel López Obrador (AMLO).\n\nIn these scandals, the DEA has collaborated with known criminals, including drug traffickers and money launderers, to launch sting operations against leftist politicians.\n\nhttps://geopoliticaleconomy.com/2024/02/05/us-dea-spy-venezuela-mexico-bolivia/",
        "timestamp": "2024-02-06 05:11:06+00:00"
    },
    {
        "message": "China’s state-led development model and industrial policy has transformed it into what an EU think tank calls “the world’s sole manufacturing superpower”.\n\nChina makes up 35% of global gross production – more than the 9 next largest manufacturers combined.\n\nhttps://geopoliticaleconomy.com/2024/01/31/china-world-manufacturing-superpower-production/",
        "timestamp": "2024-01-31 14:46:48+00:00"
    },
    {
        "message": "The historic decision by the UN’s International Court of Justice (ICJ) that Israel may be violating the genocide convention is a victory for the Palestinian people, and Global South as a whole.\n\nWe explain why:\n\nhttps://geopoliticaleconomy.com/2024/01/27/icj-israel-genocide-palestinians/",
        "timestamp": "2024-01-28 12:42:29+00:00"
    },
    {
        "message": "Israel rapidly losing support worldwide, poll shows, facing genocide charges at Hague\n\nhttps://www.youtube.com/watch?v=nMRBYzNtUcU",
        "timestamp": "2024-01-25 11:20:43+00:00"
    },
    {
        "message": "The US military is attacking Yemen, Iraq, and Syria, while Israel bombs Gaza, Lebanon, and Syria. Both are threatening Iran. Is a large Middle East (West Asia) war coming?\n\nWe analyzed the dangerous situation:\n\nhttps://geopoliticaleconomy.com/2024/01/18/war-us-israel-yemen-iraq-syria-iran/",
        "timestamp": "2024-01-21 11:38:31+00:00"
    },
    {
        "message": "To provide a detailed geopolitical analysis of why Washington so strongly supports Israel, and why it's a key part of the US empire, we interviewed economist Michael Hudson.\n\nYou can find a transcript, video, and podcast version of our conversation here:\n\nhttps://geopoliticaleconomy.com/2023/11/12/why-us-support-israel-geopolitics-michael-hudson/",
        "timestamp": "2023-11-13 12:21:41+00:00"
    },
    {
        "message": "The US vetoed Gaza ceasefire proposals at the UN Security Council, while sending Israel more weapons.\n\nUN experts warn that Israel is carrying out ethnic cleansing of Palestinians.\n\nAn Israeli scholar of the Holocaust says Israel is guilty of genocide.\n\nhttps://geopoliticaleconomy.com/2023/10/22/us-peace-gaza-israel-genocide/",
        "timestamp": "2023-10-23 11:05:26+00:00"
    },
    {
        "message": "Economist Michael Hudson explains how BRICS+ could create a mutual settlement currency for payment imbalances and build an alternative to the financialized neoliberal model of the dollar/NATO bloc:\n\nhttps://geopoliticaleconomy.com/2023/10/10/brics-bank-currency-economist-michael-hudson/",
        "timestamp": "2023-10-12 01:57:40+00:00"
    },
    {
        "message": "Poverty in one of the world's oldest colonies is getting worse:\n\nIn Puerto Rico, 41.7% of people, including 57.6% of children, live in poverty.\n\nThis is nearly 4 times the US rate.\n\nAnd Puerto Rican workers are getting poorer even while unemployment falls.\n\nhttps://geopoliticaleconomy.com/2023/09/26/poverty-puerto-rico-children-poor-families/",
        "timestamp": "2023-09-27 02:30:39+00:00"
    },
    {
        "message": "The Pentagon has admitted that a Chinese balloon that crossed into US territory in February was not spying; it was likely accidentally blown off course by wind.\n\nBut Washington and the media milked this manufactured scandal for new cold war propaganda.\n\nhttps://geopoliticaleconomy.com/2023/09/20/chinese-balloon-not-spying-us-admits/",
        "timestamp": "2023-09-21 10:14:33+00:00"
    },
    {
        "message": "The Western media mostly ignored it, but Global South countries making up 80% of the world population just held the G77+China summit in Cuba.\n\nThey made a powerful call to transform the \"unfair international economic order\".\n\nhttps://www.youtube.com/watch?v=A4I5bLlip5Y",
        "timestamp": "2023-09-18 11:38:33+00:00"
    },
    {
        "message": "On September 11, 1973, the CIA sponsored a coup that overthrew copper-rich Chile's democratically elected socialist President Salvador Allende and imposed a fascist military dictatorship led by General Augusto Pinochet. \n\nIn this video, we review the historical evidence: \n\nhttps://youtu.be/mkB08AKNjQ0?si=jxFl9G5OU6cIRKb7",
        "timestamp": "2023-09-11 16:25:25+00:00"
    },
    {
        "message": "Western sanctions are failing, even backfiring:\n\nThe EU is importing Russian liquified natural gas at record levels, despite pledging to boycott its energy.\n\nChina is making advanced chips and strengthening tech sovereignty, despite US export restrictions.\n\nhttps://geopoliticaleconomy.com/2023/09/05/sanctions-eu-russia-gas-china-tech/",
        "timestamp": "2023-09-09 00:20:44+00:00"
    },
    {
        "message": "As part of negotiations for Saudi Arabia to recognize Israel, the United States is demanding that Riyadh keep pricing its oil in dollars, not China’s renminbi.\n\nThe petrodollar system has been a key pillar holding up the hegemony of the US currency.\n https://geopoliticaleconomy.com/2023/08/10/us-saudi-arabia-sell-oil-dollars-chinese-yuan/",
        "timestamp": "2023-08-10 18:59:06+00:00"
    },
    {
        "message": "The US and France have threatened intervention to re-install a pro-Western regime in Niger, which produces uranium needed for nuclear energy, has gold and untapped oil reserves, and hosts strategic US drone bases. \n\nThis follows coups led by nationalist, anti-colonial military officers in West Africa.\n\nhttps://geopoliticaleconomy.com/2023/08/05/us-france-intervention-niger-west-africa/",
        "timestamp": "2023-08-06 01:05:04+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=Hqe3IQQo_t4",
        "timestamp": "2023-05-26 17:18:36+00:00"
    },
    {
        "message": "We interviewed economist Michael Hudson about his fascinating new book showing the origins of Western debt-based societies in the oligarchic systems of Greece and Rome.\n\nThis reality has for centuries been misrepresented by biased Eurocentric historians:\n\nhttps://geopoliticaleconomy.com/2023/05/24/debt-michael-hudson-oligarchies-greece-rome/",
        "timestamp": "2023-05-26 17:18:28+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=owjYEjib23M",
        "timestamp": "2023-05-25 17:54:00+00:00"
    },
    {
        "message": "Wars the US waged in Iraq, Afghanistan, Syria, Yemen, and Pakistan following September 11, 2001 caused at least 4.5 million deaths and displaced 38 to 60 million people, with 7.6 million children starving today, according to studies by Brown University.\n\nhttps://geopoliticaleconomy.com/2023/05/18/us-911-wars-million-deaths-displace/",
        "timestamp": "2023-05-25 17:53:51+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=iFxiuqE_wy8",
        "timestamp": "2023-05-10 19:49:20+00:00"
    },
    {
        "message": "Mexico’s President AMLO sent Joe Biden a letter condemning US “interventionism”, such as USAID funding of right-wing opposition groups that are trying to destabilize his elected government.\n\nhttps://geopoliticaleconomy.com/2023/05/04/mexico-amlo-biden-letter-us-intervention/",
        "timestamp": "2023-05-10 19:49:10+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=g9qjnl6jcx0",
        "timestamp": "2023-05-10 19:27:20+00:00"
    },
    {
        "message": "Economist Michael Hudson responds to the misleading arguments against de-dollarization that New York Times columnist Paul Krugman made in his attempt to defend US hegemony and the dollar system.\n\nhttps://geopoliticaleconomy.com/2023/05/10/ny-times-dedollarization-michael-hudson-paul-krugman-dollar/",
        "timestamp": "2023-05-10 19:27:09+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=ImjdVxd09fo",
        "timestamp": "2023-05-06 16:44:47+00:00"
    },
    {
        "message": "Economist Michael Hudson joined us to discuss the collapse of four US banks in two months, giant JP Morgan Chase taking over First Republic Bank, and how regulators – and the government itself – are in bed with the bankers.\n\nhttps://geopoliticaleconomy.com/2023/05/05/first-republic-bank-crisis-michael-hudson/",
        "timestamp": "2023-05-06 16:44:14+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=Yuy6UvRbjNU",
        "timestamp": "2023-05-01 01:27:28+00:00"
    },
    {
        "message": "The EU sanctioned Russia and boycotted its oil, yet is still buying it indirectly from India, at a higher price. \n\nThis is fueling both de-dollarization and inflation in the Eurozone, where workers' real wages dropped 6.5% from 2020 to 2022.\n\nhttps://geopoliticaleconomy.com/2023/04/30/europe-russia-oil-india-wages/",
        "timestamp": "2023-05-01 01:27:05+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=LXXk0e-nbvg",
        "timestamp": "2023-04-28 19:27:12+00:00"
    },
    {
        "message": "As Ukraine sells off state assets in a privatization spree, US fossil fuel corporations like ExxonMobil, Chevron, and Halliburton are in talks to run its oil and gas industry, and the IMF is imposing structural adjustment.\n\nhttps://geopoliticaleconomy.com/2023/04/28/us-corporations-ukraine-oil-gas/",
        "timestamp": "2023-04-28 19:26:58+00:00"
    },
    {
        "message": "European Central Bank President Christine Lagarde acknowledged “the tectonic plates of geopolitics are shifting faster” and “we may see the world becoming more multipolar”, with the decline of US dollar hegemony, war in Ukraine, and rise of China.\n\nhttps://geopoliticaleconomy.com/2023/04/19/world-multipolar-hegemony-ecb-lagarde/",
        "timestamp": "2023-04-22 17:29:20+00:00"
    },
    {
        "message": "The president of the European Central Bank, Christine Lagarde, gave a speech acknowledging that \"the tectonic plates of geopolitics are shifting faster\" and \"we may see the world becoming more multipolar\", with the crisis of imperialism, decline of dollar hegemony, and rise of China.\n\nWe were joined by geopolitical economist Radhika Desai to discuss the massive changes happening in this increasingly multipolar world:\n\nhttps://www.youtube.com/watch?v=0cQak6RWT6o",
        "timestamp": "2023-04-19 19:02:57+00:00"
    },
    {
        "message": "A polling firm found that Peru’s coup-plotting, right-wing-controlled congress has just 6% approval and 91% disapproval. \n\nUnelected leader Dina Boluarte has only 15% approval and 78% disapproval. \n\nBut they have the full support of the US, Canada, and foreign mining corporations.\n\nhttps://geopoliticaleconomy.com/2023/04/16/peru-coup-congress-approval-us/",
        "timestamp": "2023-04-16 19:04:02+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=yQJYevxPcYc",
        "timestamp": "2023-04-15 19:04:53+00:00"
    },
    {
        "message": "Brazilian President Lula da Silva took a historic trip to China, where he signed many cooperation agreements and pledged to challenge US dollar dominance.\n\nLula also called to strengthen the BRICS bloc and its New Development Bank:\n\nhttps://geopoliticaleconomy.com/2023/04/15/brazil-lula-china-us-dollar-dominance/",
        "timestamp": "2023-04-15 19:04:31+00:00"
    },
    {
        "message": "Before it collapsed and its billionaire depositors were bailed out by the US government, Silicon Valley Bank successfully lobbied Congress to remove regulations on it.\n\nA senator admitted, “I understand why Americans are angry, even disgusted”.\nhttps://geopoliticaleconomy.com/2023/04/09/silicon-valley-bank-bailout-billionaires-corruption/",
        "timestamp": "2023-04-09 21:14:33+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=kz5UmwhQuiU",
        "timestamp": "2023-04-06 15:18:56+00:00"
    },
    {
        "message": "The global de-dollarization campaign is gaining momentum, as countries around the world seek alternatives to the hegemony of the US dollar.\n\nChina, Russia, Brazil, ASEAN nations, Kenya, even Saudi Arabia and the UAE are now using local currencies in trade:\n\nhttps://geopoliticaleconomy.com/2023/04/06/dedollarization-china-russia-brazil-asean/",
        "timestamp": "2023-04-06 15:18:37+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=OK9F27WIcec",
        "timestamp": "2023-04-04 02:08:09+00:00"
    },
    {
        "message": "The Joe Biden administration invited numerous authoritarian far-right leaders to the US State Department’s so-called “Summit for Democracy”, including Israel’s Benjamin Netanyahu, Poland’s Andrzej Duda, India’s Narendra Modi, Italy’s Giorgia Meloni, and Pakistan’s coup regime (not to mention Zelensky's extremely undemocratic Ukraine).\n\nWashington's goal was clear: to organize US allies and client states into a bloc in order to wage a new cold war on China and Russia.\n\nhttps://geopoliticaleconomy.com/2023/04/01/us-authoritarian-summit-for-democracy/",
        "timestamp": "2023-04-04 02:07:41+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=y1je89h1eIg",
        "timestamp": "2023-03-30 21:14:13+00:00"
    },
    {
        "message": "Economists Radhika Desai and Michael Hudson discuss the US banking crisis and the effective privatization of the Treasury in this episode of their program Geopolitical Economy Hour: \n\nhttps://geopoliticaleconomy.com/2023/03/25/banks-treasury-crisis-radhika-desai-michael-hudson/",
        "timestamp": "2023-03-30 21:14:05+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=haVpdVyOtKs",
        "timestamp": "2023-03-30 16:48:20+00:00"
    },
    {
        "message": "The US government imposed sanctions on the International Criminal Court, threatened to arrest judges, and passed a “Hague Invasion Act”. \n\nPreviously, the ICC only prosecuted Africans. But now that it wants to arrest Russian President Putin, Washington praises the court (while still refusing to join it).\n\nhttps://geopoliticaleconomy.com/2023/03/29/us-invade-icc-putin/",
        "timestamp": "2023-03-30 16:48:14+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=OddmSjjLgLY",
        "timestamp": "2023-03-26 00:19:04+00:00"
    },
    {
        "message": "China’s President Xi Jinping traveled to Russia to meet Vladimir Putin, pledging “changes the likes of which we haven’t seen for 100 years”.\n\nThey agreed to deepen economic integration and challenge the hegemony of the US dollar, using yuan and other currencies in international trade.\n\nhttps://geopoliticaleconomy.com/2023/03/25/china-russia-xi-putin-dollar-economy/",
        "timestamp": "2023-03-26 00:18:57+00:00"
    },
    {
        "message": "The US Federal Reserve printed $300 billion in one week to save collapsing banks and bail out wealthy Silicon Valley oligarchs. \n\n93% of Silicon Valley Bank's deposits were uninsured, over the FDIC limit of $250,000, but the government still paid them. \n\n56% of SVB's loans went to vulture capitalist and private equity firms, enriching Wall Street as well.\n\nWe explain in this video:\n\nhttps://www.youtube.com/watch?v=jyrj7gZwg3U",
        "timestamp": "2023-03-19 15:43:56+00:00"
    },
    {
        "message": "Economist Michael Hudson analyzes the collapse of Silicon Valley Bank, Silvergate, and Signature Bank, explaining the similarities to the 2008 financial crash.\n\nHe also addresses the US government bailout (which it isn’t calling a bailout), the role of the Federal Reserve and Treasury, the factor of cryptocurrency, and the danger of derivatives:\n\nhttps://geopoliticaleconomy.com/2023/03/14/us-banks-collapsed-economist-michael-hudson/",
        "timestamp": "2023-03-15 19:52:04+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=uvm9qrXhqf8",
        "timestamp": "2023-03-15 19:51:40+00:00"
    },
    {
        "message": "Economist Michael Hudson argues banks like Silicon Valley Bank have behaved in a selfish and greedy way, but get de facto US government bailouts.\n\nMeanwhile, regulatory capture and campaign contributions prevent the systemic change needed to stop these crises.\n\nhttps://geopoliticaleconomy.com/2023/03/13/michael-hudson-us-bank-crisis/",
        "timestamp": "2023-03-14 15:57:41+00:00"
    },
    {
        "message": "China sponsored peace talks that led Saudi Arabia and Iran to normalize diplomatic relations, in a big blow to the petrodollar. Both countries are major oil producers that have applied to join BRICS and are discussing selling energy in other currencies.\n\nhttps://www.youtube.com/watch?v=DyAFerEouN0",
        "timestamp": "2023-03-12 21:33:52+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=Fbx5iLjSGsI",
        "timestamp": "2023-03-09 18:00:39+00:00"
    },
    {
        "message": "Responding to State Department criticism of Mexico’s popular electoral reform, President AMLO denounced US “meddling”, support for coups, and the Monroe Doctrine. \n\nHe said, “There is more democracy today in Mexico than in the United States… because here the people govern, and there the oligarchy govern”.\n\nhttps://geopoliticaleconomy.com/2023/03/08/amlo-mexico-democratic-oligarch-us-meddling",
        "timestamp": "2023-03-09 18:00:27+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=q3q7p_IElpY",
        "timestamp": "2023-02-27 15:36:22+00:00"
    },
    {
        "message": "Economists Radhika Desai and Michael Hudson explain the end of the British empire’s sterling area with the rise of the US dollar system, its central role in imperialism, and why it ultimately failed to maintain hegemony.\n\nVideo, podcast, and transcript here:\n\nhttps://geopoliticaleconomy.com/2023/02/26/us-dollar-imperialism-radhika-desai-michael-hudson/",
        "timestamp": "2023-02-27 15:36:09+00:00"
    },
    {
        "message": "Malaysia’s longest-serving Prime Minister Mahathir Mohamad said “the present war between Ukraine and Russia is caused by the Europeans’ love of war, of hegemony, of dominance”. \n\nHe warned it “can be interpreted as the start of the Third World War”.\n\nhttps://geopoliticaleconomy.com/2023/02/25/ukraine-europe-love-war-hegemony-malaysia/",
        "timestamp": "2023-02-25 20:01:46+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=HTiBksEHGrU",
        "timestamp": "2023-02-25 14:17:31+00:00"
    },
    {
        "message": "China’s Foreign Ministry published a lengthy report condemning “US hegemony” and its crimes around the world, including wars with millions of victims, coups and “regime change” against elected leaders, and 400 foreign military interventions.\n\nhttps://geopoliticaleconomy.com/2023/02/22/china-report-us-hegemony-wars-coups-intervention/",
        "timestamp": "2023-02-25 14:17:19+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=NYn0ODIL0Qg",
        "timestamp": "2023-02-25 14:16:52+00:00"
    },
    {
        "message": "In this interview, German Member of Parliament Sevim Dağdelen, of the Left Party, Die Linke, condemned the NATO “proxy war” in Ukraine, saying EU members are acting as US “vassal states”. \n\nShe also denounced the destruction of the Nord Stream pipelines as a “terrorist attack” that “should have resulted in a huge outcry”.\n\nhttps://geopoliticaleconomy.com/2023/02/22/germany-ukraine-nord-stream-sevim-dagdelen/",
        "timestamp": "2023-02-22 15:20:03+00:00"
    },
    {
        "message": "US officials admitted the Chinese balloon they shot down on February 4 had likely been blown off course by unexpected weather.\n\nThe US Air Force later spent $2 million using missiles to blow up a $12 hobbyist balloon.\nhttps://geopoliticaleconomy.com/2023/02/18/us-weather-chinese-balloon-hobbyist/",
        "timestamp": "2023-02-21 20:05:52+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=UXjDazqxAPo",
        "timestamp": "2023-02-20 20:10:06+00:00"
    },
    {
        "message": "The foreign ministers of the United States, Germany, and Ukraine have told the world, “Neutrality is not an option”, and “you can’t be neutral” in NATO’s proxy war with Russia, recalling President George W. Bush’s infamous declaration, “You are either with us, or against us”.\n\nIn doing so, these Western officials were condescendingly criticizing the Global South, representing 87% of the world's population, which has maintained strict neutrality over the war.\n\nhttps://geopoliticaleconomy.com/2023/02/20/west-global-south-neutral-ukraine/",
        "timestamp": "2023-02-20 20:09:56+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=Hp2Z24V8oFM",
        "timestamp": "2023-02-17 17:18:27+00:00"
    },
    {
        "message": "President Andrés Manuel López Obrador announced Mexico will lead an international movement to end the US government’s “inhumane” blockade against Cuba. \n\nPraising Fidel Castro as a “visionary”, AMLO denounced neoliberalism and pledged support for universal public healthcare and education.\n\nhttps://geopoliticaleconomy.com/2023/02/13/mexico-amlo-blockade-cuba-neoliberalism/",
        "timestamp": "2023-02-17 17:18:13+00:00"
    },
    {
        "message": "A decade of proxy war and illegal US and EU sanctions have devastated Syria, and blocked some humanitarian aid after a crushing earthquake killed thousands of people. \n\nTo save face, Washington agreed to a temporary suspension, but UN experts have demanded a permanent end to the “suffocating” sanctions, saying they “may amount to crimes against humanity”.\n\nhttps://www.youtube.com/watch?v=mtiNw3PxRyY",
        "timestamp": "2023-02-12 13:46:08+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=bZ5VLdqac-0",
        "timestamp": "2023-02-09 20:51:57+00:00"
    },
    {
        "message": "Pulitzer Prize-winning journalist Seymour Hersh reported the US government destroyed the Nord Stream pipelines that delivered Russian gas to Germany. The Biden administration approved the CIA operation, which used explosives and Navy divers, with help from NATO member Norway.\n\nhttps://geopoliticaleconomy.com/2023/02/08/us-nord-stream-pipelines-seymour-hersh/",
        "timestamp": "2023-02-09 20:51:43+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=yohXMsuxzDA",
        "timestamp": "2023-02-04 13:43:10+00:00"
    },
    {
        "message": "Greece’s former Finance Minister Yanis Varoufakis explained the US system of “neo-imperialism” based on the dollar, an “IOU issued by the hegemon”, which finances a huge trade deficit by letting foreign capitalists “extract colossal surplus value from their workers and then stash it away in America’s rentier economy”.\n\nhttps://geopoliticaleconomy.com/2023/02/03/us-imperialism-dollar-hegemony-yanis-varoufakis/",
        "timestamp": "2023-02-04 13:42:29+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=ZhZbB0jjDTM",
        "timestamp": "2023-01-28 13:58:33+00:00"
    },
    {
        "message": "What is inflation? What causes it? What are the problems in how the Federal Reserve and other central banks respond to it? \n\nEconomists Radhika Desai and Michael Hudson explain in this episode of Geopolitical Economy Hour.\n\nHere you can find a video, podcast, and full transcript:\n\nhttps://geopoliticaleconomy.com/2023/01/27/inflation-economists-radhika-desai-michael-hudson/",
        "timestamp": "2023-01-28 13:58:22+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=LYkQO5fOXH8",
        "timestamp": "2023-01-26 00:46:26+00:00"
    },
    {
        "message": "In a video address to a US corporate lobby group, Ukrainian leader Volodymyr Zelensky thanked companies like Black Rock, JP Morgan, Goldman Sachs, and Starlink, insisting “everyone can become a big business by” investing in Ukraine, where “we are defending freedom and property”.\n\nUkraine's NATO-backed government has imposed some of the world’s most aggressive anti-worker policies, banning collective bargaining rights and basically making it illegal to form a union, while letting corporations force any conditions they want on employees.\n\nMeanwhile, Zelensky is quite literally selling Ukraine to Wall Street.\n\nhttps://geopoliticaleconomy.com/2023/01/25/ukraines-zelensky-thanks-us-corporations-big-business/",
        "timestamp": "2023-01-26 00:46:10+00:00"
    },
    {
        "message": "It's happening: Brazil and Argentina are making plans for a Latin American currency called the Sur, to “boost regional trade and reduce reliance on the US dollar”, the Financial Times reported.\n\nLula had pledged this while running for president in 2022. He hasn't wasted any time since returning to office on January 1.\n\nThe CELAC summit will discuss the new currency in Buenos Aires this week.\n\nArgentina has applied to join the extended BRICS+ bloc, with Brazil, Russia, India, China, and South Africa. \n\nAs former president, Lula was himself a co-founder of the BRICS.\n\nhttps://geopoliticaleconomy.com/2023/01/22/brazil-argentina-latin-american-currency-dollar/",
        "timestamp": "2023-01-22 19:28:09+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=WNR_CI2U__w",
        "timestamp": "2023-01-19 23:26:25+00:00"
    },
    {
        "message": "Peru has large reserves of copper, gold, zinc, silver, lead, iron, and natural gas.\n\nAfter a coup overthrew left-wing President Pedro Castillo, the US ambassador, CIA veteran Lisa Kenna, met with mining and energy ministers to discuss “investments”. \n\nEurope is importing Peruvian LNG to replace Russian energy.\n\nGiven that Peru is the planet’s second-biggest copper producer (after its neighbor Chile), it will become increasingly important in the global shift toward renewable energy technologies.\n\nGoldman Sachs stated in 2022 that “copper is the new oil”, adding that \"copper sits at the heart of\" renewables.\n\nhttps://geopoliticaleconomy.com/2023/01/19/peru-resources-mining-gas-investment/",
        "timestamp": "2023-01-19 23:26:11+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=3YL_iAA06nY",
        "timestamp": "2023-01-18 13:45:08+00:00"
    },
    {
        "message": "In 2020 and 2021, the wealthiest 1% of the world’s population took nearly two-thirds of all new wealth – six times greater than the wealth made by the poorest 90% of workers. \n\nYet while billionaires get richer, global poverty is increasing.\n\nhttps://geopoliticaleconomy.com/2023/01/17/rich-global-wealth-inequality-oxfam/",
        "timestamp": "2023-01-18 13:44:52+00:00"
    },
    {
        "message": "While the US and NATO wage a proxy war against Russia in Ukraine, military strategists and pundits in Washington have set their sights on China.\n\nDanny Haiphong went through the growing evidence showing that the US military is preparing for war with China:\n\nhttps://geopoliticaleconomy.com/2023/01/16/us-preparing-war-china/",
        "timestamp": "2023-01-17 16:51:48+00:00"
    },
    {
        "message": "Economists Radhika Desai and Michael Hudson had a wide-ranging discussion about multipolarity, the decline of US hegemony, financial parasitism, deindustrialization, de-dollarization, China's economic model, and much more.\n\nThe full transcript is here (along with a video and podcast):\n\nhttps://geopoliticaleconomy.com/2023/01/13/radhika-desai-michael-hudson-multipolarity/",
        "timestamp": "2023-01-14 16:04:50+00:00"
    },
    {
        "message": "You can download a free podcast version of Radhika Desai and Michael Hudson's show Geopolitical Economy Hour at any major podcasting platform\n\nSoundcloud: https://soundcloud.com/geopoliticaleconomy/radhika-desai-michael-hudson-multipolarity\n\nSpotify: https://open.spotify.com/episode/5QvaWE9coakMERRmzaNjTh\n\nApple Podcasts: https://podcasts.apple.com/us/podcast/economists-radhika-desai-michael-hudson-explain-multipolarity/id1621947548?i=1000594344484",
        "timestamp": "2023-01-13 17:51:09+00:00"
    },
    {
        "message": "Economists Radhika Desai and Michael Hudson just launched their show Geopolitical Economy Hour, which we will be publishing every two weeks.\n\nThey introduce the program analyzing the rise of the multipolar world and the decline of US hegemony:\n\nhttps://www.youtube.com/watch?v=6adqdNCSVhU",
        "timestamp": "2023-01-13 17:50:10+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=bdASCjEeJ0I",
        "timestamp": "2023-01-11 23:18:30+00:00"
    },
    {
        "message": "Advancing global de-dollarization, China’s central bank is boosting its gold reserves while signing currency swap deals in yuan with countries like Argentina, encouraging the use of renminbi instead of US dollars.\n\nhttps://geopoliticaleconomy.com/2023/01/08/china-dollar-gold-reserves-argentina-yuan/",
        "timestamp": "2023-01-11 23:18:16+00:00"
    },
    {
        "message": "We are excited to announce the creation of the independent media outlet Geopolitical Economy Report – an evolution and expansion of Multipolarista.\n\nOur team will be growing, and we have exciting new projects planned, including a regular show with economists Radhika Desai and Michael Hudson.\n\nEditor-in-chief Ben Norton explains the changes (and the continuity) in the video and podcast below:\n\nhttps://geopoliticaleconomy.com/2023/01/07/introducing-geopolitical-economy-report-multipolarista/",
        "timestamp": "2023-01-09 00:56:25+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=QDdmbPni6BI",
        "timestamp": "2023-01-05 16:07:28+00:00"
    },
    {
        "message": "The USA has rapidly become the world's top exporter of liquefied natural gas (LNG), tied with Qatar. Europe replaced Asia as the top market for US LNG in 2022, after pledging to boycott Russian energy over the proxy war in Ukraine.\n\nEurope is now paying significantly more for expensive US LNG than it had been for Russian pipeline gas. As of 2022, Europe had the highest energy prices on the planet, fueling an inflation crisis.\n\nhttps://multipolarista.com/2023/01/04/us-lng-exporter-europe-russia-gas/",
        "timestamp": "2023-01-05 16:07:17+00:00"
    },
    {
        "message": "Russia is dropping the US dollar for the Chinese yuan – and fast\n\nhttps://www.youtube.com/watch?v=ffFseEPa62M",
        "timestamp": "2022-12-26 23:33:03+00:00"
    },
    {
        "message": "In response to Western sanctions, Russia’s central bank is dropping the US dollar and will buy Chinese yuan on the foreign exchange market. \n\nThe yuan’s share of Moscow’s currency trading increased from 1% to 40-45% in 2022, while dollar trade halved from 80% to 40%.\n\nhttps://multipolarista.com/2022/12/26/russia-us-dollar-chinese-yuan/",
        "timestamp": "2022-12-26 23:32:11+00:00"
    },
    {
        "message": "At least 14 countries in Latin America and the Caribbean have condemned the coup in Peru, backing President Pedro Castillo. \n\nThe unelected regime, which has killed dozens of protesters, has the staunch support of the US and the region’s right wing.\n\nhttps://multipolarista.com/2022/12/20/latin-america-rejects-coup-peru/",
        "timestamp": "2022-12-21 21:51:38+00:00"
    },
    {
        "message": "The International People’s Tribunal on US Imperialism explains how US, EU, and UN sanctions are a means of controlling Global South sovereignty and blocking the emergence of a multipolar world, to maintain the neocolonial capitalist order:\n\nhttps://multipolarista.com/2022/12/21/sanctions-weapon-imperialism-global-south/",
        "timestamp": "2022-12-21 21:51:20+00:00"
    },
    {
        "message": "Colombia’s President Gustavo Petro denounced the overthrow of Peru’s Pedro Castillo as a “parliamentary coup.” \n\nHe says it is a warning for all democratically elected left-wing leaders in Latin America: “What they can’t win at the ballot box, they are trying to topple”\n\nhttps://multipolarista.com/2022/12/19/colombia-petro-coup-peru-castillo/",
        "timestamp": "2022-12-19 15:08:22+00:00"
    },
    {
        "message": "Peru has had 7 presidents in just over 6 years, due to the undemocratic constitution inherited created by far-right US-backed dictator Alberto Fujimori. \n\nThis timeline explains how and why each head of state rose and fell so quickly:\n\nhttps://multipolarista.com/2022/12/17/peru-7-presidents-6-years-fujimori-constitution/",
        "timestamp": "2022-12-17 22:33:36+00:00"
    },
    {
        "message": "The Bolivarian Alliance (ALBA) uniting countries in Latin America and the Caribbean met for its 18th annual summit.\n\nThey condemned the US-backed coup d’etat in Peru against constitutional President Pedro Castillo.\n\nThey denounced the “unsubstantiated judicial processes (lawfare)” in Argentina against Cristina Fernández de Kirchner.\n\nALBA also called for reparations for slavery for the Caribbean, and urged solidarity with Haiti.\n\nhttps://multipolarista.com/2022/12/15/alba-peru-castillo-coup-argentina-kirchner/",
        "timestamp": "2022-12-16 15:59:25+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=QhVdgvgCBtA",
        "timestamp": "2022-12-16 01:23:29+00:00"
    },
    {
        "message": "The US ambassador in Peru, Lisa Kenna, worked for the CIA for 9 years, as well as the Pentagon. \n\nA day before the coup against democratically elected left-wing President Pedro Castillo, Kenna met with Peru’s defense minister.\n\nHe then ordered the military to turn against Castillo, who was promptly overthrown and imprisoned, without trial.\n\nhttps://multipolarista.com/2022/12/14/coup-us-ambassador-peru-cia/",
        "timestamp": "2022-12-15 17:41:40+00:00"
    },
    {
        "message": "Mexico, Argentina, Colombia, and Bolivia released a joint statement supporting Peru’s elected President Pedro Castillo, saying he is the victim of “anti-democratic harassment,” following a US-backed right-wing coup.\n\nhttps://multipolarista.com/2022/12/13/mexico-argentina-bolivia-colombia-peru-castillo-coup/",
        "timestamp": "2022-12-13 22:00:31+00:00"
    },
    {
        "message": "Honduras stressed its “energetic condemnation of the coup d’etat” in Peru, saying elected President Castillo represents “the sovereign will of the people”\n\nHonduras was also victim of a US-sponsored coup in 2009. It didn't restore democracy until late 2021\n\nhttps://multipolarista.com/2022/12/13/honduras-coup-peru-pedro-castillo/",
        "timestamp": "2022-12-13 16:15:23+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=ek2evCbKYKU",
        "timestamp": "2022-12-12 14:45:11+00:00"
    },
    {
        "message": "Peru’s democratically elected left-wing President Pedro Castillo was overthrown and arrested in a coup led by the right-wing-controlled congress, which has an approval rating of between 7% and 11%.\n\nThe US government has, naturally, been openly supporting the coup.\n\nWe interviewed a Peruvian activist about the protests going on across the country calling for a new constitution and demanding that Castillo be freed from prison:\n\nhttps://multipolarista.com/2022/12/10/peru-coup-president-pedro-castillo/",
        "timestamp": "2022-12-12 14:43:32+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=cPLLuBUAhRk",
        "timestamp": "2022-12-07 15:36:22+00:00"
    },
    {
        "message": "Latin America’s leftist presidents are leading the campaign to free Julian Assange. \n\nThe imprisoned WikiLeaks journalist has the public support of:\n-Brazil’s Lula da Silva\n-Mexico’s Andrés Manuel López Obrador\n-Argentina’s Cristina Fernández de Kirchner\n-Colombia’s Gustavo Petro\n-Venezuela’s Nicolás Maduro\n-Nicaragua’s Daniel Ortega\n-Bolivia’s Evo Morales\n-Honduras’ Manuel Zelaya\n-Paraguay's Fernando Lugo\n-and of course Ecuador's Andrés Arauz and Rafael Correa, who gave Assange asylum in the first place\n\nhttps://multipolarista.com/2022/12/06/free-julian-assange-latin-america-left-leaders/",
        "timestamp": "2022-12-07 15:36:03+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=4acHVf_rnJ8",
        "timestamp": "2022-12-02 19:56:14+00:00"
    },
    {
        "message": "Advising Brazil’s President-elect Lula, Ecuadorian economist and leftist presidential candidate Andrés Arauz made a blueprint for a “new regional financial architecture” to unite Latin America, including an international currency to challenge the hegemony of the US dollar and IMF.\n\nhttps://multipolarista.com/2022/12/01/latin-america-us-dollar-currency/",
        "timestamp": "2022-12-02 19:55:40+00:00"
    },
    {
        "message": "https://multipolarista.com/2022/11/28/europe-us-profits-ukraine-war-economy/",
        "timestamp": "2022-11-30 15:33:01+00:00"
    },
    {
        "message": "EU leaders are angry that the US is making lots of money from the proxy war in Ukraine, selling weapons and exporting expensive natural gas\n\nMeanwhile European industries are being destroyed as high energy prices and US subsidies push its companies to leave\n\nhttps://www.youtube.com/watch?v=N3wWaoOtVZI",
        "timestamp": "2022-11-30 15:32:51+00:00"
    },
    {
        "message": "German military preparing for potential war with Russia, leaked internal report reveals\n\nProminent German newspaper Der Spiegel obtained the secret document, but did not translate its bombshell story into English. We provide the documentation here:\n\nhttps://multipolarista.com/2022/11/24/germany-military-war-russia/",
        "timestamp": "2022-11-25 15:41:07+00:00"
    },
    {
        "message": "A leaked confidential strategy paper shows Germany is preparing for a potential war with Russia, as it boosts its budget and plans to become the world’s third-biggest military spender\n\nhttps://www.youtube.com/watch?v=toyPvPg7Yaw",
        "timestamp": "2022-11-25 15:40:42+00:00"
    },
    {
        "message": "The International Monetary Fund (IMF) has said a “wave of debt crises” may be coming in the Global South, and “the global economy is headed for stormy waters,” as the world faces a “geopolitical realignment” that will be “permanent.”\n\nThe US-dominated financial institution warned “the worst is yet to come,” as the depreciation of most currencies against the dollar and rising interest rates make it hard for both governments and companies to service their dollar-denominated debt.\n\nhttps://multipolarista.com/2022/11/13/imf-debt-crises-global-south-interest-dollar/",
        "timestamp": "2022-11-17 18:18:54+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=CisOeTjZrfgv",
        "timestamp": "2022-11-13 18:47:37+00:00"
    },
    {
        "message": "The United Nations special rapporteur said “outrageous” Western sanctions on Syria are “suffocating” millions of civilians and “may amount to crimes against humanity.” \n\nProxy war caused the country’s economy to shrink by 90%. Nine in 10 Syrians live in poverty.\n\nhttps://multipolarista.com/2022/11/12/un-expert-western-sanctions-syria/",
        "timestamp": "2022-11-13 18:47:28+00:00"
    },
    {
        "message": "Corruption exposed: US meddled in Ecuador's election, using Julian Assange as bargaining chip\n\nWe explained the outrageous scandal in this video. It should be getting much more media coverage, but of course is being overlooked:\n\nhttps://www.youtube.com/watch?v=SASR9NXIQpU",
        "timestamp": "2022-11-11 20:14:16+00:00"
    },
    {
        "message": "This is a huge scandal that should be getting much more media attention: \n\nA former minister of Ecuador testified that the US government conspired with a right-wing political party to run a disinformation campaign against the leftist Correísta movement, backing a millionaire banker's candidacy for president in exchange for the promise to betray journalist Julian Assange, who had been given asylum in the Ecuadorian embassy.\n\nhttps://multipolarista.com/2022/11/11/capaya-us-meddled-ecuador-election-assange/",
        "timestamp": "2022-11-11 20:10:49+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=ONakKTA87Bs",
        "timestamp": "2022-11-10 21:12:35+00:00"
    },
    {
        "message": "After years backing a failed coup attempt, France’s Emmanuel Macron, US climate envoy John Kerry, and Portugal’s PM met with Venezuela’s elected President Nicolás Maduro at the UN COP27 conference. \n\nDesperate to lower oil prices, they dropped the pretense that Juan Guaidó controls anything.\n\nhttps://multipolarista.com/2022/11/09/macron-kerry-venezuela-maduro-oil/",
        "timestamp": "2022-11-10 21:12:30+00:00"
    },
    {
        "message": "First Washington supported a soft coup against Pakistan's Prime Minister Imran Khan. Then the unelected regime banned his speeches, charged him with \"terrorism,\" and banned him from politics. \n\nNow a failed assassination attempt may be the straw that breaks the camel's back.\n\nPakistani scholar Junaid S. Ahmad explains the extraordinary situation in the country:\n\nhttps://multipolarista.com/2022/11/08/assassination-imran-khan-pakistan-us-coup/",
        "timestamp": "2022-11-08 17:41:53+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=cpiF6JYepfI",
        "timestamp": "2022-11-03 23:19:19+00:00"
    },
    {
        "message": "For the 30th year in a row, almost every country on Earth voted at the United Nations to oppose the six-decade US blockade of Cuba.\n\nThe vote was 185 to 2. Only the USA and apartheid Israel supported the blockade. Just two countries abstained: Bolsonaro's far-right Brazil and NATO's client regime in Ukraine.\n\nWhy does Washington maintain this illegal, suffocating blockade after 60 years? In an internal 1960 memo, a top US State Department official admitted that the “majority of Cubans support [Fidel] Castro.” \n\nThe diplomat concluded that the US must use \"every possible means\" to \"weaken the economic life of Cuba,\" to deny \"money and supplies to Cuba, to decrease monetary and real wages, to bring about hunger, desperation and overthrow of government.\"\n\nhttps://multipolarista.com/2022/11/03/un-vote-blockade-cuba-us-israel",
        "timestamp": "2022-11-03 23:19:14+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=u3lJW3Y6Pqo",
        "timestamp": "2022-11-03 00:20:21+00:00"
    },
    {
        "message": "Colombia’s first-ever left-wing leader Gustavo Petro took a historic trip to Venezuela, pledging regional unity following the anti-imperialist model of Simón Bolívar. \n\nMeeting with President Nicolás Maduro, Petro said it is “suicidal” to divide the countries, “because we are the same people,” in “historically one single Bolivarian nation, reunited.”\n\nhttps://multipolarista.com/2022/11/02/colombia-petro-visits-venezuela-unity-bolivar/",
        "timestamp": "2022-11-03 00:20:12+00:00"
    },
    {
        "message": "Brazil’s new President-elect Lula da Silva said back in May, “We are going to create a currency in Latin America,” to combat “the dependency on the dollar.”\n\nLula - a co-founder of the BRICS system - wants to call the new currency the Sur, meaning “South.”\nhttps://www.youtube.com/watch?v=bRTr8o8EYiE",
        "timestamp": "2022-11-02 14:34:24+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=HuDWw5l-yoU",
        "timestamp": "2022-10-31 17:09:02+00:00"
    },
    {
        "message": "We were joined by Brazil-based journalist Brian Mier to discuss the importance of Lula da Silva's historic victory in the presidential election.\n\nWe explain Lula's staunch working-class support, his pledge to fight poverty and hunger, and his commitment to expanding BRICS, strengthening Latin American regional integration, deepening South-South cooperation, and building a multipolar world:\n\nhttps://multipolarista.com/2022/10/31/lula-brazil-brics-latin-america/",
        "timestamp": "2022-10-31 17:07:46+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=Ugzu1pTiWXQ",
        "timestamp": "2022-10-26 16:37:02+00:00"
    },
    {
        "message": "After Prime Minister Imran Khan was overthrown in a US-backed coup, Pakistan’s unelected “imported government” has banned the country’s most popular politician from office, sparking huge protests.\n\nMeanwhile, the army chief took a friendly, week-long trip to Washington to discuss further subordinating Pakistan to the US, weakening ties with China, arming Ukraine in its war with Russia, and even recognizing apartheid Israel — all things that Khan had adamantly opposed.\n\nhttps://multipolarista.com/2022/10/26/pakistan-coup-imran-khan-china-israel/",
        "timestamp": "2022-10-26 16:35:32+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=SFnMY_rNWx4",
        "timestamp": "2022-10-25 17:50:12+00:00"
    },
    {
        "message": "The Biden administration has continued Trump's economic war on China. New, extremely aggressive US sanctions aim to “kneecap” China’s tech sector.\n\nA former Pentagon official acknowledged that the US blocking of advanced technology exports to China is a “disproportionate” and “unilateral” attack, a “form of economic containment” in the new cold war.\n\nhttps://multipolarista.com/2022/10/24/us-economic-tech-war-china/",
        "timestamp": "2022-10-25 17:48:53+00:00"
    },
    {
        "message": "The Western media is waging a systematic propaganda campaign against China, to manufacture consent for the US-led new cold war. \n\nWe debunked many of the lies and misleading claims spread by the press:\n\nhttps://multipolarista.com/2022/10/23/media-manufactures-consent-cold-war-china/",
        "timestamp": "2022-10-24 15:56:33+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=4IztA3jlUKs",
        "timestamp": "2022-10-21 19:17:43+00:00"
    },
    {
        "message": "In its 20th national congress being held this week, the Communist Party of China (CPC) brought together 2296 delegates from every province in the country in order to plan the next five years of policies. \n\nIt pledged to:\n-redistribute wealth to reduce inequality\n-pursue full employment\n-promote gender equality\n-expand social security and health care\n-protect the environment, and \n-fight the “cancer” of corruption.\n\nhttps://multipolarista.com/2022/10/21/china-20th-cpc-national-congress/",
        "timestamp": "2022-10-21 19:17:28+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=ajIRkk1FOkM",
        "timestamp": "2022-10-20 16:27:01+00:00"
    },
    {
        "message": "EU foreign-policy chief Josep Borrell confessed the West’s neoliberal economic model was “based on cheap energy coming from Russia,” “access to the big China market,” and low-paid Chinese workers.\n\nEurope has lost that. So the US-EU-NATO imperialist bloc is waging the new cold war in hopes of reasserting control over China’s market and labor and Russia’s natural resources.\n\nhttps://multipolarista.com/2022/10/18/eu-prosperity-china-russia-energy-market/",
        "timestamp": "2022-10-20 16:26:29+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=R4hRs1svQlk",
        "timestamp": "2022-10-17 21:47:49+00:00"
    },
    {
        "message": "EU foreign-policy chief Josep Borrell showed the West’s neocolonial mentality in a racist rant claiming “the world needs Europe” as a “beacon” and beautiful “garden” to civilize the barbarous “jungle” in the Global South. \n\nHe also called for regime change to create a “post-Putin Russia,” in order to forcibly integrate it into the US-led imperialist world system.\n\nhttps://multipolarista.com/2022/10/15/eu-europe-garden-jungle/",
        "timestamp": "2022-10-17 21:44:10+00:00"
    },
    {
        "message": "Round two of Brazil’s presidential election, coming up on October 30, offers deeply opposing visions:\n\nBolsonaro would mean more subordination and deindustrialization.\n\nLula would mean independence, economic nationalism, and multipolarity.\n\nBrazilian professor Elias Jabbour analyzed this important race:\n\nhttps://multipolarista.com/2022/10/08/brazil-election-bolsonaro-lula/",
        "timestamp": "2022-10-09 12:43:54+00:00"
    },
    {
        "message": "Brazil’s leftist presidential candidate Lula da Silva won the first round of the elections with 48.4% and over 6 million more votes than far-right incumbent Jair Bolsonaro. \n\nLula's Workers’ Party is organizing with social movements in the lead-up to the October 30 runoff election.\n\nWe spoke with journalist Camila Escalante, who is reporting on the ground in São Paulo, about what these crucial elections mean for not just Brazil, but Latin America and the world as a whole:\n\nhttps://multipolarista.com/2022/10/03/brazil-elections-lula-bolsonaro/",
        "timestamp": "2022-10-03 17:32:39+00:00"
    },
    {
        "message": "We analyzed the geopolitics of the proxy war in Ukraine, from Russia's oil and gas exports and the (now sabotaged) Nord Stream pipelines to Washington's strategy to prevent Eurasian integration and keep Germany's economy dependent on the US:\n\nhttps://youtu.be/nyitwFjX0GI",
        "timestamp": "2022-09-28 00:02:58+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=qbiIoIAgxws",
        "timestamp": "2022-09-26 23:12:01+00:00"
    },
    {
        "message": "Colombia’s first ever left-wing President Gustavo Petro delivered a historic UN speech declaring, “The war on drugs has failed.” \n\nHe warned capitalism is destroying the environment, with its “addiction to money and oil,” and called for debt relief for the Global South.\n\nhttps://multipolarista.com/2022/09/24/war-drugs-un-colombia-gustavo-petro/",
        "timestamp": "2022-09-26 23:10:53+00:00"
    },
    {
        "message": "Liz Truss, the UK’s new prime minister, is the most anti-China British leader in decades.\n\nIn the Conservative leadership contest she won, candidates competed to be as belligerent as possible against Beijing.\n\nA look at the new cold war from London:\n\nhttps://multipolarista.com/2022/09/23/britain-anti-china-liz-truss",
        "timestamp": "2022-09-23 16:44:42+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=scBiUIaBx9s",
        "timestamp": "2022-09-20 17:24:57+00:00"
    },
    {
        "message": "The FBI harassed Black revolutionary Darren Seals and compiled a 900-page report on his organizing against racism and police brutality in Ferguson, Missouri, birthplace of Black Lives Matter. \n\nHe was shot to death in 2016, then set on fire in his car.\n\nhttps://multipolarista.com/2022/09/19/fbi-black-activist-darren-seals/",
        "timestamp": "2022-09-20 17:24:48+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=h4Pr9g_7Nhc",
        "timestamp": "2022-09-13 21:31:21+00:00"
    },
    {
        "message": "The US military launched at least 251 foreign interventions from 1991 to 2022.\n\nThis is according to a report from the US government's own Congressional Research Service.\n\nWe went through the data and created a map showing just how vast the meddling is:\n\nhttps://multipolarista.com/2022/09/13/us-251-military-interventions-1991/",
        "timestamp": "2022-09-13 21:31:04+00:00"
    },
    {
        "message": "We interviewed economist Michael Hudson about the need for much bigger debt relief, inflation and the US Federal Reserve, disaster capitalism in Ukraine, and China’s challenge to the petrodollar.\n\nFull transcript, video, and podcast here:\n\nhttps://multipolarista.com/2022/09/08/michael-hudson-debt-inflation-ukraine-petrodollar/",
        "timestamp": "2022-09-10 21:15:22+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=2fHZCfRE3n4",
        "timestamp": "2022-09-09 20:49:30+00:00"
    },
    {
        "message": "Ukraine’s Western-backed leader Volodymyr Zelensky opened the New York Stock Exchange telling Wall Street his country is “open” for foreign corporations to exploit it with $400 billion in state selloffs.\n\nEconomist Michael Hudson says the vicious anti-labor policies being imposed by Ukraine are reminiscent of Chile's fascist Pinochet regime.\n\nhttps://multipolarista.com/2022/09/09/zelensky-selling-ukraine-wall-street/",
        "timestamp": "2022-09-09 20:49:18+00:00"
    },
    {
        "message": "South Koreans held huge protests against the US military and its largest joint war exercises in years, simulating attacks on the DPRK (North Korea) and the assassination of its leadership.\n\nWe interviewed activists from the peace groups Women Cross DMZ and Korea Peace Now to discuss the mass movement against US militarization and imperialism:\n\nhttps://multipolarista.com/2022/09/02/south-korea-protest-us-military-drills/",
        "timestamp": "2022-09-07 15:49:42+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=WfjqzAY_mEc",
        "timestamp": "2022-09-05 17:17:03+00:00"
    },
    {
        "message": "In blatant violation of international law, the US government has blocked countries from events at UN headquarters in New York.\n\nThe Biden administration is banning Russian diplomats, while the Trump admin illegally barred Venezuela and Iran.\n\nhttps://multipolarista.com/2022/09/04/biden-trump-un-neutrality-visas/",
        "timestamp": "2022-09-05 17:16:54+00:00"
    },
    {
        "message": "West killed peace proposal to end Ukraine war, Russia supported negotiated settlement\n\nThis fact was admitted by a major Ukrainian newspaper and Foreign Affairs magazine, of the US government-linked Council on Foreign Relations.\n\nThe West didn't want peace.\n\nhttps://multipolarista.com/2022/09/03/west-peace-proposal-ukraine-russia/",
        "timestamp": "2022-09-04 21:55:40+00:00"
    },
    {
        "message": "Russia and Ukraine agreed to a negotiated settlement to end the war in April, but British Prime Minister Boris Johnson intervened to stop the peace deal.\n\nThe US and EU instead escalated the proxy war, as the Biden administration admitted, to try to \"weaken\" Moscow.\n\nhttps://www.youtube.com/watch?v=LpJMqs1yG1A",
        "timestamp": "2022-09-04 21:55:18+00:00"
    },
    {
        "message": "Foreign media outlets falsely accuse Nicaragua’s Sandinista government of repressing the Catholic Church.\n\nThis article by a longtime community development worker in Nicaragua explains the Church hierarchy's role in supporting a violent right-wing coup attempt in 2018 and sponsoring extremist opposition groups:\n\nhttps://multipolarista.com/2022/08/29/catholic-church-coup-nicaragua/",
        "timestamp": "2022-09-03 15:11:29+00:00"
    },
    {
        "message": "We are doing a livestream today at 3 pm ET / noon PT / 1900 UTC to discuss the huge protests in South Korea against the US military and its largest exercises in years, simulating war with the North.\n\nWe will be speaking with Korean peace activists. Join us: \n\nhttps://youtube.com/watch?v=Lqocug-NGRs",
        "timestamp": "2022-09-02 15:34:04+00:00"
    },
    {
        "message": "In this article, a Brazilian scholar explains how the energy crisis in Europe, proxy war in Ukraine, rebellion in the Global South, and expansion of the BRICS all reflect the decline of Western imperialism and growing cracks in the capitalist world system.\n\nhttps://multipolarista.com/2022/08/31/west-imperial-decline-capitalism/",
        "timestamp": "2022-08-31 22:59:32+00:00"
    },
    {
        "message": "Neoliberalism has lost the key pillars it was built on: \n- cheap energy and raw materials from Russia, \n- cheap labor and consumer goods from China, \n- an unsustainable bubble of household debt,\n- low to zero interest rates, and \n- Washington’s ability to organize regime-change operations in any country where a government tried a socialistic or state-led economic model.\n\nhttps://multipolarista.com/2022/08/27/west-end-neoliberalism-abundance/",
        "timestamp": "2022-08-30 22:46:46+00:00"
    },
    {
        "message": "France’s President Macron, a former banker, warned \"we are living the end of what could have seemed an era of abundance.\"\n\nWestern wars and sanctions are boomeranging back at home.\n\nIn this video we explain why and how the neoliberal phase of capitalism is collapsing:\n\nhttps://www.youtube.com/watch?v=dw84vwYS8YE",
        "timestamp": "2022-08-30 22:42:00+00:00"
    },
    {
        "message": "In this article, a Brazilian scholar explains how the hegemony of US imperialism led to a global consolidation of capitalism. But the rise of China and its model of productive, anti-neoliberal globalization offers an opportunity for Latin America, and the world, to challenge neocolonialism.\n\nhttps://multipolarista.com/2022/08/28/china-anti-neoliberal-globalization-imperialism/",
        "timestamp": "2022-08-29 16:22:43+00:00"
    },
    {
        "message": "We interviewed a Pakistani scholar about the US-backed coup against PM Imran Khan, who was absurdly charged with \"terrorism\" for criticizing the unelected regime.\n\nWe discussed Pakistan's economic crisis, the neoliberal IMF bailout, and why the US opposed Khan's independent foreign policy, especially his close alliance with China, growing relations with Russia, opposition to the US war in Afghanistan, and strong support for Palestine:\n\nhttps://www.youtube.com/watch?v=g9IzwCAYbZY",
        "timestamp": "2022-08-25 15:53:39+00:00"
    },
    {
        "message": "China is forgiving 23 interest-free loans for 17 African countries, after already cancelling $3.4 billion and restructuring $15 billion of debt from 2000-2019.\n\nIn this video we analyze how this relief debunks the US government's propaganda myth of supposed Chinese \"debt-trap diplomacy.\"\n\nhttps://www.youtube.com/watch?v=AMTVoZKrCPo",
        "timestamp": "2022-08-23 00:19:17+00:00"
    },
    {
        "message": "China is forgiving 23 interest-free loans for 17 African countries, after already cancelling $3.4 billion and restructuring $15 billion of debt from 2000-2019.\n\nBeijing pledged more infrastructure projects and offered favorable trade deals in a “win-win” model of “mutually beneficial cooperation.”\n\nMeanwhile, the United States has turned Africa into a battleground in its new cold war on China and Russia.\n\nTop US diplomats just visited the continent, pressuring countries to cut ties with China and threatening them not to do trade with Russia or they could face \"actions taken against them for breaking [Western] sanctions.\"\n\nhttps://multipolarista.com/2022/08/20/china-forgives-debt-africa/",
        "timestamp": "2022-08-20 19:22:15+00:00"
    },
    {
        "message": "https://multipolarista.com/2022/08/17/biden-colombia-petro-coup/",
        "timestamp": "2022-08-17 16:58:05+00:00"
    },
    {
        "message": "Biden's top Latin America advisor Juan González threateningly said of Colombia's new left-wing president: \n\n\"40 years ago, the United States would have done everything possible to prevent the election of Gustavo Petro, and once in power it would have done almost everything possible to sabotage his government.\"\n\nhttps://www.youtube.com/watch?v=pVQy88AzQ5A",
        "timestamp": "2022-08-17 16:57:58+00:00"
    },
    {
        "message": "https://multipolarista.com/2022/08/16/japan-us-lied-radioactive-fallout/",
        "timestamp": "2022-08-16 16:39:32+00:00"
    },
    {
        "message": "After dropping two atomic bombs on Japan in August 1945, killing between 100,000 and 200,000 civilians, top US government officials lied to the media and Congress, claiming there was “no radioactive residue” in Hiroshima and Nagasaki and that Japanese reports of deaths due to radiation were “propaganda.”\n\nThe US general overseeing the nuclear program told Congress that Japanese civilians did not face “undue suffering,” insisting that it was in fact “a very pleasant way to die.”\n\nhttps://www.youtube.com/watch?v=Cu4KnCPjwys",
        "timestamp": "2022-08-16 16:39:24+00:00"
    },
    {
        "message": "In this article, a Puerto Rican independence activist and former political prisoner in the US offers his astute geopolitical analysis of the proxy war in Ukraine.\n\nHe argues that the US-EU-NATO war on Russia has backfired and is only accelerating Western decline.\n\nhttps://multipolarista.com/2022/08/15/russia-us-imperial-plans-ukraine/",
        "timestamp": "2022-08-15 17:30:27+00:00"
    },
    {
        "message": "CBS censors its own report on Ukraine weapons corruption\n\nhttps://multipolarista.com/2022/08/10/cbs-censors-report-ukraine-weapons-corruption/",
        "timestamp": "2022-08-12 22:28:30+00:00"
    },
    {
        "message": "Under government pressure, CBS News censored its own documentary showing that just around 30% of the weapons Western governments have sent actually go to the frontlines, with widespread corruption and black markets.\n\nWe analyzed the highlights in this video:\n\nhttps://www.youtube.com/watch?v=4MQNjmbDadg",
        "timestamp": "2022-08-12 22:28:01+00:00"
    },
    {
        "message": "This story provides an inside look at the free universal health-care system created by Nicaragua’s Sandinista government, which has saved countless lives\nhttps://multipolarista.com/2022/08/11/nicaragua-free-health-care/",
        "timestamp": "2022-08-11 17:26:45+00:00"
    },
    {
        "message": "Silicon Valley Big Tech corporations, which are all US government contractors, censor Russian media while allowing Australian state outlets to spread anti-China propaganda and refusing to label Western state media\n\nhttps://www.youtube.com/watch?v=YHUctJi2EWw",
        "timestamp": "2022-08-11 15:30:56+00:00"
    },
    {
        "message": "This article details how the US government is holding many political prisoners, including:\n\n- national security state employees and reporters locked up for publicizing blatant government criminality\n- representatives of foreign governments that Washington seeks to overthrow who were imprisoned for \"violating\" illegal unilateral US sanctions\n- Black, Native American, and Latino revolutionaries fighting for the rights of their peoples\n- Arabs and Muslims targeted after 9/11\n- prisoners detained in the Guantánamo torture center without charges\n- women locked up for defending themselves against violent attacks\n- environmental activists\n\nhttps://multipolarista.com/2022/08/09/us-political-prisoners-list/",
        "timestamp": "2022-08-09 19:08:08+00:00"
    },
    {
        "message": "Here you can find an English-language translation, video, and podcast:\n\nhttps://multipolarista.com/2022/08/05/us-war-china-russia-multipolar-world-nicaragua-ortega/",
        "timestamp": "2022-08-06 22:16:20+00:00"
    },
    {
        "message": "In a historic speech, Nicaragua’s President Daniel Ortega said the US war on China and Russia is an attack on the new world of “multipolarism”:\n\n\"North American imperialism is trying to maintain its hegemony at all costs, even at the risk of sinking its own economy\"\n\nhttps://www.youtube.com/watch?v=lkPyT8fDymk",
        "timestamp": "2022-08-06 22:16:07+00:00"
    },
    {
        "message": "Video, podcast, and sources here: \n\nhttps://multipolarista.com/2022/08/02/us-war-china-taiwan-nuclear/",
        "timestamp": "2022-08-02 21:26:39+00:00"
    },
    {
        "message": "This video explains how the US government has been preparing for war with China over Taiwan. The extremely provocative trip by top official Nancy Pelosi was only the latest development in years of US escalation.\n\nThe Pentagon has made plans for war with China, top CIA officials openly call for fighting Beijing, and US troops are on the ground in Taipei. Washington has sold Taiwan tens of billions of dollars worth of military equipment, and influential DC think tanks are even calling to send it nuclear weapons.\n\nhttps://www.youtube.com/watch?v=hUjHZ5z8W90",
        "timestamp": "2022-08-02 21:26:27+00:00"
    },
    {
        "message": "Western governments and corporations met in Switzerland this July to plan harsh neoliberal economic policies to impose on post-war Ukraine.\n\nThey called to cut labor laws, “open markets,” drop tariffs, deregulate industries, and “sell state-owned enterprises to private investors.”\n\nhttps://multipolarista.com/2022/07/28/west-neoliberal-recovery-conference/",
        "timestamp": "2022-07-28 20:10:01+00:00"
    },
    {
        "message": "Here are the top corporate media outlets that spread this bogus conspiracy theory:\n\nhttps://multipolarista.com/2022/01/23/cia-havana-syndrome-conspiracy-media/",
        "timestamp": "2022-07-26 14:58:05+00:00"
    },
    {
        "message": "Top Western corporate media outlets have spent years spreading a conspiracy theory called “Havana Syndrome,” claiming without any evidence that Russia, China, and/or Cuba were systematically attacking US spies and diplomats with futuristic microwave technology and directed-energy weapons.\n\nCIA Director William Burns has now burst that media bubble, admitting that “Havana Syndrome” is not caused by foreign attacks, and there are normal medical explanations.\n\nhttps://multipolarista.com/2022/07/26/cia-director-havana-syndrome-attack/",
        "timestamp": "2022-07-26 14:56:40+00:00"
    },
    {
        "message": "July 25 is the date of the US invasion of Puerto Rico.\n\nIn this article, a Puerto Rican revolutionary and former political prisoner explains how racism keeps Puerto Rico in a colonial status, based on white-supremacist court cases from the era of slavery.\n\nhttps://multipolarista.com/2022/07/25/puerto-rico-colonialism-racism-slavery-july-25/",
        "timestamp": "2022-07-25 14:47:04+00:00"
    },
    {
        "message": "In his speech at the 43rd anniversary of the Sandinista Revolution, Nicaraguan President Daniel Ortega said the United States and European Union are waging wars to prevent “multipolarity on our planet.”\n\nOrtega quoted Che Guevara, arguing “imperialism cannot be trusted even a little bit.” He added that dialogue with Washington is “impossible,” because it would be like negotiating with the devil.\n\nhttps://multipolarista.com/2022/07/24/nicaragua-ortega-war-multipolarity/",
        "timestamp": "2022-07-24 18:19:08+00:00"
    },
    {
        "message": "https://multipolarista.com/2022/07/23/iran-russia-dollar-china-alliance/",
        "timestamp": "2022-07-23 14:28:59+00:00"
    },
    {
        "message": "Russian President Vladimir Putin visited Iran, signed a $40 billion energy cooperation agreement, and pledged to strengthen their trilateral economic and military alliance with China.\n\nMoscow and Tehran also called to drop the US dollar and instead use local currencies for trade.\n\nhttps://www.youtube.com/watch?v=n60R8NooXa0",
        "timestamp": "2022-07-23 14:28:52+00:00"
    },
    {
        "message": "We made a mini-documentary inside Nicaragua's Sandinista Revolution, which just celebrated its 43rd anniversary\n\nThis video explores the Sandinista Front's emphasis on socialism, social programs, popular participation, anti-imperialism and internationalism:\n\nhttps://t.co/6FK0F8wlUl",
        "timestamp": "2022-07-22 13:22:53+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=U52tT5hgtSk",
        "timestamp": "2022-07-12 16:29:23+00:00"
    },
    {
        "message": "Sri Lanka owes 81% of its external debt to US and European financial institutions and Western allies Japan and India. China owns just 10%. \n\nBut Washington blames imaginary \"Chinese debt traps\" for the South Asian nation's economic crisis, as it considers a 17th IMF structural adjustment program.\n\nhttps://multipolarista.com/2022/07/11/debt-trap-sri-lanka-west-china/",
        "timestamp": "2022-07-11 21:44:24+00:00"
    },
    {
        "message": "https://multipolarista.com/2022/07/08/nato-2022-strategic-concept-russia-china/",
        "timestamp": "2022-07-11 20:12:17+00:00"
    },
    {
        "message": "NATO’s 2022 “Strategic Concept” is the US-led military cartel's first new plan since 2010.\n\nIt declares Russia a “threat” and China “systemic challenge,” demonizing the Eurasian powers as “authoritarian actors” and “strategic competitors.”\n\nThe document essentially declares a second cold war to maintain Western hegemony.\n\nyoutube.com/watch?v=l7QajE5yiA4",
        "timestamp": "2022-07-11 20:11:54+00:00"
    },
    {
        "message": "Japan’s longest serving prime minister, Shinzo Abe tried to rewrite the Japanese empire’s genocidal history. \n\nAfter World War II, the US rehabilitated fascist war criminals, like Abe’s grandfather, putting them in power in a right-wing one-party regime.\n\nhttps://www.youtube.com/watch?v=5WWJ3EOmPkY",
        "timestamp": "2022-07-10 14:28:03+00:00"
    },
    {
        "message": "CNBC pundit Jim Cramer called for “cyber terrorism” against Russia and a “blank check” for US weapons corporations – including the same companies he encourages his viewers to invest in.\n\nhttps://multipolarista.com/2022/07/05/cnbc-jim-cramer-cyber-terrorism-russia/",
        "timestamp": "2022-07-07 15:58:37+00:00"
    },
    {
        "message": "A leftist Spanish member of parliament condemned the NATO summit as it was being held in Madrid, noting it was organized to “enrichen the weapons trade” and “reinforce the geostrategic priorities of the United States … above all to weaken China.” \n\nHe condemned the US “vassalage” represented by NATO, calling for a new “autonomous” European security model based on respect for the Global South.\n\nWe translated his powerful speech and have a video and transcript here:\n\nhttps://multipolarista.com/2022/07/04/spain-nato-subordinate-europe-us-war-china/",
        "timestamp": "2022-07-06 23:12:07+00:00"
    },
    {
        "message": "During the first cold war, the CIA poured money into funding and cultivating a pro-imperialist, anti-communist “compatible left.”\n\nToday, the US government uses social media to censor anti-war news outlets and activists.\n\nhttps://multipolarista.com/2022/07/02/censorship-anti-imperialists-compatible-left/",
        "timestamp": "2022-07-02 20:05:07+00:00"
    },
    {
        "message": "We interviewed economist Michael Hudson about the inflation crisis and US Federal Reserve’s plan to reduce wages and boost unemployment.\n\nHe warns a “long depression” is coming, due to Washington's new cold war on Russia and China.\n\nA full transcript, video, and podcast version are here:\n\nhttps://multipolarista.com/2022/06/28/michael-hudson-inflation-fed-wages",
        "timestamp": "2022-06-30 18:19:05+00:00"
    },
    {
        "message": "The CIA and special operations forces from Britain, France, and Canada are physically in Ukraine, helping direct the proxy war on Russia, overseeing weapons, training, and intelligence.\n\nAt least 20 countries are part of a US Army-led coalition, guiding Ukraine in its fight against Russian troops.\n\nSome Ukrainian combatants are even using US flag patches on their equipment.\n\nhttps://multipolarista.com/2022/06/26/cia-special-ops-ukraine-proxy-war-russia/",
        "timestamp": "2022-06-27 17:39:11+00:00"
    },
    {
        "message": "The US organized a meeting with top military officials from apartheid Israel, Saudi Arabia, Qatar, Jordan, Egypt, the UAE, and Bahrain, in order to conspire against Iran.\n\nThis comes while Jordan’s staunchly pro-Western king calls for a “Middle East NATO.”\n\nhttps://multipolarista.com/2022/06/27/israel-saudi-arabia-qatar-uae-iran/",
        "timestamp": "2022-06-27 16:14:42+00:00"
    },
    {
        "message": "A US government body held a Congressional briefing plotting ways to break up Russia as a country, in the name of supposed “decolonization.”\n\nIt's the latest example of Washington co-opting progressive-sounding rhetoric to advance its own imperial interests.\n\nThe hearing was introduced by Congressman Steve Cohen, who claimed Russians “have in essence colonized their own country,” arguing Russia is “not a strict nation, in the sense that we’ve known in the past.”\n\nhttps://multipolarista.com/2022/06/23/us-government-decolonize-russia/",
        "timestamp": "2022-06-24 01:32:31+00:00"
    },
    {
        "message": "France and Germany pressured African Union leaders for months to join a brief Zoom call with Ukraine’s Volodymyr Zelensky. \n\n51 of 55 African heads of state (93%) boycotted the meeting, showing clear neutrality over the Western proxy war with Russia.\n\nhttps://multipolarista.com/2022/06/22/africa-zelensky-call-neutrality-ukraine/",
        "timestamp": "2022-06-22 16:07:48+00:00"
    },
    {
        "message": "We spoke with a leftist Venezuelan journalist about the implications of the victory of left-wing candidate Gustavo Petro in Colombia's presidential election, the easing of a few US sanctions, and Venezuela's 20-year cooperation agreement with Iran.\n\nhttps://www.youtube.com/watch?v=wpouWfsvLYI",
        "timestamp": "2022-06-21 00:54:16+00:00"
    },
    {
        "message": "Gustavo Petro won Colombia’s presidential election, becoming the country's first ever left-wing leader. \n\nWe analyzed what this means for Latin America, the US, Venezuela, the military, paramilitary groups, the powerful oligarchy, and social movements:\n\nhttps://multipolarista.com/2022/06/19/colombia-gustavo-petro-election/",
        "timestamp": "2022-06-20 02:35:35+00:00"
    },
    {
        "message": "We interviewed Beijing-based journalist Ian Goodrum about the Chinese government's campaign against inequality, crackdown on billionaires, and push for what it calls \"common prosperity.\"\n\nYou can watch or listen to the discussion here: \n\nhttps://multipolarista.substack.com/p/china-billionaires-common-prosperity",
        "timestamp": "2022-06-13 16:57:11+00:00"
    },
    {
        "message": "China signed a massive 25-year agreement with Iran in 2021.\n\nVenezuela signed a 20-year cooperation plan with Iran this June.\n\nIn May, Nicaragua's Sandinista government signed economic deals with Iran concerning oil, agriculture, trade, and technology. They also discussed bartering to get around illegal US sanctions.\n\nhttps://multipolarista.com/2022/05/07/nicaragua-agreements-iran-bartering-sanctions/",
        "timestamp": "2022-06-12 17:46:54+00:00"
    },
    {
        "message": "Venezuelan President Nicolás Maduro visited Iran and signed a historic 20-year cooperation agreement involving energy, technology, and trade. He pledged solidarity against Western aggression in a joint “anti-imperialist struggle for a better world.”\n\nhttps://multipolarista.com/2022/06/11/venezuela-iran-20-year-agreement/",
        "timestamp": "2022-06-11 23:05:27+00:00"
    },
    {
        "message": "The secretary of the Bolivarian Alliance (ALBA), Sacha Llorenti, explains why Latin America wants its own currency:\n\n\"Because imperialism is not just the political control; imperialism is not just territorial control; imperialism is also very, very much linked to natural resources, to the financial system, to how the debt system works; it is very much related to the World Bank, to the International Monetary Fund, the way in which the dollar imposes its will on the whole world.\n\n\"And things are changing. Things are changing, not just in Latin America and the Caribbean, but also in Asia and Africa.\n\n\"So what we are seeing is an empire which is losing its power. And I think that this century will be a century in which we will see the decay U.S. imperialism.\"\n\nFull video and transcript here: https://multipolarista.com/2022/06/08/alba-summit-americas-sacha-llorenti",
        "timestamp": "2022-06-11 13:10:42+00:00"
    },
    {
        "message": "We interviewed the secretary of the Bolivarian Alliance (ALBA), Sacha Llorenti, about Latin America's rebellion against the US government's Summit of the Americas, which opened on June 6 in Los Angeles, California.\n\n\"We don't consider this is a summit, nor of the Americas,\" he said. Llorenti condemned the Monroe Doctrine, US sanctions, and the \"superiority complex that runs through US foreign policy.\"\n\n\"Things are changing,\" he added. \"What we are seeing is an empire which is losing its power.\"\n\nhttps://multipolarista.com/2022/06/08/alba-summit-americas-sacha-llorenti/",
        "timestamp": "2022-06-08 20:30:28+00:00"
    },
    {
        "message": "Mexico’s President Andrés Manuel López Obrador (AMLO) denounced the illegal US blockade of Cuba as a “type of genocide” and “tremendous violation of human rights.”\n\nhttps://multipolarista.com/2022/06/07/mexico-amlo-us-blockade-cuba-genocide/",
        "timestamp": "2022-06-07 14:46:17+00:00"
    },
    {
        "message": "As the US government’s Summit of the Americas opens today in Los Angeles, California, the presidents of Mexico, Bolivia, Honduras and Guatemala are boycotting in protest.\n\nHeads of state representing Latin American countries with more than 200 million people combined are not attending.\n\nIt is a major diplomatic failure for the Joe Biden administration.\n\nhttps://multipolarista.com/2022/06/06/us-summit-americas-mexico-boycott/",
        "timestamp": "2022-06-06 21:41:50+00:00"
    },
    {
        "message": "We interviewed US Congress candidate Geoffrey M Young, who is running in Kentucky on an anti-war platform, calling to abolish the CIA, prevent nuclear war, create a Medicare-for-All system of universal healthcare, end the war on drugs, dismantle AFRICOM, and stop arming Nazis in Ukraine.\n\nhttps://multipolarista.com/2022/06/04/kentucky-congress-geoff-young-abolish-cia/",
        "timestamp": "2022-06-04 16:59:11+00:00"
    },
    {
        "message": "The United States plans to spend tens of billions of dollars to surround China with missiles.\n\nBut a US military-sponsored study concluded its Pacific allies South Korea, Japan, the Philippines, Thailand, and Australia are unlikely to host the offensive weapons.\n\nhttps://multipolarista.com/2022/06/03/us-china-missiles-country-host/",
        "timestamp": "2022-06-03 15:01:59+00:00"
    },
    {
        "message": "Iran proposed a new currency for trade with China, Russia, India, Pakistan, and other members of the Shanghai Cooperation Organization (SCO) - which represents more than 40% of global population and roughly one-third of the world’s GDP.\n\nThis could help circumvent illegal Western sanctions and weaken US dollar hegemony.\n\nhttps://multipolarista.com/2022/06/02/iran-currency-shanghai-cooperation-organization/",
        "timestamp": "2022-06-02 19:47:44+00:00"
    },
    {
        "message": "The world faces a food crisis due to war, sanctions, and inflation. China has shown how to strengthen food sovereignty, while fighting poverty, with state-funded agricultural cooperatives, government crackdown on waste, and investment in technology.\n\nhttps://multipolarista.com/2022/05/31/china-food-security-poverty-cooperatives/",
        "timestamp": "2022-06-01 00:52:25+00:00"
    },
    {
        "message": "Colombia held presidential elections today. A far-right hundred-millionaire real estate mogul who called himself a “follower” of Nazi dictator Adolf Hitler, Rodolfo Hernández, won second place in round one.\n\nHe will compete against center-left candidate Gustavo Petro in a runoff vote in June.\n\nhttps://multipolarista.com/2022/05/29/colombia-hitler-rodolfo-hernandez/",
        "timestamp": "2022-05-30 02:47:01+00:00"
    },
    {
        "message": "US Federal Reserve chairman Jerome Powell said his goal is “to get wages down,” complaining workers have too much power in the labor market.\n\nEconomist Michael Hudson says this is “junk economics,” and corporate monopolies are driving inflation, not wages.\n\nhttps://multipolarista.com/2022/05/24/us-federal-reserve-wages-inflation/",
        "timestamp": "2022-05-24 17:25:07+00:00"
    },
    {
        "message": "The top vice presidential candidate for Colombia’s May elections, Francia Márquez, called out the US government for meddling in her country's electoral process.\n\nThe left-wing grassroots activist criticized the war on drugs, militarization, and “free trade,” calling for land reform and reparations.\n\nhttps://multipolarista.com/2022/05/17/us-meddling-colombia-election-francia-marquez/",
        "timestamp": "2022-05-19 22:39:52+00:00"
    },
    {
        "message": "The second-most-powerful figure in the Canadian government, Chrystia Freeland is the granddaughter of a Ukrainian Nazi who ran a fascist propaganda newspaper (using a printing press stolen from a Jewish publisher who was killed in a Nazi extermination camp).\n\nWhen Freeland was appointed foreign minister in 2017, the US embassy boasted, \"Canada Adopts 'America First' Foreign Policy.\"\n\nFreeland also helped organize shady regime-change operations, working with right-wing anti-communist Ukrainian groups in the Soviet Union, back in the 1980s.\n\nhttps://multipolarista.com/2022/05/16/canada-gas-prices-putin-china-chrystia-freeland/",
        "timestamp": "2022-05-17 00:40:33+00:00"
    },
    {
        "message": "Canada’s deputy prime minister and finance minister, Chrystia Freeland, insisted on the floor of Parliament that her nation’s citizens should not complain about high gas prices, or they are helping Russian President Vladimir Putin and China.\n\nFreeland, the second-most-powerful Canadian official, argued that blaming her government for skyrocketing inflation is equivalent to “doing Vladimir Putin’s work for him.”\n\nhttps://multipolarista.com/2022/05/16/canada-gas-prices-putin-china-chrystia-freeland/",
        "timestamp": "2022-05-17 00:38:00+00:00"
    },
    {
        "message": "In this video we show how neoconservative imperialists like Fox News host Tucker Carlson (a CIA applicant) and Republican Florida Governor Ron DeSantis cynically tried to rebrand as \"right-wing populists,\" while pushing war on China, Iran, Cuba, Venezuela, and Palestine.\n\nhttps://www.youtube.com/watch?v=_QHoW8Vf8wg",
        "timestamp": "2022-05-15 15:57:38+00:00"
    },
    {
        "message": "Mexican President López Obrador took a historic trip to Cuba, where he called for an end to the US blockade and criticized right-wing “coup-plotters.” \n\nAMLO said Latin America should form a union, amid “the economic decline of the United States.”\n https://multipolarista.com/2022/05/10/cuba-mexico-amlo-us-blockade/",
        "timestamp": "2022-05-10 18:47:56+00:00"
    },
    {
        "message": "We're doing a livestream today with economist Michael Hudson to discuss the decline of US dollar hegemony, the sanctions war on Russia, his concept of \"free-trade imperialism,\" and financial parasitism\n\nJoin us at 2pm ET / 11am PT / 1800 UTC\nhttps://youtu.be/qlUSqQ8U8T8",
        "timestamp": "2022-05-09 15:31:05+00:00"
    },
    {
        "message": "China invited Argentina to attend the 2022 summits of the BRICS economic bloc of Brazil, Russia, India, China, and South Africa.\n\nArgentina’s ambassador says it's a step toward “formal entry” to the grouping, an alternative to the US-dominated financial system.\n\nhttps://multipolarista.com/2022/05/08/argentina-brics-china-invitation/",
        "timestamp": "2022-05-08 17:32:52+00:00"
    },
    {
        "message": "Inside Operation Gladio: How NATO supported Nazis and terrorists\n\nYou can download the podcast here: \nhttps://soundcloud.com/multipolarista/operation-gladio-nato-nazis-terrorists",
        "timestamp": "2022-05-06 21:29:42+00:00"
    },
    {
        "message": "Multipolarista host Benjamin Norton is joined by journalist Asa Winstanley to discuss Operation Gladio, the NATO \"stay behind\" networks in which the CIA and other Western intelligence agencies recruited, armed, and trained former Nazis, other fascists, and right-wing terrorists to wage a war on the left:\n\nhttps://www.youtube.com/watch?v=UPhFCAI4SnQ",
        "timestamp": "2022-05-06 20:47:31+00:00"
    },
    {
        "message": "While it wages a proxy war on Russia in Ukraine, the US-led NATO military alliance plans to encircle China and expand into the Asia-Pacific region, collaborating with Japan, South Korea, Australia, and New Zealand.\n\nhttps://multipolarista.com/2022/04/09/nato-asia-pacific-china-russia/",
        "timestamp": "2022-05-05 14:54:45+00:00"
    },
    {
        "message": "Brazil’s left-wing leader Lula da Silva says if he wins the 2022 presidential elections, “we are going to create a currency in Latin America,” called the Sur (\"South\"), to combat “the dependency on the dollar”\n\nhttps://multipolarista.com/2022/05/04/brazil-lula-latin-america-currency-us-dollar/",
        "timestamp": "2022-05-04 18:58:48+00:00"
    },
    {
        "message": "US Immigration and Customs Enforcement (ICE) detained roughly 250,000 people in 200 jails in 2021, using brutal tactics to repress immigrants. This violent apparatus continues to grow under President Joe Biden.\n\nhttps://multipolarista.com/2022/04/21/biden-expanding-ice-cbp-immigration/",
        "timestamp": "2022-05-04 16:10:56+00:00"
    },
    {
        "message": "We spoke with a Mexican professor about how the progressive government of President AMLO nationalized lithium and reversed privatization of oil by corrupt past neoliberal leaders.\n\nhttps://multipolarista.com/2022/04/29/mexico-nationalized-lithium-amlo/",
        "timestamp": "2022-05-04 16:10:08+00:00"
    },
    {
        "message": "CNN and the New York Times echoed a blatant lie from the Department of Homeland Security, falsely claiming it does not monitor Americans. DHS has for years spied on US journalists and protesters.\n\nhttps://multipolarista.com/2022/05/03/cnn-ny-times-dhs-spying-americans/",
        "timestamp": "2022-05-03 18:55:47+00:00"
    },
    {
        "message": "The Washington Post – owned by billionaire oligarch Jeff Bezos, who has CIA and Pentagon contracts – has called for censoring Chinese news outlets on social media, while praising Silicon Valley for purging Russian publications.\n\nhttps://multipolarista.com/2022/04/13/washington-post-censor-chinese-russian-media/",
        "timestamp": "2022-05-01 17:36:03+00:00"
    },
    {
        "message": "A German EU official claimed Russians don’t value human life and thus aren’t Europeans. The ex NATO researcher was echoing a centuries-old colonialist trope used to justify genocide of Indigenous peoples, US war on Vietnam, and Israeli occupation of Palestine.\n\nhttps://multipolarista.com/2022/04/15/german-eu-official-russians-dont-value-life/",
        "timestamp": "2022-05-01 17:34:48+00:00"
    },
    {
        "message": "The proxy war in Ukraine threatens to drag the Balkans into a larger regional conflict, as the US, EU, and NATO militarize Bosnia and increase pressure on Serbia, and Ukrainian drones crash in Croatia.\n\nhttps://multipolarista.com/2022/04/27/ukraine-nato-eu-militarize-balkans/",
        "timestamp": "2022-05-01 17:34:14+00:00"
    },
    {
        "message": "Nicaragua’s Sandinista government expelled the US-dominated OAS and expropriated its office building, where it will now create a public “Museum of Shame” to educate visitors about imperialist crimes committed against Latin America.\n\nhttps://multipolarista.com/2022/04/28/nicaragua-oas-museum-shame/",
        "timestamp": "2022-05-01 17:33:40+00:00"
    },
    {
        "message": "The authoritarian Department of Homeland Security (DHS) that oversaw the War on Terror created a “Disinformation Governance Board,” led by anti-Russia information warrior Nina Jankowicz, who ran regime-change ops at a CIA front, smears independent anti-war US media outlets as “Russian disinfo,” and called WikiLeaks “scum.”\n\nhttps://multipolarista.com/2022/04/29/us-dhs-disinformation-nina-jankowicz/",
        "timestamp": "2022-05-01 17:33:14+00:00"
    },
    {
        "message": "We were forced to create a new Telegram channel. Follow Multipolarista here for the latest news on US imperialism and the transition to a multipolar world.",
        "timestamp": "2022-05-01 17:33:01+00:00"
    }
]