[
    {
        "message": "Top Ukrainian ‘fact-checker’ arrested for assault on Grayzone contributor\n\nMarko Suprun, an influential NATO state-funded Ukrainian ‘fact-checker’ with close ties to Nazi activists, was taken into police custody in Washington, DC, after assaulting a contributor to The Grayzone at an event hosted by a neocon Beltway think tank.\n\nContinue reading TheGrayzone.com",
        "timestamp": "2024-04-29 17:01:32+00:00"
    },
    {
        "message": "Bringing it all back home - The Grayzone live\n\nMax Blumenthal and Aaron Mate discuss the importance of Columbia U's Gaza encampment, the pro-Israel backlash against the growing protest movement, and apparent efforts to sabotage the demonstrations from within. They will also cover the vote by US Congress to spend $90 billion on disastrous conflicts in two theaters and a potential new one against China.\n\nWatch on YouTube",
        "timestamp": "2024-04-24 17:41:45+00:00"
    },
    {
        "message": "Tony Blinken stonewalls The Grayzone on Gaza & int'l law\n\nThe Grayzone's Liam Cosgrove challenges Secretary of State Tony Blinken over his refusal to address whether the Geneva Conventions applies to Israel's assault on the besieged Gaza Strip.\n\nOn July 13, 2022, Antony Blinken condemned the Russian government for violating the Fourth Branch of the Geneva Convention.\n\nIn response to Cosgrove, he refused to say whether these laws apply to the people of Gaza.",
        "timestamp": "2024-04-23 01:08:41+00:00"
    },
    {
        "message": "The Grayzone's Liam Cosgrove challenges the State Department on the Biden administration's continued support for Benjamin Netanyahu given the Israeli PM's history of lying to goad the US into war with Iraq and Iran.",
        "timestamp": "2024-04-20 01:26:20+00:00"
    },
    {
        "message": "UK insurers refuse to pay Nord Stream because blasts were ‘government’ backed\n\nThe legal team representing high-powered insurers Lloyd’s and Arch says that since the Nord Stream explosions were “more likely than not to have been inflicted by… a government,” they have no responsibility to pay for damages to the pipelines. To succeed with that defense, the companies will presumably be compelled to prove, in court, who carried out those attacks. \n\nBY WYATT REED\n\nContinue reading TheGrayzone.com",
        "timestamp": "2024-04-19 20:13:21+00:00"
    },
    {
        "message": "Facebook designates Grayzone journalist Kit Klarenberg a ‘dangerous individual’\n\nThe notoriously intelligence-friendly social media network appears to have imposed a ban on posting a recent report by Kit Klarenberg, and is automatically restricting users who re-publish his work.\n\nContinue reading TheGrayzone.com",
        "timestamp": "2024-04-18 15:50:03+00:00"
    },
    {
        "message": "The payback - The Grayzone live\n\nMax Blumenthal and Aaron Mate cover the Iranian military's direct retaliation against Israel's brazen attack on its consular facility in Syria, and its role in shifting the strategic calculus in the region.\n\nWatch on YouTube",
        "timestamp": "2024-04-16 12:09:45+00:00"
    },
    {
        "message": "Nicaraguan lawyer and diplomat Carlos Argüello Gómez speaks to The Grayzone about his case against the German government for its facilitation of Israel’s genocide in the besieged Gaza Strip, its potentially historic implications, and its similarities to the successful case he argued for the ICJ in 1986 which brought massive penalties against the United States for its illegal dirty war on Nicaragua at the time.\n\nRead the full transcript",
        "timestamp": "2024-04-15 18:07:06+00:00"
    },
    {
        "message": "Israel is exporting its genocide regime. Who will stop them?\nThe Grayzone's Max Blumenthal lays out the stakes of the regional war centered in Gaza, and the frightening long term objectives of the Israeli project.\nWatch on YouTube",
        "timestamp": "2024-04-15 00:09:49+00:00"
    },
    {
        "message": "The escalation ladder,  w/ Mohammad Marandi - The Grayzone live\n\nIranian academic and analyst Mohammad Marandi joins Max Blumenthal and Aaron Mate live to discuss the repercussions of Israel's brazen attack on Iran's embassy in Syria. How will Iran respond?\n\nWatch on YouTube",
        "timestamp": "2024-04-10 15:26:46+00:00"
    },
    {
        "message": "Ecuador on the brink of social collapse\n\nAfter 7 years of austerity measures and a rise of corruption in a weakened state, Ecuador is now on the brink of social collapse.\n\nInternational crime corporations control hundreds of criminal bands that work as contractors, and allow these cartels to control most of the continent.\n\nMeanwhile, Ecuador's US-backed President Daniel Noboa is imposing de facto martial law while violating international law to crack down on his political opponents, most recently with the arrest of former VP Jorge Glas inside the Mexican embassy in Quito.\n\nPart One in a documentary series for TheGrayzone.com \n\nWatch on YouTube",
        "timestamp": "2024-04-08 09:20:10+00:00"
    },
    {
        "message": "Meet Centuria, Ukraine’s Western-trained neo-Nazi army\n\nA uniquely Ukrainian strain of Neo-Nazism is spreading throughout Europe, which openly advocates violence against minorities while seeking new recruits. With Kiev’s army collapsing and a narrative of Western betrayal gaining currency, the horror inflicted on residents of Donbas for a decade could very soon be coming to a city near you.\n\nBY KIT KLARENBERG\n\nContinue reading",
        "timestamp": "2024-04-08 07:59:48+00:00"
    },
    {
        "message": "The Grayzone live: Ghost kitchen\n\nMax Blumenthal and Aaron Mate discuss Israel's massacre of aid workers from the US-supported World Central Kitchen, its attack on an Iranian consular facility in Damascus, and the horrifying revelations of its massacre at al-Shifa hospital - all on the same day.\n\nWatch on YouTube",
        "timestamp": "2024-04-02 16:23:01+00:00"
    },
    {
        "message": "Israeli propagandist behind Hamas ‘mass rape’ narrative exposed as grifter, fraud\n\nCochav Elkayam-Levy, the Israeli lawyer at the center of the campaign accusing Hamas of systematic sexual violence on October 7, now stands accused by Israeli media of scamming donors and spreading misinformation. The allegations appeared just days after Elkayam-Levy received the prestigious Israel Prize.\n\nContinue reading TheGrayzone.com",
        "timestamp": "2024-03-27 20:12:35+00:00"
    },
    {
        "message": "US State Dept’s favorite celebrity chef builds Gaza aid dock with stolen rubble\n\nAfter years of accusing Russia of using food as a weapon in its conflict with Ukraine, State Department “culinary ambassador” José Andrés is working with the Israeli government to supplant UNRWA as the main supplier of aid to northern Gaza.\n\nBY WYATT REED AND MAX BLUMENTHAL\n\nContinue reading TheGrayzone.com",
        "timestamp": "2024-03-27 20:04:55+00:00"
    },
    {
        "message": "🔴 Live now\nProgrammed to kill - The Grayzone live\n\nMax Blumenthal and Aaron Mate discuss the worst terror attack in Moscow in two decades, and who or what could be behind it. They will then cover the latest from Gaza, where famine looms as Israel finds itself in a military and political boondoggle. They will also discuss Jeremy Loffredo's shocking video on the grassroots Israeli aid blockade, and Hekmat Aboukhater's undercover report exposing the anti-Syria lobby's latest push in Congress.\n\nWatch on YouTube",
        "timestamp": "2024-03-25 15:49:10+00:00"
    },
    {
        "message": "Kosovo War at 25: Blair’s secret invasion plot to ‘topple Milosevic’ revealed\n\nTop secret papers reviewed by The Grayzone reveal Tony Blair demanded strikes on civilian targets in Yugoslavia days before NATO attacked them. While the UK military acknowledged a NATO strike on Hotel Jugoslavia would mean inflicting “some civilian casualties,” it insisted the deaths were “worth the cost.”\n\nBY KIT KLARENBERG\n\nRead TheGrayzone.com",
        "timestamp": "2024-03-24 17:28:45+00:00"
    },
    {
        "message": "'Kill them all': inside the Israeli blockade on Gaza aid\n\nJournalist Jeremy Loffredo goes inside the grassroots Israeli campaign to block desperately needed aid to the besieged Gaza Strip and elicits the shockingly candid views of the Jewish Israeli nationalists manning the barricades. \n\nSetting out on a bus caravan through illegal Jewish settlements in the occupied West Bank, Loffredo arrives at the Kerem Shalom crossing to Gaza, filming Israeli citizens as they physically block trucks loaded with flour and other essential goods. There, a reservist who served in the military assault on Gaza confesses to an array of war crimes, including blowing up the offices of UN centers dedicated to providing food to the local population.\n\nLoffredo then joins nationalists on a march toward Gaza, where they hope to establish new settlements after the population is violently driven out.\n\nThis original Grayzone report was produced thanks to viewers like you.\n\nWatch on YouTube",
        "timestamp": "2024-03-22 10:31:59+00:00"
    },
    {
        "message": "Inside the anti-Syria lobby’s Capitol Hill push for more starvation sanctions\n\nA week from the 13th anniversary of the US-backed Syrian dirty war, the American Coalition for Syria held its annual day of advocacy in Washington DC. I went undercover into meetings with Senate policy advisors and witnessed the lobby’s cynical campaign to starve Syria into submission.\n\nBY HEKMAT ABOUKHATER\n\nContinue reading TheGrayzone.com",
        "timestamp": "2024-03-21 04:34:39+00:00"
    },
    {
        "message": "I was banned from Elon’s ‘free speech’ X app for offending power\n\nFollowing years of pressure from Israel lobbyists and British spooks, I was finally banned by Twitter/X. What does my removal say about Elon Musk, who flaunts his opposition to censorship, while promising to build an “everything app” where you could lose access to banking and messaging for violating dubious speech codes?\n\nBY KIT KLARENBERG\n\nContinue reading at TheGrayzone.com",
        "timestamp": "2024-03-20 04:50:54+00:00"
    },
    {
        "message": "🔴 Starting Now\nThe Grayzone live: \nFriends of Israel\n\nMax Blumenthal and Aaron Mate discuss the deepening Gaza catastrophe and political rifts between the faltering Biden administration and an increasingly confident Netanyahu.\n\nWatch on YouTube",
        "timestamp": "2024-03-18 20:44:21+00:00"
    },
    {
        "message": "Sweden closing Nordsteam investigation a shocking coverup, investigator tells Grayzone\n\nWatch the Grayzone’s Max Blumenthal interview Swedish engineer Erik Andersson, who led the first independent investigation to the site of the Nordstream pipelines blast sites, on the Swedish government’s sudden closing of the investigation into the terror attack on the eve of joining NATO.\n\nAndersson also addresses US meddling in Swedish politics, and the potential consequences of Stockholm surrendering its traditional neutrality to the anti-Russian alliance.\n\nFull interview here.",
        "timestamp": "2024-03-16 01:52:39+00:00"
    },
    {
        "message": "Congressmen nailed on 'River to the Sea' hypocrisy\n\nGrayzone contributor Liam Cosgrove confronts members of Congress on their formal condemnation of the phrase, \"from the river to the sea,\" which calls for Palestinian liberation, while they support an Israeli government which officially rejects the existence of a Palestinian nation between... the river and the sea. Obscene levels of hypocrisy ensue.",
        "timestamp": "2024-03-16 01:02:15+00:00"
    },
    {
        "message": "The Genocide Democrats: Max Blumenthal speaks at WNDC\n\nAt the Woman's National Democratic Club in Washington DC on March 7, 2024, The Grayzone's Max Blumenthal discussed the crisis within the Democratic Party as the party grassroots revolts against President Joe Biden's vehement support for Israel's rampage in the besieged Gaza Strip, where at least 30,000 have been killed to date - mostly women and children. \n\nBlumenthal points the finger at the Democratic Party establishment for crushing any and all iterations of antiwar politics, and illustrates how its most prominent figures have been bought off by the Israel lobby. \n\nWatch on YouTube \n\nRead TheGrayzone.com",
        "timestamp": "2024-03-11 11:10:07+00:00"
    },
    {
        "message": "Criminalizing Dissent: The Battle between Paul Mason and George Galloway",
        "timestamp": "2024-03-08 17:36:31+00:00"
    },
    {
        "message": "Heartbreaking Loss: A Gaza Journalist's Tragic Tale of Survival and Devastation",
        "timestamp": "2024-03-08 17:30:39+00:00"
    },
    {
        "message": "Western media concocts ‘evidence’ UN report on Oct 7 sex crimes failed to deliver\n\nWestern media promoted a UN report as proof Hamas sexually assaulted Israelis. Yet the report’s authors admitted they couldn’t locate a single victim, suggested Israeli officials staged a rape scene, and denounced “inaccurate forensic interpretations.”\n\nBY WYATT REED\n\nContinue reading at TheGrayzone.com",
        "timestamp": "2024-03-07 11:29:36+00:00"
    },
    {
        "message": "Leaked Israel lobby presentation urges US officials to justify war on Gaza with ‘Hamas rape’ claims\n\nThe Grayzone has obtained slides from a confidential Israel lobby presentation based on data from Republican pollster Frank Luntz. They contain talking points for politicians and public figures seeking to justify Israel’s assault on the Gaza Strip.\n\nBY MAX BLUMENTHAL\n\nContinue reading at TheGrayzone.com",
        "timestamp": "2024-03-07 03:55:07+00:00"
    },
    {
        "message": "Assange’s brother: “Julian could receive the death penalty” if extradited\n\nThe Grayzone’s Max Blumenthal interviews Gabriel Shipton, film producer and brother of Julian Assange, during his latest visit to Washington DC, where he was pushing lawmakers to oppose the Biden administration’s prosecution of the jailed Wikileaks publisher.\n\nBY MAX BLUMENTHAL\n\nContinue reading at TheGrayzone.com",
        "timestamp": "2024-03-05 23:01:49+00:00"
    },
    {
        "message": "Poetic headline,\ndistracting from genocide,\nNew York Times fails again.",
        "timestamp": "2024-03-05 03:34:48+00:00"
    },
    {
        "message": "Unlike The Intercept, Al Jazeera credits its sources.",
        "timestamp": "2024-03-04 21:10:27+00:00"
    },
    {
        "message": "https://x.com/aaronjmate/status/1764314373139365969?s=20",
        "timestamp": "2024-03-04 20:45:34+00:00"
    },
    {
        "message": "https://twitter.com/MaxBlumenthal/status/1764750993437204595",
        "timestamp": "2024-03-04 20:42:58+00:00"
    },
    {
        "message": "Black, white and red all over\nThe Grayzone live\n\nMax Blumenthal and Aaron Mate will cover the fallout from Israel's horrific flour massacre in northern Gaza, the continuing scandal over the New York Times' October 7 reporting, and much more.\n\nWatch on YouTube",
        "timestamp": "2024-03-01 20:55:42+00:00"
    },
    {
        "message": "Secret cable: CIA orchestrated Haiti’s 2004 coup\n\nA classified diplomatic cable obtained by The Grayzone reveals the role of a veteran CIA officer in violently overthrowing Haiti’s popular President Jean-Bertrand Aristide in 2004. \n\nBY JEB SPRAGUE AND KIT KLARENBERG\n\nContinue reading on TheGrayzone.com",
        "timestamp": "2024-03-01 20:03:15+00:00"
    },
    {
        "message": "Posing Dead Bodies for Photoshoots: Exposing the Shocking Fundraising Tactics of a zionist Charity",
        "timestamp": "2024-03-01 00:40:03+00:00"
    },
    {
        "message": "A Jewish Death Cult: Unveiling the Truth about Zionism",
        "timestamp": "2024-02-29 23:36:05+00:00"
    },
    {
        "message": "Our Complicity in the Mass Murder Campaign in Gaza",
        "timestamp": "2024-02-29 23:22:45+00:00"
    },
    {
        "message": "Russian Espionage on the US-Mexico Border: The Hypothetical Nightmare",
        "timestamp": "2024-02-27 22:57:16+00:00"
    },
    {
        "message": "Debunking the Widely Parroted Article on Sexual Violence: Challenging Fake News",
        "timestamp": "2024-02-27 22:55:29+00:00"
    },
    {
        "message": "The Desperation in Gaza: Unveiling the Suicide Crisis Amidst the Genocide",
        "timestamp": "2024-02-27 22:53:45+00:00"
    },
    {
        "message": "Israel's Role in the Gaza Humanitarian Crisis",
        "timestamp": "2024-02-27 22:46:23+00:00"
    },
    {
        "message": "The Ukraine Proxy War and its Connection to Syria",
        "timestamp": "2024-02-27 22:43:28+00:00"
    },
    {
        "message": "Ukraine's Devastating Loss in Avdivka",
        "timestamp": "2024-02-27 22:40:29+00:00"
    },
    {
        "message": "RIP Aaron Bushnell 🇵🇸",
        "timestamp": "2024-02-27 03:34:45+00:00"
    },
    {
        "message": "The Grayzone live: While Gaza Burns\n\nMax Blumenthal and Aaron Mate discuss the latest developments in the grinding Gaza war, including Israel's plans to attack Rafah, the incendiary protest at the Israeli embassy by one active duty US serviceman, and the deepening scandal at the New York Times over its discredited investigation into sexual assault by Hamas on October 7. They will also cover the fallout from Alexei Navalny's death and more.\n\nWatch on YouTube \nRead TheGrayzone.com",
        "timestamp": "2024-02-26 19:19:35+00:00"
    },
    {
        "message": "State Dept downplays reports of Israeli soldiers sexually abusing, slaughtering Palestinian women\n\nWhile falsely claiming to have received “independent confirmation” of since-debunked assertions of mass rape by Hamas, the State Department’s spokesman said he “cannot independently verify” allegations by UN human rights experts that Israeli soldiers have sexually abused and systematically slaughtered Palestinian women and girls in the besieged Gaza Strip.\n\nBY WYATT REED\nContinue reading TheGrayzone.com",
        "timestamp": "2024-02-24 16:07:27+00:00"
    },
    {
        "message": "New Israeli report alleging ‘systematic and intentional rape’ by Hamas relies on debunked Western media reports\n\nThe contents of the Israeli Association of Rape Crisis Center’s paper alleging “systematic” Hamas rape derive largely from discredited second-hand testimonies and debunked media reports. Among its most heavily cited sources is a dubious NY Times article that triggered a staff revolt at the paper.\n\nBY MAX BLUMENTHAL\nContinue reading TheGrayzone.com",
        "timestamp": "2024-02-24 16:03:59+00:00"
    },
    {
        "message": "◾US media melts down over Tucker-Putin interview.\n\n◾The Grayzone's Max Blumenthal and Aaron Mate discuss the overblown and at times insane reaction of US mainstream media to the widely anticipated interview between Tucker Carlson and Russian President Vladimir Putin in Moscow, Russia.\n\n@thegrayzonenews\n\n◾Follow:\nt.me/UkraineHumanRightsAbuses",
        "timestamp": "2024-02-22 12:53:47+00:00"
    },
    {
        "message": "BREAKING| @TheGrayzoneNews reports that according to a private letter by ADL it had obtained, the zionist organization blackmailed the BMG music company, threatening it to weaponize its Nazi past unless it terminated a major deal with Roger Waters.\n\n“Given the fact that your parent company, Bertelsmann Group, has made laudable and necessary efforts to repair its Nazi past, it would be deeply unfortunate to have those efforts continue to be tarnished by such hurtful and injurious conduct\", the letter read.",
        "timestamp": "2024-02-22 12:52:57+00:00"
    },
    {
        "message": "Exclusive: ADL pushed BMG to drop Roger Waters by threatening to weaponize company’s Nazi past\n\nThe Grayzone has obtained a private letter authored by ADL director Jonathan Greenblatt threatening to weaponize the Nazi past of the BMG music company unless executives terminated a major deal with Roger Waters. BMG has publicly denied Israel lobby influence on its decision to nix Waters’ contract.\n\nBY MAX BLUMENTHAL\nFEBRUARY 19, 2024\n\nRead on TheGrayzone.com",
        "timestamp": "2024-02-20 18:19:50+00:00"
    },
    {
        "message": "The Grayzone live: No One Uninvolved \n\nMax Blumenthal and Aaron Mate discuss the untimely death of Russian opposition leader Alexei Navalny, the US-Israeli assault on multilateral institutions seeking to prevent famine in Gaza, the renewal of US starvation sanctions on Syria, and the looming catastrophe in Rafah.\n\nWatch on YouTube \nRead TheGrayzone.com",
        "timestamp": "2024-02-18 01:11:23+00:00"
    },
    {
        "message": "Gaza women describe Israeli kidnapping, interrogations\n\nIn the latest Grayzone report from the ground in Gaza, 39-year-old mother Abier Mohammed Gheben describes how invading Israeli forces kidnapped her and subjected her to humiliation and violent threats as they interrogated her in captivity.\n\nIsrael has flaunted its mass abduction, public humiliation and torture of men of all ages across the Gaza Strip, but its abuse of Palestinian women has received less exposure.\n\nWatch on YouTube \nRead TheGrayzone.com\nInstagram, Twitter, Telegram",
        "timestamp": "2024-02-16 02:53:34+00:00"
    },
    {
        "message": "Max Blumenthal on Russell Brand on October 7 and the Censorship Industrial Complex\n\nIn part one of a long form discussion with Russell Brand, Max Blumenthal delves into the ongoing conflict in Israel-Palestine, focusing particularly on the thorough debunking he and his team have conducted regarding a recent New York Times report on the events of October 7th. They also explore the growing influence of the censorship industry complex driven by Big Tech and governments, and uncover how the FBI infiltrated lockdown protests.\n\nWatch on Rumble\n\nRead TheGrayzone.com\n@thegrayzonenews",
        "timestamp": "2024-02-15 04:21:27+00:00"
    },
    {
        "message": "The Grayzone live: Invented Peoples\n\nMax Blumenthal and Aaron Mate discuss Vladimir Putin's stemwinding interview with Tucker Carlson, the continuing blowback from Biden's Middle East policy, and the latest from the Gaza war.\n\nWatch on YouTube \n\nRead TheGrayzone.com",
        "timestamp": "2024-02-11 01:52:33+00:00"
    },
    {
        "message": "◾Biden bombs three nations in defense of Israel.\n\n◾The Grayzone's Max Blumenthal and Aaron Mate address the Biden administration's latest round of attacks on Yemen, Syria and Iraq following the deaths of three American soldiers at a secret desert base, supposedly in Jordan, and the twisted agenda behind the US strikes.\n\n@thegrayzonenews\n\n◾Follow:\nt.me/UkraineHumanRightsAbuses",
        "timestamp": "2024-02-10 05:46:56+00:00"
    },
    {
        "message": "UK steps up war on whistleblower journalism with new National Security Act\n\nUnder a repressive new act, British nationals could face prison for undermining London’s national security line. Intended to destroy WikiLeaks and others exposing war crimes, the law is a direct threat to critical national security journalism.\n\nBY KIT KLARENBERG\n\nContinue reading",
        "timestamp": "2024-02-09 22:11:00+00:00"
    },
    {
        "message": "Teaching class in Gaza without schools\n\nThe Grayzone meets Ahmad Al-Naami, a teacher in the besieged Gaza Strip, where most schools and nearly all universities have been systematically destroyed by the Israeli military. In a tent in Rafah''s newest refugee camp, Al-Naami finds a class of enthusiastic young students, eager to learn in defiance of their occupier's campaign of destruction.",
        "timestamp": "2024-02-07 23:23:25+00:00"
    },
    {
        "message": "A muralist's message of resistance on Gaza's ruins\n\nThe Grayzone meets Amal Abo Al-Sebah, a displaced Palestinian artist in the besieged Gaza Strip. We see Amal chronicle the destruction her neighbors endured and the resilience they have displayed through a series of colorful murals painted on the ruins of a home in the city of Rafah destroyed by an Israeli airstrike. \n\n\"I want to send a message to all Arab countries with this artwork,\" Amal said. \"A message that we're attached to this land and we're not leaving it.\"",
        "timestamp": "2024-02-07 23:15:59+00:00"
    },
    {
        "message": "Author of debunked NYT ‘Hamas r@pe’ report to share stage with Hillary Clinton\n\nThe reporter behind a discredited NY Times investigation alleging systematic sexual violence by Hamas on October 7 will appear alongside Hillary Clinton and key Biden foreign policy functionaries at a Columbia University event justifying Israel’s assault on Gaza.\n\nBY WYATT REED\n\nContinue reading",
        "timestamp": "2024-02-07 22:14:15+00:00"
    },
    {
        "message": "This video was deleted from Tiktok for 'hate speech.'",
        "timestamp": "2024-02-07 16:33:09+00:00"
    },
    {
        "message": "Banned from TikTok\nSee the reason why HERE\nFrom this Grayzone live",
        "timestamp": "2024-02-07 15:45:08+00:00"
    },
    {
        "message": "Old Yeller Politics\nFrom this Grayzone live",
        "timestamp": "2024-02-06 03:52:30+00:00"
    },
    {
        "message": "There's no Celebrity Campaign\nFrom this Grayzone live",
        "timestamp": "2024-02-06 03:51:24+00:00"
    },
    {
        "message": "Anti-zionist Comrades\nFrom this Grayzone live",
        "timestamp": "2024-02-06 03:48:16+00:00"
    },
    {
        "message": "The Grayzone live: Animal Planet\n\nMax Blumenthal and Aaron Mate discuss the twisted logic behind the Biden admin's latest round of strikes in Syria, Iraq and Yemen, and the growing political crises in US-backed proxies Israel and Ukraine as their military campaigns fail to deliver.\n\nWatch on YouTube",
        "timestamp": "2024-02-05 06:21:15+00:00"
    },
    {
        "message": "◾ Israeli settlers get away with murder.\n\n◾Max Blumenthal tells how Israeli settlers have previously murdered US citizens in the Occupied West Bank and the White House has done nothing about it.\n\n@thegrayzonenews\n\n◾Follow:\nt.me/UkraineHumanRightsAbuses",
        "timestamp": "2024-02-04 20:37:10+00:00"
    },
    {
        "message": "TikTok keeps censoring this\nvideo that mentions the\nADL.\nPlease promote it:\nhttps://vm.tiktok.com/ZM6ne71NY/",
        "timestamp": "2024-02-02 21:39:30+00:00"
    },
    {
        "message": "The Media Lies: The MSM's Role in Shaping Perception to Promote Genocide\n\nFrom Grayzone Live",
        "timestamp": "2024-02-02 06:09:58+00:00"
    },
    {
        "message": "The Gaza Holocaust Redux: A Journalist's Perspective\n\nFrom Grayzone Live",
        "timestamp": "2024-02-02 06:02:52+00:00"
    },
    {
        "message": "Twitter Does Not Prevent Genocide \n\nFrom Grayzone Live",
        "timestamp": "2024-02-02 05:53:58+00:00"
    },
    {
        "message": "Join us over on TikTok:\nhttps://www.tiktok.com/@thegrayzone.com",
        "timestamp": "2024-01-30 22:10:00+00:00"
    },
    {
        "message": "One of the Biggest Media Scandals of our Time:  Fabrications and Plagiarism to Justify Genocide\nWatch full video",
        "timestamp": "2024-01-30 20:53:58+00:00"
    },
    {
        "message": "Debunking False Claims by The New York Times and Investigating the Witness Testimonies\nWatch full video",
        "timestamp": "2024-01-30 20:31:02+00:00"
    },
    {
        "message": "The Hill covers The New York Times pulling a podcast episode on sexual violence due to shoddy reporting, which The Grayzone had previously called out.\nWatch full video",
        "timestamp": "2024-01-30 20:26:29+00:00"
    },
    {
        "message": "🎉Major Grayzone Win! \nThe Hill: NYT Pulls HAMAS RAPE Story from Podcast Over INTERNAL TURMOIL Over SHODDY Reporting: Max Blumenthal\nEditor at The Grayzone Max Blumenthal weighs in on reporting that The New York Times podcast, \"The Daily\" tabled an episode of the podcast on Oct. 7 set to air earlier this month.",
        "timestamp": "2024-01-30 20:02:27+00:00"
    },
    {
        "message": "◾Trump's Policies and Their Impact: A Comprehensive Analysis.\n\n◾Explore the impact of Trump's policies on Palestinian refugees, Jerusalem, Ukraine, Russia, Iran, and Syria. Understand the consequences of his decisions and the tensions they have caused. Discover why some key figures who once supported him now openly oppose him. Dive into the complexities of Trump's foreign policy. Full video here.\n\n@thegrayzonenews\n\n◾Follow:\nt.me/UkraineHumanRightsAbuses",
        "timestamp": "2024-01-30 17:42:00+00:00"
    },
    {
        "message": "◾The Impact of Holocaust on the Palestinians: Exposing Lies and Mobilizing for Justice:\n\n◾Explore the indirect victimization of Palestinians due to the Holocaust and the manipulation of lies to incite violence against Palestinians. Discover the truth behind these distortions and the efforts to raise awareness for justice. Full video here.\n\n@thegrayzonenews\n\n◾Follow:\nt.me/UkraineHumanRightsAbuses",
        "timestamp": "2024-01-30 17:41:44+00:00"
    },
    {
        "message": "Watch the full livestream",
        "timestamp": "2024-01-28 09:55:11+00:00"
    },
    {
        "message": "Watch the full livestream",
        "timestamp": "2024-01-28 07:58:01+00:00"
    },
    {
        "message": "Watch the full livestream",
        "timestamp": "2024-01-28 01:58:01+00:00"
    },
    {
        "message": "Ansarallah spokesman, Mohammed Al-Bukhaiti, interviewed by Max Blumenthal. \nWatch the full video.",
        "timestamp": "2024-01-28 00:57:09+00:00"
    },
    {
        "message": "Watch the full livestream",
        "timestamp": "2024-01-27 22:49:52+00:00"
    },
    {
        "message": "Does Tony Blinken have a conscience?\n\nThe Grayzone's Max Blumenthal and Aaron Mate cover Secretary of State Tony Blinken's hand-wringing over mass civilian deaths in Gaza during his appearance at Davos.",
        "timestamp": "2024-01-27 01:55:37+00:00"
    },
    {
        "message": "Kamala's husband feigns oppression at Davos\n\nThe Grayzone's Max Blumenthal and Aaron Mate discuss the absurd scene of Vice President Kamala Harris's millionaire husband, Douglas Emhoff, complaining about antisemitic oppression on a World Economic Forum panel at the exclusive Swiss ski resort of Davos.",
        "timestamp": "2024-01-27 01:35:21+00:00"
    },
    {
        "message": "Israeli mother slams 'IDF' for 'gassing' soldier son\n\nThe Grayzone's Max Blumenthal and Aaron Mate discuss the latest incident of friendly fire killing by Israel's military in Gaza, as a mother accuses the 'IDF' of asphyxiating her captive soldier son with poison gas in order to flush out a tunnel.",
        "timestamp": "2024-01-27 01:28:37+00:00"
    },
    {
        "message": "The 'IDF': where genocide is a funny game\n\nThe Grayzone's Max Blumenthal and Aaron Mate review new and incredibly freakish Israeli military social media videos in which soldiers dress as dinosaurs while shelling of densely populated civilian areas. Is genocide a game to them?",
        "timestamp": "2024-01-27 01:08:29+00:00"
    },
    {
        "message": "Antiwar Israelis face jail, terrifying repression for speaking out\n\nJournalist Jeremy Loffredo reports from inside Israel, where the country's tiny minority of antiwar Jewish citizens face harsh repression, ugly social consequences, and even jail time for speaking out against the military campaign in Gaza. Loffredo interviews several Israeli dissidents about the violence they have experienced since October 7, and the climate of state-enforced fear that has engulfed their society.",
        "timestamp": "2024-01-27 00:34:37+00:00"
    },
    {
        "message": "The Grayzone live: Ordered to prevent genocide\n\nInternational legal expert and ex-UN Office of Human Rights Commissioner whistleblower Craig Mokhiber joins the Grayzone's Aaron Mate and Max Blumenthal to discuss the ICJ's landmark ruling ordering Israel to prevent genocide by its forces in the besieged Gaza Strip.",
        "timestamp": "2024-01-26 19:48:33+00:00"
    },
    {
        "message": "Max Blumenthal responds to the Washington Post's libelous attack on The Grayzone. \n(2 of 2) (Part 1)\n\nOur phone call – which she solicited – was on the record. Why did she neglect to quote any of it in her article about us?\n\nAnd why did Washington Post editors assign an article on an emotionally fraught topic like October 7 to an ideologically committed, anti-Palestinian Zionist like Elizabeth Dwoskin, who has denigrated Palestinians as nationless \"desert Bedouins\"?\n\nCan you describe the nature of your relationship with the Israeli government? Does the Washington Post route stories on the Israeli assault on Gaza through its Tel Aviv bureau, as CNN does – thus placing reporters at the mercy of the Israeli military censor? Would the Washington Post honor a request by a Russian government official to retroactively censor remarks which were “not authorized for publication\"?\n\nFinally, why has the Washington Post failed to report on the scandal of friendly fire deaths on October 7, while Israeli mainstream media is publishing shocking investigations on the topic? For example, the most popular outlet in Israel, Yediot Ahronoth, has revealed the following:\n\n-Israel ordered all combat units on October 7 to stop Palestinian fighters from returning to Gaza with captives \"at all costs\".\n-This was an order \"to use the 'Hannibal Procedure,' although without clearly mentioning this explicit name\". -70 vehicles came under attack \"by a combat helicopter, an anti-tank missile or a tank, and at least in some cases everyone in the vehicle was killed.\" -\"It is not clear at this time how many of the abductees were killed due to the activation of this command\"\n\nWhy, when Israeli family members of hostages are openly accusing Israel's military of killing their loved ones under the notorious Hannibal Directive, is the Washington Post smearing the independent journalists who helped break this titanic political scandal?\n\nAs I attempted to explain to Dwoskin during our public call, the aforementioned errors and omissions help explain why so many Americans have turned away in disgust from corporate outlets like the Washington Post, and are instead tuning into independent journalistic ventures like The Grayzone.",
        "timestamp": "2024-01-25 04:39:55+00:00"
    },
    {
        "message": "Max Blumenthal responds to the Washington Post's libelous attack on The Grayzone. \n(1 of 2) (Part 2)\n\n[In response to Elizabeth Dwoskin's tweet,] I sent the following note to WaPo exec editor @SallyBuzbee and her colleagues demanding corrections of Dwoskin's errors and an explanation of journalistic malpractice in her malicious smear of The Grayzone. Unsurprisingly, no response.\n\nI am the founder and editor-in-chief of TheGrayzone.com. Our publication came under attack in the Washington Post by your \"Silicon Valley correspondent\" Elizabeth Dwoskin, who slanderously accused us of inspiring \"a growing movement with ties to Holocaust denial [which] is effacing history in real-time\" related to the events of October 7.\n\nBecause Dwoskin's article contained so many demonstrably false statements and journalistically irresponsible omissions, we have published the following response on our site.\n\nWe are writing to ask for your cooperation in helping us address the following questions, and to issue corrections:\n\nDwoskin's article falsely claims, \"articles on Electronic Intifada and Grayzone exaggerated these claims to suggest that most Israeli deaths were caused by friendly fire, not Hamas.\"\n\nIn fact, we have not claimed that most Israeli deaths on October 7 were caused by friendly fire, either on our website, on social media, or in public discussions of the event. If this statement by Dwoskin can not be sourced to anything we wrote or said, it must be publicly retracted.\n\nDwoskin falsely claims, \"the [Israeli] army has said it will investigate\" friendly fire deaths on October 7. To prove her point, she links to the following Associated Press article, which states, \"The military has said it will conduct a thorough investigation of everything that went wrong on Oct. 7 and the days that followed once its war on Hamas is over.\"\n\nHowever, Israeli Prime Minister Benjamin Netanyahu insists the war must continue until the end of 2024. Further, the AP article goes on to state, \"But that’s not soon enough for some family members of 13 people killed [by Israeli friendly fire] during a violent standoff between Hamas and Israeli security forces at Kibbutz Be’eri, along the Gaza border.\"\n\nIn other words, the Israeli military has not announced any concrete plans to investigate friendly fire deaths. On the contrary, the families of Israeli victims of IDF friendly fire in Kibbutz Beeri on October 7 have been stonewalled, and they are furious about it.\n\nDwoskin's claim is therefore false – debunked by the very article she linked to – and must be corrected.\n\nDwoskin's article relies heavily on \"research\" by the National Contagion Research Institute (NCRI) and its founder, Joel Finkelstein. She failed to mention that the NCRI is formally partnered with the Anti-Defamation League (see attachment), a pro-Israel lobbying organization that previously employed Finkelstein as a research fellow. According to Joel Finkelstein's LinkedIn profile, he was simultaneously a research fellow with the ADL and running NCRI between December 2018 and October 2020. See here.\n\nWhy was the shadowy NCRI's organizational affiliation with a notoriously censorious pro-Israel pressure group not acknowledged to readers of the Washington Post? Are your readers not entitled to transparency about the ulterior sectarian agendas of the supposed experts cited by your reporters?\n\nIn a public phone conversation which Dwoskin solicited with me, I and my colleague, Aaron Mate, challenged Dwoskin's claims about our \"minimizing\" of atrocities on October 7. We also questioned her about her ideological dedication to Zionism and the state of Israel – an obvious conflict of interest which contravenes the Washington Post's proclaimed dedication to objectivity.\n\nWhen we asked her about an editorial she wrote for the Columbia Spectator in which she justified Zionist colonization of Palestine on the grounds that Palestinians were \"desert Bedouins without a sense of national identity as we know it today,\" Dwoskin hung up on us.",
        "timestamp": "2024-01-25 04:39:54+00:00"
    },
    {
        "message": "Pro-Israel Washington Post reporter smears The Grayzone as Holocaust deniers in ADL-affiliated hit piece\n\nIn a falsehood-filled attack, the Washington Post’s ardently pro-Israel Elizabeth Dwoskin attacked The Grayzone’s factual reporting with “research” from a spook-infested outfit closely tied to the Anti-Defamation League.\n\nDwoskin also relied on an Israeli special forces vet heading a “Digital Iron Dome” campaign to censor social media criticism of Israel’s assault on Gaza.\n\nBY WYATT REED AND MAX BLUMENTHAL\n\nContinue reading",
        "timestamp": "2024-01-25 02:43:44+00:00"
    },
    {
        "message": "◾ Watch journalist Max Blumenthal from The Gray Zone debunk the lies told by the Israeli occupation about a October the 7 and spread by Western media and authorities.\n\n◾Follow:\nt.me/UkraineHumanRightsAbuses",
        "timestamp": "2024-01-24 16:22:37+00:00"
    },
    {
        "message": "FULL VIDEO: Ansarallah spokesman, Mohammed Al-Bukhaiti, interviewed by Max Blumenthal.",
        "timestamp": "2024-01-23 15:00:47+00:00"
    },
    {
        "message": "While Washington portrays Ansarallah as an irrational gang of terrorists, their spokesman, Mohammed Al-Bukhaiti, explains to Max Blumenthal the movement's objectives with moral clarity and political sophistication.\n\nTheir goal, he emphasized, is \"to stop the genocide... and to help get fuel and medicine into Gaza\"\n\nAl-Bukhaiti hits back at the US government's accusations of Iranian control of Ansarallah and appeals to the Western public to unite against Israel's genocide in Gaza.\n\nWatch the full interview on Telegram \n\nWatch the full interview on YouTube",
        "timestamp": "2024-01-23 03:44:05+00:00"
    },
    {
        "message": "🍃 ناشط اعلامي أمريكي:\nإنني أعتبر أن ما يفعله #أنصار_الله المعروفون في\nالولايات المتحدة بالحوثيين هو التدخل العسكري\n الأكثر أخلاقية في حياتي\n\nان مايفعله انصار الله حتى الان هو عمل غير دموي الى حد ادنى ويعطلون فقط حركة النقل البحري الاسرائيليه.",
        "timestamp": "2024-01-21 21:48:18+00:00"
    },
    {
        "message": "The Grayzone live: Then as farce \n\nMax Blumenthal and Aaron Mate discuss Biden's acknowledgment that strikes on Yemen are ineffectual but must continue, Blinken's Davos handwringing over Gaza, the political meltdown inside Israel as its military continues its genocidal rampage, and the ongoing collapse of Ukraine's military.\n\nWatch on YouTube",
        "timestamp": "2024-01-19 19:41:09+00:00"
    },
    {
        "message": "Born on October 7\n\nMeet Tofan Asfour, a baby born in the besieged Gaza Strip on October 7 – the date of the Al Aqsa Flood operation. He lives with his displaced family in a tent and his name is not officially registered. What kind of future will he have?",
        "timestamp": "2024-01-19 17:19:34+00:00"
    },
    {
        "message": "Michael Rapaport, who claims to speak for all Jews, visited The Grayzone studio.",
        "timestamp": "2024-01-19 06:56:12+00:00"
    },
    {
        "message": "US citizen Gonzalo Lira abandoned to die in Ukraine\n\nThe Grayzone's Max Blumenthal and Aaron Mate cover the shocking death of Gonzalo Lira, a US citizen imprisoned by Ukraine's regime for criticizing Kiev's war effort, and the Biden administration's abject refusal to intervene on his family's behalf.",
        "timestamp": "2024-01-18 23:43:40+00:00"
    },
    {
        "message": "Max Blumenthal confronts State Dept on genocide support\n\nThe Grayzone's Max Blumenthal and Aaron Mate discuss Blumenthal's latest intervention in the State Department briefing room, where he challenged Blinken spokesman on the Biden administration's rejection of the South African legal case against Israel at the International Court of Justice.",
        "timestamp": "2024-01-18 23:27:49+00:00"
    },
    {
        "message": "Israeli army gassed my son ‘like Auschwitz,’ mother of slain Israeli soldier says\n\nAn outraged Israeli mom has sparked an uproar after accusing the Israeli army of deliberately gassing her son to death while he was being held in a Gaza tunnel. Now she says the Israeli military had her son’s gravestone removed after her critical message went viral.\nHis killing follows a pattern of Israeli military attacks on Israeli captives in Gaza, raising questions about the existence of a friendly fire policy to prevent prisoner swaps.\n\nWYATT REED AND MAX BLUMENTHAL\n\nContinue reading",
        "timestamp": "2024-01-18 10:40:20+00:00"
    },
    {
        "message": "VIDEO: Life in Jerusalem under Israel’s military dictatorship\n\nJournalist Jeremy Loffredo visits the occupied East Jerusalem neighborhood of Sheikh Jarrah, a climate of unprecedented repression has descended since October 7. Loffredo documents settler terror attacks on businesses and speaks to local activists who tell him they fear arrest and beatings from Israeli police if they speak out against the assault on Gaza.",
        "timestamp": "2024-01-18 04:18:47+00:00"
    },
    {
        "message": "American citizen Gonzalo Lira dies from neglect in Ukrainian prison\n\nGonzalo Lira, a prominent commentator on the Russia-Ukraine war imprisoned in Ukraine for speech critical of the country’s government, has died after weeks of medical neglect by Ukrainian authorities.\n\nBY ALEXANDER RUBINSTEIN\n\nContinue reading",
        "timestamp": "2024-01-14 14:54:30+00:00"
    },
    {
        "message": "The Grayzone live: The Devil's Advocate\n\nMax Blumenthal and Aaron Mate discuss South Africa's case against Israel under the Genocide Convention, the US-UK strikes on Yemen, and more.\n\nWatch on YouTube",
        "timestamp": "2024-01-12 23:14:05+00:00"
    },
    {
        "message": "Twitter Space with Max Blumenthal covering \n\n- Israel killed their own people\n- Music festival \n- Fake mass rape\n- No babies were killed\n- Ethnic cleansing\n\nListen here\n3hr 56min - 10 Jan 2024",
        "timestamp": "2024-01-12 19:23:07+00:00"
    },
    {
        "message": "Max Blumenthal asked the State Dept how it could dismiss the mountain of evidence of genocide presented vs Israel by South Africa at the ICJ while accusing other nations of genocide for less\n\nHe also asked if Secretary Blinken was concerned he’d be prosecuted for his unusually direct role in supporting Israel’s atrocities in Gaza.",
        "timestamp": "2024-01-12 19:19:34+00:00"
    },
    {
        "message": "Screams without proof: questions for NYT about shoddy ‘Hamas mass rape’ report\n\nAfter dismantling a New York Times front page feature alleging “a broader pattern of gender-based violence on Oct. 7” by Hamas, The Grayzone is demanding answers from the paper for its journalistic malpractice.\n\nBY MAX BLUMENTHAL AND AARON MATÉ\nJANUARY 10, 2024\n\nContinue reading",
        "timestamp": "2024-01-10 21:54:48+00:00"
    },
    {
        "message": "Now with subtitles: Pro-Israel Washington Post reporter Elizabeth Dwoskin CONFRONTED LIVE on her plans to smear The Grayzone for our factual investigative reporting on October 7",
        "timestamp": "2024-01-10 18:52:48+00:00"
    },
    {
        "message": "Max Blumenthal: Neocon pet project Ayaan Hirsi Ali concocted key pieces of her life story to gain fame. She lied about her own family and misled Dutch authorities to gain citizenship, among many other deceptions. “Yeah, I made up the whole thing,” she admitted to Dutch media when confronted about the issue. \n\nAyaan's deceptions brought down the Dutch govt when they came to light in 2006, prompting her to flee across the Atlantic. Upon arriving to the US, she found a golden parachute at the American Enterprise Institute, the neocon think tank which nurtured the Bush administration's cabal of Iraq war criminals. \n\nShe now appears so confident that her own history has been buried, she's joined the plagiarism pile-on against Claudine Gay. The hypocrisy of Conservatism Inc. is staggering.\n\nRead the 2015 Grayzone article on Ayaan's deceptions.",
        "timestamp": "2024-01-10 04:22:09+00:00"
    },
    {
        "message": "Special Guest: Elizabeth Dwoskin, professional bootlicker and apartheid enthusiast for the Washington Post.",
        "timestamp": "2024-01-06 05:39:47+00:00"
    },
    {
        "message": "Dr. Setareh Sadeqi joined the livestream to discuss the terrorist attack against Iranian families that were gathered to commemorate the assassination of General Soleimani.",
        "timestamp": "2024-01-06 05:21:28+00:00"
    },
    {
        "message": "The Grayzone live: Harvard Man\n\nMax Blumenthal and Aaron Mate discuss the thuggish pro-Israel billionaire campaign to control academia, fallout from new Epstein revelations as Israel's most obscene propaganda stunt collapses, the wave of Israeli assassinations and bombings across the region, and the latest on the Ukraine proxy war.",
        "timestamp": "2024-01-05 20:31:27+00:00"
    },
    {
        "message": "Washington Post erases Israeli minister’s farfetched October 7 rape claim at his request\n\nA note explaining the retraction of the claim that Hamas militants had specific orders as to “which commander should rape which soldiers” indicates the publication censored itself at the behest of the Israeli government.\n\nBY WYATT REED\n\nContinue reading",
        "timestamp": "2024-01-03 22:37:09+00:00"
    },
    {
        "message": "D.E.I: This is who we are!\n\n...more accurately abbreviated as D.I.E.",
        "timestamp": "2024-01-03 20:16:57+00:00"
    },
    {
        "message": "The Nation smeared us for telling uncomfortable truth about October 7\n\nMax Blumenthal and Aaron Mate respond to underhanded attacks by Katha Pollit, a liberal feminist columnist for The Nation, who branded them as \"conspiracy theorists\" and sexual assault apologists for methodically debunking Israeli propaganda about the October 7 attacks.They also cover an article in The Intercept which advances Israel's propaganda efforts while claiming to counter them.\n\nFind more reporting at:\nThe Grayzone",
        "timestamp": "2024-01-03 00:46:10+00:00"
    },
    {
        "message": "Israeli military brass admits failures in Gaza\n\nMax Blumenthal and Aaron Mate examine a wave of statements by top ranking former Israeli military chiefs acknowledging heavy losses in Gaza and the illusory nature of total Hamas defeat. They also look at highly revealing video filmed on the battlefield by Palestinian resistance fighters.\n\nFind more reporting at:\nThe Grayzone",
        "timestamp": "2024-01-03 00:43:11+00:00"
    },
    {
        "message": "Genocidal intent: the case against Israel\n\nThe Grayzone's Max Blumenthal and Aaron Mate address the basis for South Africa's invocation of the Genocide Convention against the state of Israel, and discuss the clear evidence of genocidal intent expressed by Israeli military leadership.\n\nFind more reporting at: \nThe Grayzone",
        "timestamp": "2024-01-03 00:40:59+00:00"
    },
    {
        "message": "\"Gaza is Joe Biden's war and this is Vietnam\"\n\nMax Blumenthal and Aaron Mate discuss Joe Biden's fulsome embrace of Netanyahu and his military's bloody rampage in Gaza, its implications for his reelection hopes, and the pathetic efforts by congressional Democrats to stop him.\n\nFind more reporting at:\nThe Grayzone",
        "timestamp": "2024-01-03 00:34:38+00:00"
    },
    {
        "message": "US a direct party to war crimes in Gaza",
        "timestamp": "2023-12-30 22:44:11+00:00"
    },
    {
        "message": "Christmas Eve massacre in Gaza refugee camp\n\nThe Grayzone goes to the scene of one of the most heinous crimes Israel committed in the besieged Gaza Strip: the Christmas Eve massacre in Maghazi Refugee Camp, which left over 70 dead in a single airstrike. We speak to survivors of the attack and expose the scale of damage with exclusive drone footage.\n\nFind more reporting at:\nThe Grayzone",
        "timestamp": "2023-12-30 22:34:14+00:00"
    },
    {
        "message": "Returning to Gaza after kidnapping, torture by Israel\n\nThe Grayzone provides exclusive footage and interviews from Al-Najjar Hospital in the southern Gaza city of Rafah, where men who had been kidnapped from their homes and taken to an internment camp for torture by Israeli forces were returned.\n\nFind more reporting at:\nThe Grayzone",
        "timestamp": "2023-12-30 22:29:52+00:00"
    },
    {
        "message": "Is Israel stealing body parts from Gaza casualties?\n\nThe Grayzone visits a cemetery in the besieged Gaza Strip city of Rafah and documents the burial of Palestinians in a mass grave whose corpses had been stolen by the Israeli military. Gaza's Ministry of Health has accused Israel of harvesting body parts from these corpses. If true, this crime would fit within a well-documented pattern.\n\nFind more reporting at:\nThe Grayzone",
        "timestamp": "2023-12-30 22:20:58+00:00"
    },
    {
        "message": "They killed a 13 year old orphan girl in her hospital bed.",
        "timestamp": "2023-12-30 22:02:23+00:00"
    },
    {
        "message": "Ivy League insecurity",
        "timestamp": "2023-12-30 21:12:00+00:00"
    },
    {
        "message": "🔴 The Grayzone Live at 3PM EST \nThe torture never stops\nMax Blumenthal and Aaron Mate discuss the expansion of Israel's genocidal ground war in Gaza as mainstream outlets declare its far-reaching objectives to be delusional. They cover new October 7 atrocity allegations and malicious attacks by a columnist for The Nation against The Grayzone for debunking Israeli propaganda. And they will discuss the Biden administration's seeming concession to reality in Ukraine after months of abject failure.",
        "timestamp": "2023-12-29 19:13:09+00:00"
    },
    {
        "message": "Instagram just censored this video for \"hate speech,\" it had 750k views.",
        "timestamp": "2023-12-29 01:28:39+00:00"
    },
    {
        "message": "WATCH: What is wrong with Israelis?\n\nMax Blumenthal takes a searing look at the societal sickness that exploded into the open after October 7, as Israelis of all walks of life took to social media to mock the suffering and torture of Palestinians, and proudly broadcasted grotesque war crimes to the world.",
        "timestamp": "2023-12-28 04:11:48+00:00"
    },
    {
        "message": "Mass graves, grave questions: Britain’s secret Srebrenica role\n\nWidely ignored official reports and never-before-seen declassified files suggest shadowy British special forces operatives played a crucial role in one of the 20th century’s most notorious and controversial massacres.\n\nBY KIT KLARENBERG\n\nContinue reading",
        "timestamp": "2023-12-27 22:28:34+00:00"
    },
    {
        "message": "Phoney zionist aid organizations compete for the most outrageous atrocity propaganda stories. The prize for generating this fake news is millions of dollars in donations. \n\nWatch on Instagram",
        "timestamp": "2023-12-25 23:50:48+00:00"
    },
    {
        "message": "Exclusive drone footage and interviews reveal how Israel's siege is driving mass famine and homelessness among Gaza's refugee population\n\nWatch The Grayzone's latest report from inside Gaza in full here.",
        "timestamp": "2023-12-25 23:32:57+00:00"
    },
    {
        "message": "The Grayzone goes inside Gaza's Nasser Hospital moments after an Israeli tank shell struck its walls, and tells the heartbreaking story of the 13-year-old girl whom it killed: \n\nDounia Abu Mohsen, an orphan and amputee who had hoped to become a doctor to help people like herself",
        "timestamp": "2023-12-22 12:15:01+00:00"
    },
    {
        "message": "Ukrainian trial demonstrates 2014 Maidan massacre was false flag \n\nA massacre of protesters during the 2014 Maidan coup set the stage for the ouster of Ukraine’s elected president, Viktor Yanukovych. Now, an explosive trial in Kiev has produced evidence the killings were a false flag designed to trigger regime change.\n\nBY KIT KLARENBERG\n\nContinue reading",
        "timestamp": "2023-12-17 22:51:47+00:00"
    },
    {
        "message": "Registered Israeli foreign agent driving contrived campus antisemitism crisis\n\nLawsuits accusing top US universities of harboring antisemitism all originate from one source: a corporate law firm that fielded the pro-settler ex-US ambassador to Israel, and which was registered as a foreign agent of an Israeli principal as recently as 2021.\n\nThe firm now represents professional Israel lobby activists posing as victimized “Jewish students” and seeking to crush the free speech rights of Palestine solidarity activists.\n\nBY WYATT REED\n\nContinue reading",
        "timestamp": "2023-12-17 22:48:55+00:00"
    },
    {
        "message": "‘If I must die, let it be a tale’: a tribute to Refaat Alareer\n\n“I am going to use that marker to throw it at the Israeli soldiers, even if that is the last thing that I do,” Refaat Alareer vowed in one of his final interviews.\n\nBY MAX BLUMENTHAL\n\nContinue reading",
        "timestamp": "2023-12-09 07:13:19+00:00"
    },
    {
        "message": "Owner of Philly restaurant targeted in Palestine protests is official Israeli govt propagandist and Biden ally\n\nThe Biden White House and top Democrats have denounced Palestine solidarity activists as antisemites for protesting outside an Israeli-owned restaurant in Philly. Its owner happens to be an official Israeli government propagandist with close ties to the Biden White House.\n\nBY ALEXANDER RUBINSTEIN\n\nContinue reading",
        "timestamp": "2023-12-09 04:55:48+00:00"
    },
    {
        "message": "Scandal-stained Israeli ‘rescue’ group fuels October 7 fabrications\n\nFounded by a serial rapist known as the “Haredi Jeffrey Epstein,” Israeli ultra-Orthodox rescue group ZAKA is responsible for some of the most obscene post-October 7 atrocity fabrications, from beheaded babies to “mass rape” to a fetus cut from its mother.\nSecretary of State Tony Blinken and President Joseph Biden have each echoed demonstrably false ZAKA testimonies about Hamas atrocities.\nMarred by allegations of financial fraud, ZAKA is leveraging October 7 publicity to raise unprecedented sums of cash.\nIts rival, United Hatzalah, has spun out bogus tales of babies baked in ovens as it closes in on a $50 million fundraising goal.\n\nBY MAX BLUMENTHAL\n\nContinue reading",
        "timestamp": "2023-12-07 09:42:56+00:00"
    },
    {
        "message": "Relative of Israeli captives confirms ‘3 hostages killed by Israeli fire,’ blasts military\n\nAn Israeli whose family members were held by Palestinian militants tells of friendly fire deaths and complains, “We used to think the IDF knows what it’s doing.” Meanwhile, freed captives detail “horrifying captivity trauma” from Israeli bombings. \n\nBY WYATT REED AND MAX BLUMENTHAL \n\nContinue reading",
        "timestamp": "2023-12-07 09:37:20+00:00"
    },
    {
        "message": "VIDEO: Understanding the insane appeal of Argentina’s Javier Milei\n\nRenowned Argentine sociologist and anti-imperialist critic Atilio Boron joins The Grayzone to discuss the victory of former tantric sex coach and emotionally unhinged liberatarian economic fundamentalist Javier Milei as the country’s president.\nBoron explains why the desperate popular sectors of Argentina fell for Milei’s shtick, and forecasts a violent rebellion of the president-elect’s economic austerity plans come to pass.\n\nContinue reading",
        "timestamp": "2023-12-07 09:31:23+00:00"
    },
    {
        "message": "FOI request reveals Bellingcat collusion with Western intelligence \n\nAn extraordinary email uncovered by a Dutch researcher under freedom of information laws confirms what many have long charged: Bellingcat, the “open source” collective widely cited by mainstream journalists and loved by the CIA, collaborates directly with Western intelligence agencies.\n\nBY KIT KLARENBERG\n\nContinue reading",
        "timestamp": "2023-12-07 09:27:39+00:00"
    },
    {
        "message": "Max Blumenthal on Judge Napolitano: what did Biden expect Israel to do, NOT target civilians for mass slaughter?",
        "timestamp": "2023-12-01 22:35:54+00:00"
    },
    {
        "message": "See Israel's destruction of Gaza's Al-Zahraa from a drone's-eye view\n\nIsrael has destroyed some 60,000 residential structures and dropped the equivalent of almost two nuclear bombs on Gaza since October 7\n\nIf and when the truce ends, Israel wants to do this to southern Gaza too",
        "timestamp": "2023-11-30 06:24:27+00:00"
    },
    {
        "message": "In a new report, an admittedly inexperienced Israeli tank gunner reveals orders to fire indiscriminately into Israeli kibbutz\n\nMeanwhile, Israel has muzzled captives freed from Gaza to protect the faltering official narrative of its war",
        "timestamp": "2023-11-27 22:14:14+00:00"
    },
    {
        "message": "Max Blumenthal vs State Department, Part 2",
        "timestamp": "2023-11-27 00:15:09+00:00"
    },
    {
        "message": "Good interview destroying the official Zionist narrative of the October 7th resistance action in Palestine: \nhttps://chrishedges.substack.com/p/the-chris-hedges-report-with-reporter",
        "timestamp": "2023-11-26 21:57:18+00:00"
    },
    {
        "message": "Max Blumenthal vs State Department, Part 1",
        "timestamp": "2023-11-26 13:20:18+00:00"
    },
    {
        "message": "Max Blumenthal delivers another major blow to the Israeli narrative of October 7: new eyewitness testimony shows Israeli tanks killed 12-year-old Liel Hetzroni and her family in Kibbutz Be'eri https://thegrayzone.com/2023/11/25/israels-october-7-propaganda-tank-eyewitnesses/",
        "timestamp": "2023-11-25 12:48:17+00:00"
    },
    {
        "message": "US govt-linked Ukraine activists hold pro-Nazi Veterans Day rally outside White House\n\nA recent rally in front of the White House featuring Nazi iconography has been wholly ignored by the same mainstream media outlets pushing the narrative of rising antisemitism. The two DC-based organizations behind the events collaborated with the Biden administration on a similar event last February.\n\nALEXANDER RUBINSTEIN\nNOVEMBER 24, 2023",
        "timestamp": "2023-11-25 05:33:13+00:00"
    },
    {
        "message": "What really happened on October 7. Part 2",
        "timestamp": "2023-11-24 23:58:01+00:00"
    },
    {
        "message": "Before viral Islamophobic rant, ex-Obama official harassed women, Russian diplomat’s dog\n\nPrior to going viral after footage emerged showing ex-State Department official Stuart Seldowitz spewing Islamophobic slurs at a Halal food cart operator, he spent his spare time harassing female Russian diplomats and an ambassador’s pet dog, the Grayzone has learned.\n\nRead the full report at The Grayzone",
        "timestamp": "2023-11-24 17:22:56+00:00"
    },
    {
        "message": "JFK assassination at 60: Oswald ‘doubles’ show CIA hand in plot\n\nThe paper trail documenting Oswald’s look-a-likes may provide the best proof CIA elements orchestrated the JFK assassination plot.\n\nKIT KLARENBERG\nNOVEMBER 22, 2023",
        "timestamp": "2023-11-24 16:19:15+00:00"
    },
    {
        "message": "Hostile takeover: NATO’s annexation of Montenegro\n\nNATO’s stealth takeover of the tiny but geopolitically significant nation represents the Balkans’ latest submission to US global hegemony.\n\nKIT KLARENBERG\nNOVEMBER 22, 2023",
        "timestamp": "2023-11-24 16:16:35+00:00"
    },
    {
        "message": "What really happened on October 7. Part 1",
        "timestamp": "2023-11-24 13:32:01+00:00"
    },
    {
        "message": "Interview with journalist Shadi Abdelrahman. Part 4",
        "timestamp": "2023-11-22 16:45:15+00:00"
    },
    {
        "message": "Interview with journalist Shadi Abdelrahman. Part 3",
        "timestamp": "2023-11-22 13:43:01+00:00"
    },
    {
        "message": "Interview with journalist Shadi Abdelrahman. Part 2",
        "timestamp": "2023-11-22 03:43:01+00:00"
    },
    {
        "message": "Haaretz confirms Grayzone reporting it dismissed as ‘conspiracy’ showing Israel killed own festivalgoers\n\nHaaretz has yet to admit it jumped the gun when it dismissed The Grayzone’s Max Blumenthal as a ‘conspiracy theorist’ for documenting crucial evidence that Israeli forces killed Israelis on October 7. But new reports by the same outlet show we were right all along. \n\nWYATT REED\nNOVEMBER 21, 2023",
        "timestamp": "2023-11-22 00:14:37+00:00"
    },
    {
        "message": "Interview with journalist Shadi Abdelrahman. Part 1",
        "timestamp": "2023-11-21 19:42:25+00:00"
    },
    {
        "message": "VIDEO: What really happened on October 7?\n\nThe Grayzone’s Max Blumenthal joins Chris Hedges to discuss his investigation into Israel’s indiscriminate use of heavy weapons against Israeli citizens on October 7, and the shock-and-awe campaign of misinformation it subsequently employed to create political space for its brutal assault on Gaza.\n\nMAX BLUMENTHAL\nNOVEMBER 18, 2023",
        "timestamp": "2023-11-19 04:22:36+00:00"
    },
    {
        "message": "Max Blumenthal exposes Israel’s & Biden’s lies about their war against Palestine, on Afshin Rattansi's Going Underground.\n\nFind more @thegrayzonenews",
        "timestamp": "2023-11-19 00:19:58+00:00"
    },
    {
        "message": "Aaron Mate removed from train for questioning Sen. Coons about Gaza (short version). Full report here.",
        "timestamp": "2023-11-18 07:56:06+00:00"
    },
    {
        "message": "Aaron Mate removed from train for questioning Sen. Coons about Gaza\n\nThe Grayzone's Aaron Maté was seated across from Sen. Chris Coons on an Amtrak train headed to Washington, DC. After Maté questioned Sen. Coons about his opposition to a ceasefire in Gaza, Coons had him removed from the train.\n\nWatch on YouTube",
        "timestamp": "2023-11-17 18:08:01+00:00"
    },
    {
        "message": "Israel is committing a holocaust",
        "timestamp": "2023-11-16 18:31:17+00:00"
    },
    {
        "message": "Israel's over reliance on tech",
        "timestamp": "2023-11-16 15:31:13+00:00"
    },
    {
        "message": "Al Qassam Brigade has overwhelming popular support in Palestine",
        "timestamp": "2023-11-15 18:31:10+00:00"
    },
    {
        "message": "Just following orders",
        "timestamp": "2023-11-15 15:30:20+00:00"
    },
    {
        "message": "Biden admin justifies Israel’s assault on Gaza hospitals with recycled Israeli ‘intelligence’  https://thegrayzone.com/2023/11/15/biden-israels-gaza-hospitals-intelligence/",
        "timestamp": "2023-11-15 08:53:25+00:00"
    },
    {
        "message": "Israel is a Nazi state",
        "timestamp": "2023-11-14 15:30:20+00:00"
    },
    {
        "message": "This is genocide",
        "timestamp": "2023-11-14 06:27:32+00:00"
    },
    {
        "message": "Leak shows ex-Trump ambassador to Israel threatening NYU over Palestine protests\n\nThe Grayzone has obtained a letter signed by former President Trump’s fanatically pro-settler ambassador to Israel, David Friedman, and sent to New York University leadership demanding the school crack down on free speech to satisfy Israeli interests.\n\nALEXANDER RUBINSTEIN\nNOVEMBER 7, 2023",
        "timestamp": "2023-11-12 02:56:59+00:00"
    },
    {
        "message": "UN official resigns over 'prima facie case of genocide' in Gaza\n\nCraig Mokhiber, a former Director in the New York Office of the High Commissioner for Human Rights (OHCHR) and expert in international law, joins Max Blumenthal to explain why he resigned in protest of the United Nations' toothless approach to what he calls a \"genocide\" carried out by Israel against Palestinians in the Gaza Strip.\n\nWatch on YouTube",
        "timestamp": "2023-11-09 20:38:15+00:00"
    },
    {
        "message": "https://www.youtube.com/live/TP2ime7zxQc?si=dc0tCU-019009mcE",
        "timestamp": "2023-11-07 20:24:13+00:00"
    },
    {
        "message": "The Grayzone's Max Blumenthal asked the State Department why Tony Blinken and Joe Biden have accused nations of genocide which have killed far less than Israel has in Gaza in 1 month, and if the Biden admin has enabled Israel's killing spree with its use of the term \"human shields\"",
        "timestamp": "2023-11-07 19:56:43+00:00"
    },
    {
        "message": "Biden let Israel off the chain, and Israel off the chain means genocide.\nFrom the latest livestream, posted above.\n\nEdit by Cui Bono",
        "timestamp": "2023-11-06 14:44:45+00:00"
    },
    {
        "message": "Biden could do something.\nFrom the latest livestream, posted above.\n\nEdit by Cui Bono",
        "timestamp": "2023-11-06 14:41:52+00:00"
    },
    {
        "message": "UN official resigns over 'prima facie case of genocide' in Gaza\n\nCraig Mokhiber, a former Director in the New York Office of the High Commissioner for Human Rights (OHCHR) and expert in international law, joins Max Blumenthal to explain why he resigned in protest of the United Nations' toothless approach to what he calls a \"genocide\" carried out by Israel against Palestinians in the Gaza Strip.",
        "timestamp": "2023-11-06 04:40:51+00:00"
    },
    {
        "message": "We're seeing one Israeli produced snuff film after another.\nFrom the latest livestream, posted above.\n\nEdit by Cui Bono",
        "timestamp": "2023-11-06 00:45:51+00:00"
    },
    {
        "message": "Leftist student of an Israeli university is arrested for sarcasm \nFrom the latest livestream, posted above.\n\nEdit by Cui Bono",
        "timestamp": "2023-11-05 18:27:11+00:00"
    },
    {
        "message": "Cowards would rather bomb civilians from the sky than engage in hand to hand combat with the enemy on the ground, says Dan Kovalik on the Grayzone live.\n\nEdit by Cui Bono",
        "timestamp": "2023-11-04 20:50:58+00:00"
    },
    {
        "message": "All options on the table\nThe Grayzone live\n\nMax Blumenthal and Aaron Mate cover the latest from the Israeli-US war on Palestine, from Hassan Nasrallah's momentous speech in Beirut to the conflict inside Gaza, and the battle across the West for the right to speak out against the war.",
        "timestamp": "2023-11-04 05:58:53+00:00"
    },
    {
        "message": "Signals Blinken red\nThe Grayzone live\n\nAnya Parampil is joined by journalist Dan Kovalik and The Grayzone's Max Blumenthal to discuss the expansion of Israel's bloodstained assault on Gaza and the deepening political backlash in Washington.",
        "timestamp": "2023-11-03 20:59:30+00:00"
    },
    {
        "message": "US regime change activist named Web Summit CEO after founder forced out for condemning Israeli ‘war crimes’\n\nThe CEO of one of the world’s leading tech conferences was forced to resign after criticizing Israel’s assault on Gaza. He was quickly replaced by one of the industry’s most prominent US government-affiliated regime change specialists. \n\nWYATT REED\nOCTOBER 31, 2023",
        "timestamp": "2023-11-02 11:39:57+00:00"
    },
    {
        "message": "Is it Ukraine or Israel?\n\nEdit by Cui Bono",
        "timestamp": "2023-11-01 13:48:20+00:00"
    },
    {
        "message": "Israel's military was ordered to attack Israelis on 10/7\nThe Grayzone's Max Blumenthal discusses his investigation into Israeli military orders to shell the homes of Israeli civilians and helicopter attacks on civilian cars and Israeli bases as they fought to dislodge Palestinian militants from the country's south on October 7.",
        "timestamp": "2023-10-30 19:44:43+00:00"
    },
    {
        "message": "Dr. Gabor Mate: this is genocide\nRenowned physician and author Dr. Gabor Mate joins The Grayzone to offer his reflections on Israel's gruesome military operation in the besieged Gaza Strip.",
        "timestamp": "2023-10-30 19:43:59+00:00"
    },
    {
        "message": "Israeli targets journalists, kills their families as Big Tech & Biden admin silence Palestinians\n\nWith Israeli airstrikes on Gaza killing at least twenty Palestinian journalists—and the Biden administration working to muzzle others—Big Tech is quietly coordinating with Tel Aviv to muzzle Palestinian media outfits. \n\nWYATT REED\nOCTOBER 27, 2023",
        "timestamp": "2023-10-28 06:49:46+00:00"
    },
    {
        "message": "\"It's so false not even the opposite is true.\"\n\nDr. Gabor Maté, on today's livestream, discusses the zionist narratives excusing genocide in Palestine (12 min).",
        "timestamp": "2023-10-28 02:30:53+00:00"
    },
    {
        "message": "\"People of Darkness\"\nThe Grayzone live\n\nMax Blumenthal and Aaron Mate discuss the ongoing war in Palestine, Israel's gruesome assault on Gaza's civilians and its desperate campaign for sympathy on the world stage. They will also cover US airstrikes on northeastern Syria and the looming threat of regional war.",
        "timestamp": "2023-10-27 18:00:02+00:00"
    },
    {
        "message": "October 7 testimonies reveal Israel’s military ‘shelling’ Israeli citizens with tanks, missiles\n\nIsrael’s military received orders to shell Israeli homes and even their own bases as they were overwhelmed by Hamas militants on October 7. How many Israeli citizens said to have been “burned alive” were actually killed by friendly fire?\n\nMAX BLUMENTHAL\nOCTOBER 27, 2023",
        "timestamp": "2023-10-27 10:24:18+00:00"
    },
    {
        "message": "Zionist think tank publishes blueprint for Palestinian genocide\n\nAs Israel’s carpet bombing of Gaza entered its third week, leaving over 5000 dead and at least one million residents displaced, a Tel Aviv-based think tank published a blueprint for self-proclaimed Jewish state’s final solution.\n\nKIT KLARENBERG\nOCTOBER 24, 2023",
        "timestamp": "2023-10-24 12:39:51+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=XfDMXrcYw2I",
        "timestamp": "2023-10-22 06:59:06+00:00"
    },
    {
        "message": "Nobody is safe\nThe Grayzone live\n\nThe Grayzone's Max Blumenthal and Aaron Mate cover the global explosion of outrage in response to Israel's rising atrocities against the Gaza Strip and the threat it poses to American imperium.\n\nWatch on YouTube \nFind more at The Grayzone\nFollow @thegrayzonenews",
        "timestamp": "2023-10-21 09:51:38+00:00"
    },
    {
        "message": "AP erases Israeli pledge to attack Gaza like ‘Axis Power’ as officials threaten Gaza with ‘Dresden’ doctrine                                                     As Israeli officials proudly compare their bombardment of the Gaza Strip to the Allied firebombing of Dresden, the Associated Press has quietly removed a section noting US alarm over the historical comparison.",
        "timestamp": "2023-10-21 04:38:53+00:00"
    },
    {
        "message": "Nobody is safe\nThe Grayzone live\n\nThe Grayzone's Max Blumenthal and Aaron Mate cover the global explosion of outrage in response to Israel's rising atrocities against the Gaza Strip and the threat it poses to American imperium.",
        "timestamp": "2023-10-20 22:39:15+00:00"
    },
    {
        "message": "How Israel uses its own civilians as human shields while assaulting Gaza\n\nWhile Israeli soldiers hide behind civilians as they attack Gaza it is hard to find any area in Israeli without some kind of military presence\n\n* Why has Israel placed its military HQ in a civilian area? \n\n* Why do its civilians also serve as soldiers for much of their lives?\n\n* Why are \"IDF\" bases constructed next to kibbutzim?\n\n* How Israel uses its own civilians as human shields while assaulting Gaza?\n\nMAX BLUMENTHAL\nAUGUST 6, 2014",
        "timestamp": "2023-10-20 18:23:05+00:00"
    },
    {
        "message": "Judgment Day\nThe Grayzone live\n\nMax Blumenthal, Wyatt Reed and special guests discuss the latest from Israel-Palestine and the ramifications of the massacre of hundreds of civilians sheltering in the Ahly hospital in Gaza City.\n\nWatch on YouTube \nFind more at The Grayzone\nFollow @thegrayzonenews",
        "timestamp": "2023-10-19 19:45:25+00:00"
    },
    {
        "message": "A failed coup monger gets his reward",
        "timestamp": "2023-10-18 23:28:12+00:00"
    },
    {
        "message": "Failed Venezuelan coup leader Juan Guaidó lands new gig as visiting prof at Florida International U\n\nAfter leading a failed military coup, a failed mercenary invasion of his country, and a non-existent presidency, Juan Guaidó gets his golden parachute at an intelligence-adjacent US university.\n\nJEREMY KUZMAROV\nOCTOBER 18, 2023",
        "timestamp": "2023-10-18 23:26:38+00:00"
    },
    {
        "message": "Judgment Day\nThe Grayzone live\n\nMax Blumenthal, Wyatt Reed and special guests discuss the latest from Israel-Palestine and the ramifications of the massacre of hundreds of civilians sheltering in the Ahly hospital in Gaza City.",
        "timestamp": "2023-10-17 19:40:50+00:00"
    },
    {
        "message": "Media whitewashes own role in killing of Palestinian-American child\n\nThe New York Times surreptitiously edited its article on the politically motivated murder of a Muslim American child to remove a lawmaker’s condemnation of the media’s role in the lethal hate crime. And after inciting a wave of anti-Palestinian hysteria, Biden and corporate media pundits feigned sorrow.\n\nWYATT REED\nOCTOBER 17, 2023",
        "timestamp": "2023-10-17 08:30:05+00:00"
    },
    {
        "message": "Former ambassador and Assange advocate Craig Murray detained under UK terror laws\n\nThe former diplomat’s detention is just the latest example of British terror laws being used to harass and intimidate dissidents, while brazenly prying into their private affairs.\n\nKIT KLARENBERG\nOCTOBER 17, 2023",
        "timestamp": "2023-10-17 08:27:13+00:00"
    },
    {
        "message": "Has Israel’s govt recruited a member of the House Foreign Affairs Committee?\n\n“He should not have security clearance. That’s just common sense,” a former Special Forces officer warned after Rep. Brian Mast showed up to work in an Israeli military uniform. \n\nANYA PARAMPIL\nOCTOBER 14, 2023",
        "timestamp": "2023-10-14 22:40:34+00:00"
    },
    {
        "message": "Zero hour in Gaza\nThe Grayzone live\n\nMax Blumenthal and Aaron Mate cover the latest from Gaza as Israel demands 1.1 million civilians leave the northern area of the besieged enclave in expectation of a regime change war, and US, UK and French ships arrive at the coast.\n\nWatch on YouTube \nFind more at The Grayzone\nFollow @thegrayzonenews",
        "timestamp": "2023-10-14 04:00:02+00:00"
    },
    {
        "message": "Max Blumenthal on the Stephen Gardner podcast. Max contextualizes the history of Gaza and Hamas to understand what's really happening in Palestine and the possibility of a regional war.",
        "timestamp": "2023-10-13 20:30:45+00:00"
    },
    {
        "message": "“So baby killing is okay?”\n\nCoverage from Forbes of Max Blumenthal and Sam Husseini’s attempts to force the State Department to acknowledge Israeli atrocities in Gaza",
        "timestamp": "2023-10-13 18:42:59+00:00"
    },
    {
        "message": "Zero hour in Gaza\nThe Grayzone live\n\nMax Blumenthal and Aaron Mate cover the latest from Gaza as Israel demands 1.1 million civilians leave the northern area of the besieged enclave in expectation of a regime change war, and US, UK and French ships arrive at the coast.",
        "timestamp": "2023-10-13 16:35:31+00:00"
    },
    {
        "message": "Israel’s govt does not want int’l sympathy; it wants to manufacture a “red line” incident with bogus claims of beheaded babies\n\nIt ultimately wants to trigger US military support for a war on Iran through constant escalation \n\nMax Blumenthal outlined Israel’s real goals on Al Jazeera English",
        "timestamp": "2023-10-12 20:07:58+00:00"
    },
    {
        "message": "American leadership's only interest should be \"an immediate cessation of hostilities and a prisoner swap.\" \n\n- Anya Parampil on The Ron Paul Liberty Report",
        "timestamp": "2023-10-11 21:06:44+00:00"
    },
    {
        "message": "Source of dubious ‘beheaded babies’ claim is Israeli settler leader who incited riots to ‘wipe out’ Palestinian village\n\nAfter an Israeli reserve soldier named David Ben Zion told a reporter Palestinian militants “cut [off] heads of babies,” Biden, Netanyahu, and the international media amplified the dubious claim.\nThe Grayzone has identified Ben Zion as a fanatical settler leader who incited riots by demanding a Palestinian town be “wiped out.”",
        "timestamp": "2023-10-11 19:25:42+00:00"
    },
    {
        "message": "Watch Max Blumenthal on Timcast discussing Israel's war on Gaza",
        "timestamp": "2023-10-11 17:34:17+00:00"
    },
    {
        "message": "Israelis celebrate the mass killing of civilians in Gaza\n\nFrom the documentary, Killing Gaza, by Max Blumenthal and Dan Cohen.\nWatch the full doc here",
        "timestamp": "2023-10-11 16:36:05+00:00"
    },
    {
        "message": "Pro-Israel demonstrators call for genocide in New York City\n\nJeremy Loffredo covers an October 9 pro-Israel demonstration in New York City's Times Square, where demonstrators issued explicit calls for the genocide of Palestinians in the besieged Gaza Strip, where Israel is conducting massive bombing operations in response to a militant surprise attack.\n\nWatch on YouTube \nFind more at The Grayzone",
        "timestamp": "2023-10-10 21:41:47+00:00"
    },
    {
        "message": "Operation Gaza Truth Flood\nThe Grayzone live\n\nThe Grayzone's Max Blumenthal and Wyatt Reed cover the surprise attack from Gaza that has momentarily overwhelmed Israel's military and shocked the world. They will follow events from there, including the unfolding Israeli assault on Gaza and the international response.\n\nWatch on YouTube\nFind more at The Grayzone",
        "timestamp": "2023-10-10 18:27:21+00:00"
    },
    {
        "message": "https://youtu.be/XfDMXrcYw2I?si=8PZawkpLtu9oZMIe",
        "timestamp": "2023-10-10 03:12:04+00:00"
    },
    {
        "message": "https://www.youtube.com/live/s602J5Sm3hg?si=2C3VCPjh8YiXfJQZ",
        "timestamp": "2023-10-10 01:17:20+00:00"
    },
    {
        "message": "A Maidan 2.0 color revolution looms in Georgia\n\nThe arrest of US regime change operatives in Tbilisi suggests a coup against Georgia’s government could be in the works. As Ukraine’s counteroffensive fails, the West appears eager to open a new front in its proxy war.\n\nKIT KLARENBERG\nOCTOBER 6, 2023",
        "timestamp": "2023-10-07 00:46:35+00:00"
    },
    {
        "message": "The US knew the president of Honduras was trafficking drugs. It supported him anyway.\n\nFormer Honduran President Juan Orlando Hernández transformed his country into a de facto narco state, stealing elections with drug money and stacking state security services with crime lords. A Department of Justice motion against the jailed politico shows the US knew of his shocking crimes all along.\n\nALEXANDER RUBINSTEIN AND ANYA PARAMPIL\nOCTOBER 6, 2023",
        "timestamp": "2023-10-06 23:53:39+00:00"
    },
    {
        "message": "How US gov’t prosecution of Uhuru activists threatens a ‘First Amendment exception’\n\nThe Uhuru 3 are accused by the US DOJ of “sowing discord” on behalf of Russia. Their attorneys warn the case threatens to “blow a hole in the First Amendment.”\n\nANYA PARAMPIL\nOCTOBER 5, 2023",
        "timestamp": "2023-10-06 04:45:56+00:00"
    },
    {
        "message": "Last week, the State Dept dismissed questions by The Grayzone's Liam Cosgrove about US arms to Ukrainian neo-Nazis, claiming effective \"monitoring systems\" were in place.\n\nPresented with visual evidence the neo-Nazi Azov Battalion has US supplied weapons, the State Dept repeated its line all over again.",
        "timestamp": "2023-10-05 19:20:05+00:00"
    },
    {
        "message": "British govt funded plan for censorship of factual NATO criticism\n\nLeaked documents reveal a British intel contractor singled out The Grayzone’s Max Blumenthal for online censorship, and seeks to redefine factual criticism of NATO as disinformation.\n\nJACK POULSON\nOCTOBER 3, 2023",
        "timestamp": "2023-10-03 19:26:15+00:00"
    },
    {
        "message": "As conservatives ramp up opposition to Ukraine war, Dems dodge The Grayzone\n\nAs a budget showdown looms in Congress, MAGA Republicans are alone in challenging the vast quantities of American weapons and cash being funneled to Kiev, with Rep. Marjorie Taylor Greene warning The Grayzone that increasing escalation could turn the proxy war into a “potential nuclear conflict.” When approached for comment, progressive members of the ‘Squad’ dodged our questions.\n\nLIAM COSGROVE\nSEPTEMBER 29, 2023",
        "timestamp": "2023-09-30 13:11:34+00:00"
    },
    {
        "message": "Nazigate - The Grayzone live\nMax Blumenthal and Aaron Mate cover the international scandal that unfolded when the Liberal Party of Canada's Justin Trudeau honored a Ukrainian Nazi veteran of the Waffen-SS, and the dark history it forced to the surface.",
        "timestamp": "2023-09-29 17:14:56+00:00"
    },
    {
        "message": "Canada's Deputy Prime Minister Chrystia Freeland perpetuates her Nazi grandfather's legacy through Ukraine proxy war\n\nRead more at The Grayzone",
        "timestamp": "2023-09-28 14:00:40+00:00"
    },
    {
        "message": "Nazigate: Canada’s top general won’t apologize for applauding Ukrainian Waffen-SS vet\n\nAs Canada’s top officials express embarrassment for honoring a WWII Nazi collaborator in parliament, the leader of the country’s military, Gen. Wayne Eyre, refuses to apologize for his standing ovation. The Canadian military has trained Ukraine’s notorious neo-Nazi Azov Battalion for years.\n\nWYATT REED\nSEPTEMBER 28, 2023",
        "timestamp": "2023-09-28 09:51:50+00:00"
    },
    {
        "message": "Honduras' former president worked for the cartels\n\nWatch the full report\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser",
        "timestamp": "2023-09-27 17:20:22+00:00"
    },
    {
        "message": "So you did Nazi this coming? \n\nWell, we did.",
        "timestamp": "2023-09-27 11:00:19+00:00"
    },
    {
        "message": "Noted anti-fascist AOC trailed off and refused to condemn the standing ovation Canada’s parliament and Ukrainian President Zelensky gave to a Nazi Waffen-SS veteran invited by the Liberal Party of Justin Trudeau \n\nThe Grayzone’s Liam Cosgrove caught up with AOC on Capitol Hill",
        "timestamp": "2023-09-27 10:55:13+00:00"
    },
    {
        "message": "Max Blumenthal:\n\nIn my latest, I cite this 1997 60 Minutes special, \"Canada's Dark Secret,\" which exposed Ottawa's post-war policy of welcoming Nazi SS veterans\n\nA historian recalls how Pierre Trudeau told him his gov't hid the Nazi criminals, and documents how Ukrainian and Baltic immigrants received instant Canadian citizenship \"by showing the SS tattoo. This proved that you were an anti-Communist.”\n\nRead it here",
        "timestamp": "2023-09-27 10:17:34+00:00"
    },
    {
        "message": "Canada’s honoring of Nazi vet exposes Ottawa’s longstanding Ukraine policy \n\nBy celebrating a Waffen-SS volunteer as a “hero,” Canada’s Liberal Party highlighted a longstanding policy that has seen Ottawa train fascist militants in Ukraine while welcoming in thousands of post-war Nazi SS veterans.\n\nCanada’s second most powerful official, Chrystia Freeland, is the granddaughter of one of Nazi Germany’s top Ukrainian propagandists.\n\nMAX BLUMENTHAL\nSEPTEMBER 26, 2023",
        "timestamp": "2023-09-27 02:40:53+00:00"
    },
    {
        "message": "Barnaby Joyce, an Australian MP, was part of a delegation of Australian politicians who traveled to DC to campaign for Assange's freedom.\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-25 14:15:03+00:00"
    },
    {
        "message": "Geopolitical Slapstick \n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-25 02:24:39+00:00"
    },
    {
        "message": "Australian MPs campaign for Assange's freedom in DC\nMax Blumenthal speaks to Australian lawmakers in DC to lobby for the freedom of Julian Assange, an Australian citizen and journalist imprisoned under the US Espionage Act. He also talks to Gabriel Shipton, the brother of Julian Assange, about the Wikileaks founder's condition as he languishes in a maximum security British prison.\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-24 22:25:14+00:00"
    },
    {
        "message": "Zelenksky shakes down Europe again\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-24 17:30:19+00:00"
    },
    {
        "message": "Max Blumenthal on the censorship against Russell Brand: \n\n“He’s not being demonitized for his content. His content supposedly adheres to YouTube’s stated Terms of Service and YouTube has appointed itself the jury. It gets to be the jury because our digital commons are completely privatised. None of these charges have been adjudicated. And let’s say Russell Brand is totally guilty of everything - let’s say it’s even worse than that, let’s say he’s like Leatherface and he’s throwing women on meat hooks in a hellhole in some rural county in Texas - millions and millions of people will still not believe that is true because the media, and specifically The Times of London and the Murdoch press has lied them into so many disastrous situations; they lied about Jeremy Corbyn being an anti-semite day in and day out, they lied the public into the Iraq war, they lied about Gaddafi giving his troops viagra, they lied about Syrian chemical attacks to trigger Western intervention there, they lie day in and day out. The mainstream media has proven itself an enemy of the people.” \nhttps://youtu.be/n1Dup1ZseKI?si=7xdn9Sfm__97k-8D",
        "timestamp": "2023-09-23 19:35:33+00:00"
    },
    {
        "message": "https://www.youtube.com/live/eFhK30If6uc?si=ylOpvjAE4ZnaquKE",
        "timestamp": "2023-09-22 20:41:21+00:00"
    },
    {
        "message": "https://youtu.be/n1Dup1ZseKI?si=JmC-nN4hjU6vp-jv",
        "timestamp": "2023-09-22 15:26:50+00:00"
    },
    {
        "message": "Amnesty International pushes regime change in Eritrea with dubious, unverifiable report\nAmnesty’s new report accusing Eritrea’s government of gruesome war crimes relies heavily on anonymous testimony, grainy satellite images, and zero field investigation. It is the latest salvo in the West’s campaign to topple the country’s independent government.",
        "timestamp": "2023-09-21 20:28:41+00:00"
    },
    {
        "message": "The Russell Brand affair... it's all starting to make sense now \n\nIntel-linked UK official pushing censorship of Russell Brand \nThe author of letters to social media companies demanding the financial punishment of Russell Brand is a British lawmaker implicated in London’s war on Covid-19 and Ukraine dissenters. Her husband was a commander in the Army’s psy-ops division.",
        "timestamp": "2023-09-21 18:27:01+00:00"
    },
    {
        "message": "https://rokfin.com/stream/39253/Anya-Parampil-Joins-To-Discuss-Her-New-Book-Exposing-US-Regime-Change-In-Venezuela",
        "timestamp": "2023-09-21 16:11:09+00:00"
    },
    {
        "message": "UK intelligence spun 2013 Syria chemical attack, leaked docs show\nUS officials suppressed internal assessments that Al Qaeda’s Syrian wing had an “advanced” sarin production cell even as the US publicly blamed the Assad government for a 2013 chemical weapons attack, a report reveals.\nLeaked documents obtained by The Grayzone show a shadowy British intelligence contractor helped sell the story that Assad was responsible – and nearly triggered Western intervention.",
        "timestamp": "2023-09-20 10:37:30+00:00"
    },
    {
        "message": "Report for European Parliament challenges OPCW’s Syria cover-up\nA new report offers the most thorough exposé to date of the OPCW’s Syria cover-up scandal, in which the world’s top chemical watchdog manipulated an investigation to baselessly accuse Syria of a chemical weapons attack in the town of Douma.\nAaron Maté speaks to Hans von Sponeck and Piers Robinson about their new report, as well as the ongoing effort to challenge the OPCW's Douma deception and seek justice for the Douma victims.",
        "timestamp": "2023-09-19 17:45:40+00:00"
    },
    {
        "message": "Assange and Ellsberg: how times have changed the demonization of whistleblowing.\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-19 16:23:21+00:00"
    },
    {
        "message": "Defamation Industrial Complex\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-19 16:14:23+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/09/18/trial-honduran-president-narco-state/",
        "timestamp": "2023-09-19 14:08:44+00:00"
    },
    {
        "message": "Max Blumenthal: Ukraine to become 'Big Israel'?\nThe Grayzone's Max Blumenthal addresses the Ron Paul Institute's 2023 Washington DC conference on the disturbing plans in Kiev and Washington to convert Ukraine into a \"Big Israel,\" and what this means for the region and the future of US politics.\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-18 21:48:14+00:00"
    },
    {
        "message": "\"I'm banned from discussing that.\"\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-17 17:23:19+00:00"
    },
    {
        "message": "Obama's flood.\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-17 17:18:03+00:00"
    },
    {
        "message": "https://youtu.be/WKIduCgOd_k?si=anL7vnU5qwq4FNB_",
        "timestamp": "2023-09-15 21:52:10+00:00"
    },
    {
        "message": "https://youtu.be/zr3DeygcHCY?si=r9BTsE-1Snhkp48i",
        "timestamp": "2023-09-15 21:50:27+00:00"
    },
    {
        "message": "The Grayzone's Liam Cosgrove asked State Dept spokesman Matt Miller about NATO chief Jens Stoltenberg's recent comments revealing that he knew expansion could lead to war with Russia, but pressed ahead anyway\n\nDespite the horrific human toll of the war, the State Dept's Matt Miller says NATO did the right thing by pushing expansion at Russia's doorstep\n\nThis 9/7, NATO's Stoltenberg remarked, \"The background was that President Putin declared in the autumn of 2021, and actually sent a draft treaty that they wanted NATO to sign, to promise no more NATO enlargement. That was what he sent us. And was a pre-condition for not invade Ukraine. Of course we didn't sign that. The opposite happened.\"",
        "timestamp": "2023-09-15 21:15:47+00:00"
    },
    {
        "message": "https://www.youtube.com/live/yKQCzeDBexQ?si=vZOLysSacKuu2xxO",
        "timestamp": "2023-09-15 19:27:22+00:00"
    },
    {
        "message": "No major US media outlet has reported this fact.\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-15 11:50:16+00:00"
    },
    {
        "message": "Zelensky's transformation from peace candidate to warlord.\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-15 11:34:49+00:00"
    },
    {
        "message": "If you understand Syria, you'll understand Ukraine\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-13 12:06:32+00:00"
    },
    {
        "message": "Soft-handed neocons waging war in the most cowardly way possible\n\nFind more at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-13 12:05:20+00:00"
    },
    {
        "message": "🎇 Announcing Anya Parampil's new book, ‘Corporate Coup: Venezuela and the End of US Empire’ \n\nInternational and Public Affairs Prof. Francisco Rodriguez calls it \"a careful and meticulous work of investigative reporting that exposes the dark side of the US foreign policy towards Venezuela\"\n\n👉 Pre-order Here 👈",
        "timestamp": "2023-09-11 22:53:45+00:00"
    },
    {
        "message": "Max Blumenthal on Stay Free w/Russell Brand\n\nFind more reporting at The Grayzone\nThe Grayzone's new fundraiser\nWatch on Rumble",
        "timestamp": "2023-09-11 17:45:42+00:00"
    },
    {
        "message": "Ukrainian dissident resists NATO's proxy war\n\nUkrainian journalist and exiled antiwar dissident Ruslan Kostaba has been jailed and brutally attacked for his years of opposition to his government's war in the Donbas, and his calls for peace with Russia. From exile, he speaks to The Grayzone's Max Blumenthal about the growing movement in Ukraine against escalating the war, and the price his countrymen face for attempting to escape the war.\n\nFind more reporting at The Grayzone\nThe Grayzone's new fundraiser\nWatch on YouTube",
        "timestamp": "2023-09-09 23:06:32+00:00"
    },
    {
        "message": "Ukrainian journalist and exiled dissident Ruslan Kostaba has been jailed and brutally attacked for his years of opposition to Kiev's war in the east\n\nKostaba speaks to Max Blumenthal about the harsh price he and other Ukrainians face for resisting the war",
        "timestamp": "2023-09-09 18:39:03+00:00"
    },
    {
        "message": "The BBC’s Marianna Spring specializes in branding average citizens as conspiracy theorists and potential terrorists for questioning official claims. When caught lying about her own professional record to advance her ambitions, she says she thought her deceit “wouldn’t be a big deal.”",
        "timestamp": "2023-09-09 17:59:28+00:00"
    },
    {
        "message": "https://www.youtube.com/live/LXJf8f9N-lA?si=vjXZhHVjDac2_Zkq",
        "timestamp": "2023-09-08 21:45:30+00:00"
    },
    {
        "message": "US neo-Nazis hail Ukraine's military at Florida rally\n\nThe Grayzone's Max Blumenthal and Wyatt Reed cover a shocking neo-Nazi rally in Florida in which members of the fascist \"Blood Tribe\" openly hailed the Ukrainian state sponsored Azov Regiment, and detail Azov's hosting of US white supremacists as foreign fighters.\n\nOur new fundraiser:\nhttp://spot.fund/DefendTheGrayzoneAgain\n\nFind more reporting:\nhttps://thegrayzone.com\n\nWatch on YouTube:\nhttps://www.youtube.com/watch?v=TojapQRUhzs",
        "timestamp": "2023-09-08 04:30:17+00:00"
    },
    {
        "message": "Burning Man flooded after ritual Ukraine war sacrifice\n\nThe Grayzone's Max Blumenthal and Wyatt Reed roast the annual Burning Man gathering in the ironically named Black Rock, Nevada, covering its hosting of a bizarre Ukrainian government sponsored sacrifice to Kiev's proxy war, the floods and mud that ensued afterwards, and the special privileges given to celebrity attendees during a shelter in place order. \n\nOur new fundraiser:\nhttp://spot.fund/DefendTheGrayzoneAgain\n\nFind more reporting:\nhttps://thegrayzone.com\n\nWatch on YouTube:\nhttps://www.youtube.com/watch?v=SjLEQqGBvvw",
        "timestamp": "2023-09-08 04:22:17+00:00"
    },
    {
        "message": "GoFundMe f*cked around and found out\n\nMax Blumenthal and Wyatt Reed discuss The Grayzone's campaign to hold GoFundMe accountable for freezing their fundraiser \"due to some external concerns,\" and how grassroots support and independent media allies helped them do it.\n\nTo support The Grayzone's ongoing fundraising campaign, visit:\nhttp://spot.fund/DefendTheGrayzoneAgain\n\nFind more reporting at: \nhttps://thegrayzone.com\n\nWatch on YouTube:\nhttps://www.youtube.com/watch?v=ns6JX1jLV-k",
        "timestamp": "2023-09-08 04:06:13+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/09/06/ukraines-arms-supplier-maidan-massacre/",
        "timestamp": "2023-09-07 11:43:29+00:00"
    },
    {
        "message": "At the most recent Maui County Council meeting, Lahaina elementary school teacher and community organizer questioned why 3 weeks prior to the devastating fire, the council  failed to oppose the mayors passing of an emergency proclamation law that streamlines development, suspends sunshine laws, rescinds collective bargaining. \n\n\"To my knowledge this is the first emergency proclamation in the country that didn't have a preceding incident...\"\n\nWatch here:\nhttps://youtu.be/OQ70c6pERe4",
        "timestamp": "2023-09-06 22:46:50+00:00"
    },
    {
        "message": "Locals in Lahaina told Jeremy Loffredo they believe the official government approved death count of 115 is an insulting lie. \n\n“It’s in the thousands. Not hundreds. Thousands. They’re not going to tell you there’s 3000 bodies…”\n\nWatch here:\nhttps://youtu.be/OQ70c6pERe4",
        "timestamp": "2023-09-06 22:44:29+00:00"
    },
    {
        "message": "An indigenous Lahaina local tells Jeremy Loffredo she lost her house, pets, medicine and cash savings. She can't get a call back from FEMA and has yet to see any type of US aid relief. \n\nShe says Joe Biden should keep his insulting $700 because of the \"gazillions\" he's sending Ukraine.\n\nWatch here:\nhttps://youtu.be/OQ70c6pERe4",
        "timestamp": "2023-09-06 22:43:48+00:00"
    },
    {
        "message": "Lahaina local who lost everything told Jeremy Loffredo the billions for Ukraine should be going to Maui but the US doesn’t treat the Hawaiian people as Americans\n\nWatch here:\nhttps://youtu.be/OQ70c6pERe4",
        "timestamp": "2023-09-06 22:40:06+00:00"
    },
    {
        "message": "Fan the flames: Lahaina on fire\n\nJeremy Loffredo visits the scorched town of Lahaina, Hawaii and meets survivors of one of the worst mass casualty disasters on American soil in recent history. The mostly indigenous locals tell Loffredo why they believe the fires were no accident, and vent their rage at the wealthy developers and investment firms they view as a flock of vultures circling over the ruins of their community. \n\nAn original Grayzone production.\n\nOur new uncensored fundraiser:\nhttp://spot.fund/DefendTheGrayzoneAgain\n\nFind more reporting:\nhttps://thegrayzone.com\n\nWatch on YouTube:\nhttps://www.youtube.com/watch?v=OQ70c6pERe4",
        "timestamp": "2023-09-06 04:27:10+00:00"
    },
    {
        "message": "Gofundme, defunded\n- The Grayzone live\n\nMax Blumenthal and Wyatt Reed explain how the attempted sabotage of The Grayzone's fundraiser fits into the wider spectrum of online censorship, and discuss events from Ukraine to Gabon, and a very revealing fascist rally outside Disneyland.\n\nThe Grayzone's new fundraiser:\nhttp://spot.fund/DefendTheGrayzoneAgain\n\nThe Grayzone Live on YouTube:\nhttps://www.youtube.com/watch?v=bZiJb8nE8E0",
        "timestamp": "2023-09-05 02:13:41+00:00"
    },
    {
        "message": "👉 Investigative journalist Max Blumenthal says he highly doubts that any debate between him and Robert F. Kennedy will be happening.\n\n@PalestineDeclassified",
        "timestamp": "2023-09-03 13:56:41+00:00"
    },
    {
        "message": "Max Blumenthal and Matt Taibbi on Neoliberal Censorship\n\nSupport the Grayzone: http://spot.fund/DefendTheGrayzoneAgain\n\nMax Blumenthal Podcast\nhttps://podcastaddict.com/max-blumenthal/episode/163119275\n\nUseful Idiots:\nhttps://www.usefulidiotspodcast.com/p/extended-episode-matt-taibbi-and#details",
        "timestamp": "2023-09-02 02:19:58+00:00"
    },
    {
        "message": "http://spot.fund/DefendTheGrayzoneAgain",
        "timestamp": "2023-09-02 02:11:41+00:00"
    },
    {
        "message": "Max Blumenthal on Palestine Declassified about RFK Jr. and the Israel Lobby",
        "timestamp": "2023-09-01 01:45:51+00:00"
    },
    {
        "message": "Before his removal in a military coup, Gabon’s hopelessly corrupt President Ali Bongo was courted by Obama and feted from Washington to Davos. The US war on Libya which destabilized the region may not have succeeded without him. https://thegrayzone.com/2023/08/31/obamas-africa-arrest-coup-gabon/",
        "timestamp": "2023-08-31 19:47:17+00:00"
    },
    {
        "message": "Max Blumenthal on Glenn Greenwald's System Update discussing the financial sabotage operations of GoFundMe against The Grayzone and others. \n\nWatch the whole show here:\nhttps://rumble.com/v3d1ncs-system-update-show-139.html\n\nThe Grayzone's new fundraiser:\nhttp://spot.fund/DefendTheGrayzoneAgain",
        "timestamp": "2023-08-31 15:13:54+00:00"
    },
    {
        "message": "German court convicts CJ Hopkins for satirical book cover\nCJ joins The Grayzone's Max Blumenthal to discuss his conviction for violating Germany's unusual speech codes and what it says about the future of liberal democracy in Europe.\n\nWatch the whole show here:\nhttps://youtu.be/tR3fEegpFws\n\nThe Grayzone's new fundraiser:\nhttp://spot.fund/DefendTheGrayzoneAgain",
        "timestamp": "2023-08-31 12:52:42+00:00"
    },
    {
        "message": "Satirist and author CJ Hopkins was found guilty and sentenced to 60 days in prison or a 3600 Euro fine by a German court for a single tweet mocking mask mandates, and for the cover of his book, \"The New Normal Reich,\" which examines pandemic restrictions and the propaganda surrounding them as symbols of a new authoritarian order in the liberal West.\n\nCJ joins The Grayzone's Max Blumenthal to discuss his conviction for violating Germany's unusual speech codes and what it says about the future of liberal democracy in Europe. https://youtu.be/tR3fEegpFws?si=yQrA9WfZMqwHtFzk",
        "timestamp": "2023-08-31 01:18:35+00:00"
    },
    {
        "message": "https://rumble.com/v3d1ncs-system-update-show-139.html",
        "timestamp": "2023-08-30 00:11:04+00:00"
    },
    {
        "message": "Wow! In less than 24 hours!\n\nhttp://spot.fund/DefendTheGrayzoneAgain",
        "timestamp": "2023-08-29 20:14:46+00:00"
    },
    {
        "message": "Live: CJ Hopkins faces JAIL in Germany for Covid thoughtcrimes\n\nhttps://rokfin.com/stream/38395/CJ-Hopkins-faces-JAIL-in-Germany-for-Covid-thoughtcrimes",
        "timestamp": "2023-08-29 16:27:54+00:00"
    },
    {
        "message": "Shocked by Niger coup, Victoria Nuland appeared “desperate” during Africa tour - A veteran South African official details meeting with an unprepared and “desperate” Acting Deputy Secretary of State Victoria Nuland begging for local help on rolling back the popular coup in Niger. The recent BRICS conference might give Nuland even more to fret about\nANYA PARAMPIL·AUGUST 29, 2023\nhttps://thegrayzone.com/2023/08/29/niger-coup-victoria-nuland-africa-tour/",
        "timestamp": "2023-08-29 13:59:58+00:00"
    },
    {
        "message": "Max Blumenthal on The Jimmy Dore Show tonight discussing the financial sabotage of The Grayzone's fundraiser by GoFundMe. They also discuss RFK Jr. and \"the debate.\"\n\nRead more:\nhttps://thegrayzone.com/2023/08/28/gofundme-freezes-grayzone-fundraiser/\n\nDonate:\nhttp://spot.fund/DefendTheGrayzoneAgain",
        "timestamp": "2023-08-28 23:27:22+00:00"
    },
    {
        "message": "If you contributed to the GoFundMe fundraiser please be sure to read the instructions below. \n \nThe Grayzone has benefited from such an incredible outpouring of support over the last month for our first ever crowdfunding effort. The fundraiser on GoFundMe is now over $90,000 (of a $125,000 goal) with over 1100 individual donors! This effort is aimed to raise funds in order to offer staff writing positions to three of our most dedicated contributors: Kit Klarenberg, Wyatt Reed and Alex Rubenstein. \n \nGoFundMe has stated that it should only take a few days for your donation to be transferred to the Grayzone accounts. Well, it's been over three weeks and not one cent has been transferred. Nothing!  \n \nWe have been in touch with GoFundMe a few times and it's clear that they are cowering to political pressure which they describe as \"external concerns\" and that it is “for our safety” that they aren't transferring funds. Read more at the article just published at The Grayzone.  \n \nGoFundMe has not told you that the money you donated has been held by them in an act of financial sabotage. We want to make sure that you know what is going on.  \n \nWe reached out to other platforms and have had the co-founder and CTO of SpotFund offer his personal approval of our fundraiser for that platform.  \n \nInstructions on what you need to do to protect your funds from GoFundMe:  \n \n1. Request a refund from GoFundMe.\nhttps://support.gofundme.com/hc/en-us/requests/new?ticket_form_id=4946054697115\n \n2. Donate to our new fundraiser on SpotFund. The co-founder and CTO of this platform, Mike Marian, has personally approved of our fundraiser and promised quick automatic transfers to The Grayzone’s account. Here is the link: http://spot.fund/DefendTheGrayzoneAgain\n \n3. Tell GoFundMe to go f**k themselves. Consider emailing \"Sabrina\" at GoFundMe’s “Trust & Safety Team\" to tell her what you think of the service they have provided you, perhaps ask her why your money hasn't been sent to The Grayzone's account. Her email is: support@gofundme.com \n \nThank you",
        "timestamp": "2023-08-28 20:30:59+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/08/28/gofundme-freezes-grayzone-fundraiser/",
        "timestamp": "2023-08-28 20:29:08+00:00"
    },
    {
        "message": "http://spot.fund/DefendTheGrayzoneAgain",
        "timestamp": "2023-08-28 20:28:45+00:00"
    },
    {
        "message": "Jack Dorsey has woken up.",
        "timestamp": "2023-08-28 04:52:51+00:00"
    },
    {
        "message": "Warmonger candidates flee Grayzone reporter at GOP debate\nAt the August 23 GOP presidential debate in Milwaukee, The Grayzone's Liam Cosgrove attempted to challenge candidates including former VP Mike Pence, ex-Gov. Chris Christie and Gov. Ron Desantis on the positions they've expressed lusting for war with China and Russia. \n\nhttps://www.youtube.com/watch?v=0ffGvR5EI60",
        "timestamp": "2023-08-28 04:47:01+00:00"
    },
    {
        "message": "Editor for The Grayzone, Max Blumenthal, interviewed by The Hill about BRICS,  how western hegemony is falling apart, BRICS now controls 40% world's GDP and de-dollarization. \n\nhttps://youtu.be/0xBOAnDWe0I?si=84Mlnv5xPP4Ekm0y",
        "timestamp": "2023-08-26 19:15:39+00:00"
    },
    {
        "message": "The Grayzone live from BRICS\n\nThat Grayzone's Anya Parampil and Ahmed Kaballo of African Stream report live from Johanesburg, South Africa, where the BRICS convened a historic gathering of over 60 nations to build a more inclusive and democratic financial order.\n\nhttps://www.youtube.com/watch?v=v7RMXdhiLH4",
        "timestamp": "2023-08-26 19:13:44+00:00"
    },
    {
        "message": "The Grayzone’s Anya Parampil interviewed by Hilaal TV in Johannesburg about how the United States should be concerned about the rise and expansion of BRICS.\n\nhttps://m.youtube.com/watch?v=yGourXLc0OQ",
        "timestamp": "2023-08-26 12:42:28+00:00"
    },
    {
        "message": "Starting soon ☝️🔥🔥☝️",
        "timestamp": "2023-08-25 20:16:36+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=v7RMXdhiLH4",
        "timestamp": "2023-08-25 20:16:16+00:00"
    },
    {
        "message": "Max Blumenthal on The Hill discussing the significance of BRICS and the democratization of global trade.\n\nhttps://youtu.be/0xBOAnDWe0I?si=zbt51tgIWHogHDDt",
        "timestamp": "2023-08-25 14:28:23+00:00"
    },
    {
        "message": "A PR offensive to inundate the American public with pro-Ukraine war advertisements during the 2024 election is the latest initiative of neocon chickenhawk Bill Kristol. While targeted at GOP voters, the campaign appears to be another Democratic Party front.\n\nhttps://thegrayzone.com/2023/08/21/neocon-dark-money-ad-blitz-ukraine-forever-war/",
        "timestamp": "2023-08-24 21:54:27+00:00"
    },
    {
        "message": "The Grayzone's Wyatt Reed addresses the appeal of Oliver Anthony's Rich Men North of Richmond from a local Appalachian perspective and blasts radlib critics for twisting the song's message and accusing the singer of astroturfing",
        "timestamp": "2023-08-22 04:43:05+00:00"
    },
    {
        "message": "I crashed an anti-Syria lobby meeting where they pushed for a new Caliphate and more starvation sanctions\nI crashed the meeting of a lobbying front that ended the life-saving General License 2023 on Syria, and is now pushing to extend Washington’s economic war for another 8 years.\nBehind closed doors, the former State Department official leading the workshop revealed the group’s ultimate goal: partitioning Syria and creating a de facto Caliphate for a rebranded Al Qaeda offshoot. https://thegrayzone.com/2023/08/21/anti-syria-lobby-caliphate-starvation-sanctions/",
        "timestamp": "2023-08-21 17:47:17+00:00"
    },
    {
        "message": "The Grayzone presents a documentary investigation into the career and killing of Fernando Villavicencio, the late Ecuadorian presidential candidate and former President of the Commission of Fiscalization and Political Control of the National Assembly of Ecuador. \n\nDays after proclaiming that Ecuador had been \"kidnapped by the mafias,\" Villavicencio was assassinated at close range by a gunman allegedly hired by the narco gangs he had vowed to destroy. Our investigation raises new questions about police and high-level political involvement in the killing, while examining its impact on the country's August 24th national election. https://youtu.be/O2M_8fwdVx0",
        "timestamp": "2023-08-20 18:07:10+00:00"
    },
    {
        "message": "Comments left by Grayzone benefactors. A heartfelt thanks for your confidence and support.\nWe're almost at our goal!",
        "timestamp": "2023-08-20 02:44:26+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/08/19/western-media-tpfl-mob-violence-eritrea/",
        "timestamp": "2023-08-19 21:31:54+00:00"
    },
    {
        "message": "You and what army? \nThe Grayzone live\n\nThe Grayzone live returns with a roundtable hosted by Max Blumenthal and featuring contributors Kit Klarenberg, Alex Rubinstein and Wyatt Reed on the latest developments from Ukraine to Hawaii.\n\nhttps://www.youtube.com/watch?v=IOrib3wsiKM",
        "timestamp": "2023-08-19 21:19:20+00:00"
    },
    {
        "message": "We're over half-way there!\nIf you value the cutting-edge investigative independent journalism of The Grayzone, please help us reach our fundraising goal so that we can offer fulltime positions to the three amazing journalists featured in this weeks livestream.\n\nhttps://www.gofundme.com/f/defend-the-grayzone-and-independent-journalism",
        "timestamp": "2023-08-19 21:11:20+00:00"
    },
    {
        "message": "Western media has dismissed evidence of neo-Nazi influence in Ukraine by citing President Zelensky’s Jewish heritage. But new footage published by Zelensky shows the leader openly collaborating with a fascist ideologue who once pledged to “lead the white races of the world in a final crusade…against Semite-led Untermenschen.” https://thegrayzone.com/2023/08/16/zelensky-ukraines-notorious-neo-nazi/",
        "timestamp": "2023-08-16 19:03:39+00:00"
    },
    {
        "message": "With Ukrainian forces reportedly suffering a level of amputations reminiscent of WWI, a New York Times proxy war propagandist is spinning amputees as sex symbols and painting their gruesome injuries as “magical.” https://thegrayzone.com/2023/08/15/western-press-ukrainian-amputees/",
        "timestamp": "2023-08-15 21:15:16+00:00"
    },
    {
        "message": "RFK Jr says he plans to debate Max Blumenthal on Israel-Palestine “in a few weeks” after his campaign rejected the idea ☝️",
        "timestamp": "2023-08-15 01:38:07+00:00"
    },
    {
        "message": "https://twitter.com/MaxBlumenthal/status/1691259056873254913",
        "timestamp": "2023-08-15 01:36:37+00:00"
    },
    {
        "message": "Huge shoutout to @RealAlexRubi & @KitKlarenberg for inspiring this segment\n\nTheir recent piece in @TheGrayzoneNews exposed a piece to the puzzle of Niger that few have discovered. The chairman of ECOWAS is a U.S. asset & there’s a paper trail to prove it\n\nhttps://twitter.com/realnikohouse/status/1688980777189433344?s=52",
        "timestamp": "2023-08-09 06:06:43+00:00"
    },
    {
        "message": "Thank you to everyone who has donated to and/or promoted the fundraiser!",
        "timestamp": "2023-08-09 01:02:03+00:00"
    },
    {
        "message": "Please share this link. \nThank you for your support!",
        "timestamp": "2023-08-07 11:45:53+00:00"
    },
    {
        "message": "https://gofund.me/d020763e",
        "timestamp": "2023-08-07 11:42:07+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/08/05/bagman-ecowas-chairman-invade-niger/",
        "timestamp": "2023-08-06 01:05:52+00:00"
    },
    {
        "message": "Bobby and the Lobby\nThe Grayzone live\n\nThe Grayzone's Max Blumenthal and Aaron Mate discuss Robert F. Kennedy Jr. backing out of an Israel-Palestine dialogue he'd agreed to with Blumenthal, and his deepening involvement with some of the Israel lobby's most extreme figures. They will also cover the latest Trump indictment with a special guest, Michael Tracey.\n\nhttps://www.youtube.com/watch?v=aBnKYzBH2aI",
        "timestamp": "2023-08-05 12:17:25+00:00"
    },
    {
        "message": "https://www.youtube.com/live/aBnKYzBH2aI?feature=share",
        "timestamp": "2023-08-04 19:48:34+00:00"
    },
    {
        "message": "Pathetic walk back by RFK 2024 https://thegrayzone.com/2023/08/03/rfk-jr-israel-palestine-dialogue/",
        "timestamp": "2023-08-03 19:32:48+00:00"
    },
    {
        "message": "https://twitter.com/thegrayzonenews/status/1687178889473273856?s=46&t=nZ0NA4qPQSwdtDQThvALsw",
        "timestamp": "2023-08-03 19:32:22+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/07/30/ron-desantis-israel-speech-rights-american/",
        "timestamp": "2023-08-02 23:16:32+00:00"
    },
    {
        "message": "John Mearsheimer, the eminent political scientist who has warned for years that NATO's Ukraine policy would lead to disaster, joins Aaron Maté to assess the state of the Ukraine proxy war and the dangers ahead. \n\nGuest: John Mearsheimer. R. Wendell Harrison Distinguished Service Professor at the University of Chicago. \"The Darkness Ahead: Where The Ukraine War Is Headed\" by John Mearsheimer https://mearsheimer.substack.com/p/the-darkness-ahead-where-the-ukraine\n\nTranscript will be posted in the coming days at TheGrayzone.com\n\nhttps://www.youtube.com/watch?v=t2451jFeZp0",
        "timestamp": "2023-07-31 04:03:51+00:00"
    },
    {
        "message": "📚DD Book Recommendation:\nThe Managament of Savagery\nBy Max Blumenthal\n\nThe rise of international jihad and Western ultra-nationalism\n\nIn the Management of Savagery, Max Blumenthal excavates the real story behind America’s dealings with the world and shows how the extremist forces that now threaten peace across the globe are the inevitable flowering of America’s imperial designs.\n\nWashington’s secret funding of the mujahedin provoked the Russian invasion of Afghanistan in 1979. With guns and money, the United States has ever since sustained the extremists, including Osama Bin Laden, who have become its enemies. The Pentagon has trained and armed jihadist elements in Afghanistan, Syria, and Libya; it has launched military interventions to change regimes in the Middle East. In doing so, it created fertile ground for the Islamic State and brought foreign conflicts home to American soil.\n\nThese failed wars abroad have made the United States more vulnerable to both terrorism as well as native ultra-nationalism. The Trump presidency is the inevitable consequence of neoconservative imperialism in the post–Cold War age. \n\nEvery American citizen should read this....\n\n\n@DDGeopolitics",
        "timestamp": "2023-07-30 22:58:09+00:00"
    },
    {
        "message": "Highlights of Max Blumenthal's opening set for Jimmy Dore at Magooby's Joke House in Timonium, Maryland on July 14, 2023.\n\nhttps://www.youtube.com/watch?v=9h3KenTBUYw",
        "timestamp": "2023-07-29 02:48:25+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/07/28/ukraines-baby-factories-profits-war/",
        "timestamp": "2023-07-29 01:55:07+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/07/27/british-intelligence-war-kosovo/",
        "timestamp": "2023-07-29 01:54:49+00:00"
    },
    {
        "message": "Watch @RobertKennedyJr demolish his credibility as a peace candidate in 4.5 minutes\n\nA campaign that began as a defiant broadside against the war state and censorship industrial complex has suddenly pivoted to a bellicose exercise in pandering to rich Likudniks who seek war with Iran, the permanent violent warehousing of Palestinians and the criminalization of activism that challenges Israeli apartheid. \n\nRFK Jr's host was Shmuley Boteach, a professional race hustler and alleged financial fraudster who owes the existence of his one-man political operation to the fortune of Sheldon Adelson, the late ultra-Zionist oligarch who called for dropping a nuclear weapon on Iran. \n\nIf RFK was not handed a massive wad of Benjamins to suck up to Shmuley, he was embarrassing himself for free, because he was clearly out of his depth. \n\nDuring a rambling, militaristic diatribe, he referred to hijabs as \"habibs,\" pronounced Chechnya as though he hadn't heard of the place until twenty minutes before the event, and offered a history of Israel's creation so cartoonishly propagandistic, it made Alan Dershowitz look like Ilan Pappe. \n\nRFK Jr took it upon himself – or was taken on – to defend the Israeli army's brigade-sized invasion of Jenin, during which it bombed buildings with fighter jets and ran bulldozers through the middle of a refugee camp. He referred to the entire city as \"a bomb factory,\" justifying the invasion because, in his words, \"virtually one hundred percent of the people there are supporting terrorism.\" According to RFK, \"everybody [in Jenin] is involved in bomb making\" – there are no civilians there at all, therefore all are legitimate targets. \n\nHe did not seem to know that the Palestinian campaign of suicide bombing ended well over 15 years ago, or that the Palestinian Authority is legally forbidden from defending Palestinians from Israeli violence – its primary function is to act as an occupation subcontractor. According to RFK Jr, the PA has an official \"pay-to-slay policy,\" in which \"if you kill any Jew, you are going to get awarded with pay for life.\" Even professional AIPAC lobbyists shy away from this kind of baseless invective.\n\nThe half-baked hasbara escalated from there as RFK Jr cited Richard Kemp, a former British army officer who subsists on Israel lobby speaking fees, to claim \"the conduct of the IDF, the Israeli defense forces when they go into Palestinian territories, is beyond anything in the world.\" \n\nWhile Israeli army commanders openly adhere to the Dahiya Doctrine, named for the Beirut neighborhood Israel leveled in 2006, and which calls for targeting Arab civilians in order to turn them against their leadership, RFK Jr insisted that Israel's policy is to \"avoid civilian casualties\" – it exclusively attacks military targets. \n\nIt is hard to believe RFK Jr's ahistorical, belligerent line on Israel-Palestine was not bought and paid for by some pro-Israel billionaire. Which means he's just as corruptible as any Democrat or GOP hack. But if he actually believes what he's saying, he's also at least as pro-war as they are.\n\nMax Blumenthal\n\nhttps://twitter.com/MaxBlumenthal/status/1684851741844525056",
        "timestamp": "2023-07-29 01:54:09+00:00"
    },
    {
        "message": "Project Ukraine unravels\nThe Grayzone live\n\nThe Grayzone's Max Blumenthal and Aaron Mate connect the dots between ongoing revelations of Biden family corruption and the Ukraine proxy war, explaining how the former VP and those around him helped set up Kiev as a base for US plunder and war profiteering. They also cover Robert F. Kennedy Jr. casting his lot with the Israel's lobby's most fanatical elements, while Cornel West emerges as a threat to Biden's re-election campaign.\n...\nhttps://www.youtube.com/watch?v=i6Dr3XBgQj0",
        "timestamp": "2023-07-27 03:43:39+00:00"
    },
    {
        "message": "https://www.youtube.com/live/i6Dr3XBgQj0?feature=share",
        "timestamp": "2023-07-26 20:39:24+00:00"
    },
    {
        "message": "https://youtu.be/ozekmn92Y-Q",
        "timestamp": "2023-07-24 18:08:06+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/07/20/resolutions-emergency-iraq-syria-libya-yemen/",
        "timestamp": "2023-07-21 14:45:24+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/07/19/leaked-files-british-kerch-bridge-strike/",
        "timestamp": "2023-07-20 11:36:05+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/07/14/amendment-to-block-cluster-bomb-ukraine/",
        "timestamp": "2023-07-17 02:00:32+00:00"
    },
    {
        "message": "Biden's corruption led to Ukraine's destruction: fmr. Kiev diplomat\nPushback with Aaron Maté \n\nFormer Ukrainian government official and diplomat Andrii Telizhenko joins Aaron Maté to discuss how, in his view, powerful US figures including Joe Biden have used Ukraine for personal corruption and the geopolitical aim of bleeding Russia -- all to the detriment of Ukrainians.\n\nhttps://youtu.be/pgj3p2jIVtI",
        "timestamp": "2023-07-14 01:23:49+00:00"
    },
    {
        "message": "Max Blumenthal on The Jimmy Dore Show tonight:",
        "timestamp": "2023-07-13 00:21:18+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/07/11/british-intelligence-cia-torture/",
        "timestamp": "2023-07-12 03:19:26+00:00"
    },
    {
        "message": "https://twitter.com/jimmy_dore/status/1678523893064298496?s=46&t=WYnfZ6acMClws6IOLDdRPw",
        "timestamp": "2023-07-10 22:11:54+00:00"
    },
    {
        "message": "Ukraine Clusterf*ck\nThe Grayzone live\n\nMax Blumenthal and Aaron Mate discuss the Biden administration's decision to deliver cluster munitions to Ukraine, the failure (for now) of the Zaporizhzhia nuclear plant deception, the upcoming NATO summit and the most revealing attack yet on RFK Jr.\n\nhttps://m.youtube.com/live/5Q4tsJQ4GeU",
        "timestamp": "2023-07-09 23:14:51+00:00"
    },
    {
        "message": "Leaked documents reveal Reuters helped overthrow Egyptian democracy - The Grayzone\nhttps://thegrayzone.com/2023/07/05/reuters-overthrow-egyptian-democracy/",
        "timestamp": "2023-07-05 14:39:52+00:00"
    },
    {
        "message": "Sun sets on the West\nThe Grayzone Live\n\nMax Blumenthal and Aaron Mate discuss Max's UN speech on the proxy war in Ukraine, the riots sweeping across Macron's France, and the looming deception around the Zaporizhzhia nuclear plant in Ukraine.\n\nhttps://www.youtube.com/watch?v=FC7988EYUV0",
        "timestamp": "2023-07-04 03:44:03+00:00"
    },
    {
        "message": "Max Blumenthal calls out proxy war profiteers from the UN Security Council, including the US ambassador to the UN",
        "timestamp": "2023-07-03 04:05:20+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/07/01/pro-war-democratic-party-pacifica-radio/ The largest, most historically influential progressive non-profit radio network in America, Pacifica Radio, faces a takeover attempt by Democratic Party elements. Will Pacifica embrace the pro-war logic it was created to oppose?",
        "timestamp": "2023-07-01 23:36:26+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/06/29/nuclear-annihilation-max-blumenthal-security-council/",
        "timestamp": "2023-06-30 04:22:59+00:00"
    },
    {
        "message": "Max Blumenthal addressing the UN today",
        "timestamp": "2023-06-29 20:45:33+00:00"
    },
    {
        "message": "https://twitter.com/maxblumenthal/status/1674484646787031059?s=46&t=jl-U1I9OlE9Pjd-XDLKMwQ",
        "timestamp": "2023-06-29 18:33:47+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/06/27/evidence-nord-stream-underwater-expedition/ Observers have drawn a number of conclusions based on a recent series of visits to the site of the Nord Stream pipeline rupture via drone. There’s just one problem: all of them seemed to have missed the location of the explosions.\nAfter a recent underwater expedition, The Grayzone can now reveal where they went wrong, and what the real blast sites tell us about the worst act of eco-terrorism in history.",
        "timestamp": "2023-06-28 00:18:18+00:00"
    },
    {
        "message": "All aboard the gravy train: an independent audit of US funding for Ukraine - The Grayzone\nhttps://thegrayzone.com/2023/06/27/gravy-train-independent-audit-ukraine/",
        "timestamp": "2023-06-27 16:39:40+00:00"
    },
    {
        "message": "The real casualties of Russia’s ‘civil war’: the Beltway expert class                              \nNumerous serious casualties were incurred during Wagner chief Yevgeny Prigozhin’s supposed “coup.” The Grayzone offers an in-depth look at the massacre carried out by some of America’s top Russia experts against their own credibility. https://thegrayzone.com/2023/06/26/russias-civil-war-beltway-expert/",
        "timestamp": "2023-06-26 05:36:11+00:00"
    },
    {
        "message": "Upcoming Friday Live @ 2:30 PM EST🔥",
        "timestamp": "2023-06-23 16:23:08+00:00"
    },
    {
        "message": "https://www.youtube.com/live/2Pv2SfIopXo?feature=share",
        "timestamp": "2023-06-23 16:22:04+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/06/19/files-british-natos-secret-terror-armies/ Newly declassified British files shed disturbing light on the origins and internal workings of Operation Gladio, a covert NATO plot deploying fascist terror militias across Italy. Have spies in London applied these lessons in Ukraine?",
        "timestamp": "2023-06-20 05:33:45+00:00"
    },
    {
        "message": "https://youtu.be/HSQgpezBdAE Facing impeachment, neoliberal Ecuadorian President Guillermo Lasso pulled the trigger on a political reset. Lasso has effectively declared one man rule until new elections are held on August 20. His move has ignited the anger of the social organizations that led a country-wide revolt last year. \n\nSo who is running in Ecuador's upcoming elections? Which ones are catering to Washington, and do any plan to bring change to the neoliberal system that has prevailed for the past five years?",
        "timestamp": "2023-06-20 05:33:18+00:00"
    },
    {
        "message": "Declassified files expose British role in NATO’s Gladio terror armies - The Grayzone\nhttps://thegrayzone.com/2023/06/19/files-british-natos-secret-terror-armies/",
        "timestamp": "2023-06-19 20:38:36+00:00"
    },
    {
        "message": "Livestream at 2:15 PM EST",
        "timestamp": "2023-06-16 17:49:16+00:00"
    },
    {
        "message": "https://www.youtube.com/live/ccRC-oIBDkU?feature=share",
        "timestamp": "2023-06-16 17:48:54+00:00"
    },
    {
        "message": "Nicaragua rebuilds - five years after US-funded terror was defeated - The Grayzone\nhttps://thegrayzone.com/2023/06/15/nicaragua-us-terror-defeated/",
        "timestamp": "2023-06-16 03:30:12+00:00"
    },
    {
        "message": "https://youtu.be/3_64wOUbiPE The Grayzone's Anya Parampil speaks with filmmaker Oliver Stone about his new film \"Nuclear Now.\" Stone busts myths surrounding nuclear power and makes a case for reevaluating our fear of it as a source of clean energy. \"Nuclear Now\" is streaming in the United States: https://www.nuclearnowfilm.com/watch",
        "timestamp": "2023-06-10 22:10:29+00:00"
    },
    {
        "message": "https://www.youtube.com/live/Da_yDFectYw?feature=share",
        "timestamp": "2023-06-09 18:48:26+00:00"
    },
    {
        "message": "British media protected pro-war serial sex pest Nick Cohen for decades - The Grayzone\nhttps://thegrayzone.com/2023/06/08/british-media-pro-war-sex-pest-nick-cohen/",
        "timestamp": "2023-06-08 12:26:19+00:00"
    },
    {
        "message": "Was the Russian invasion of Ukraine really \"unprovoked\"?\n\nThe Grayzone's Liam Cosgrove\n reminds State Department Spokesman Vedant Patel about the many warnings by US officials of the dangers of NATO expansion, and asks what the US would do if Russia established a military base in northern Mexico. Patel's response? \"We did nothing and Ukraine did nothing.\"",
        "timestamp": "2023-06-08 02:14:46+00:00"
    },
    {
        "message": "Leaks reveal FBI helps Ukraine censor Twitter users and obtain their info - The Grayzone\nhttps://thegrayzone.com/2023/06/07/fbi-ukraine-twitter-users-including-journalists/",
        "timestamp": "2023-06-07 19:21:32+00:00"
    },
    {
        "message": "VIDEO: Rep. Jamal Bowman supports military aid for Ukraine but is unfamiliar with the Donbas and Crimea - The Grayzone\nhttps://thegrayzone.com/2023/06/06/jamal-bowman-military-aid-for-ukraine-donbas-crimea/",
        "timestamp": "2023-06-06 19:26:35+00:00"
    },
    {
        "message": "We joined the first independent expedition to the sites of the Nord Stream blasts. Read our first installment on the clues we uncovered.",
        "timestamp": "2023-06-05 07:18:21+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/06/05/nord-stream-expedition-official-investigators/",
        "timestamp": "2023-06-05 07:17:50+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/06/01/father-gonzalo-lira-american-jailed-in-ukraine-imprisonment/",
        "timestamp": "2023-06-04 11:33:07+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/06/01/bbc-specialist-disinformation/",
        "timestamp": "2023-06-04 11:32:18+00:00"
    },
    {
        "message": "“How many non-binary US navy divers were involved in the attack on the Nord Stream pipelines?” https://twitter.com/maxblumenthal/status/1664637348401893377?s=46&t=uHgqnvo8O1xNJC0B2sI_bQ",
        "timestamp": "2023-06-03 18:06:02+00:00"
    },
    {
        "message": "A Grayzone journalist is treated as a terrorist and the British union representing journalists withdraws its statement of concern. It’s clear who’s pulling the strings here https://twitter.com/maxblumenthal/status/1665030427277402113?s=46&t=uHgqnvo8O1xNJC0B2sI_bQ",
        "timestamp": "2023-06-03 18:04:24+00:00"
    },
    {
        "message": "https://twitter.com/maxblumenthal/status/1664703230301949952?s=46&t=uHgqnvo8O1xNJC0B2sI_bQ 🔥🔥🔥",
        "timestamp": "2023-06-03 18:03:06+00:00"
    },
    {
        "message": "Live now 👆",
        "timestamp": "2023-06-02 20:13:41+00:00"
    },
    {
        "message": "https://www.youtube.com/live/FOk5VySfRyI?feature=share",
        "timestamp": "2023-06-02 20:13:28+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/05/30/journalist-kit-klarenberg-british-police-interrogated-grayzone/ 🚨🚨🚨",
        "timestamp": "2023-05-31 06:22:12+00:00"
    },
    {
        "message": "Full story here: https://thegrayzone.com/2023/05/29/grayzone-national-endowment-democracy-vp-cia/",
        "timestamp": "2023-05-29 16:00:46+00:00"
    },
    {
        "message": "The National Endowment for Democracy (NED) contacted The Grayzone to dispute our characterization of their organization as a CIA cutout. Listen to our highly revealing conversation with the NED’s communications director. 👆👆👆",
        "timestamp": "2023-05-29 16:00:03+00:00"
    },
    {
        "message": "The Grayzone debates National Endowment for Democracy VP on group’s CIA ties",
        "timestamp": "2023-05-29 15:59:33+00:00"
    },
    {
        "message": "👆🔥 FRIDAY LIVE IS BACK!! 🔥👆",
        "timestamp": "2023-05-26 17:20:32+00:00"
    },
    {
        "message": "https://www.youtube.com/live/K5lRmQAo1f8?feature=share",
        "timestamp": "2023-05-26 17:19:42+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/05/19/elon-musk-bellingcat-western-psy-op/",
        "timestamp": "2023-05-22 05:11:44+00:00"
    },
    {
        "message": "Massive corruption ring exposed in Moldova. You read it here first! https://thegrayzone.com/2023/05/18/leaked-recordings-state-corruption-moldova/",
        "timestamp": "2023-05-18 15:40:48+00:00"
    },
    {
        "message": "Immiserated, humiliated, yet resilient: how Syrians survive America's economic siege - The Grayzone\nhttps://thegrayzone.com/2023/05/16/syrians-survive-americas-economic-siege/",
        "timestamp": "2023-05-16 21:21:30+00:00"
    },
    {
        "message": "https://www.youtube.com/live/lInN9cUZqwc?feature=share",
        "timestamp": "2023-05-16 00:54:02+00:00"
    },
    {
        "message": "Check out Part 2 👆 of Jeremy Loffredo's documentary on the ongoing protests in France. Part 1 can be viewed here.",
        "timestamp": "2023-05-12 03:00:28+00:00"
    },
    {
        "message": "https://youtu.be/5P2x3M4TFvw",
        "timestamp": "2023-05-12 02:56:39+00:00"
    },
    {
        "message": "Neo-Nazi terror threat grows as Ukraine fighters jailed in France\n\nThe jailing of two heavily armed French neo-Nazis returning from Ukraine highlights a looming problem for NATO states sponsoring the proxy war, and their conspiracy of silence on the nature of the threat. Both were on the radar of French domestic spying agency DGSI, which held files on them for endangering state security. One was a veteran of Chasseurs Alpins (Alpine Hunters), France’s elite mountain infantry force. The other is a notorious local far-right activist.\n\nIt is likely the pair were planning to bring the terror of Ukraine’s battlefields back home with them. Last November, Italian police arrested five members of the local neo-Nazi group, Order of Hagal, which maintains operational ties to Azov Battalion. A sixth member, then-fighting alongside Azov in Ukraine, remained wanted.\n\nGiven the US almost undoubtedly intends to throw Ukraine under the bus in the near future, it raises the almost inevitable prospect of vast scores of fascist fighters fleeing the country to elsewhere in Europe, bringing with them battlefield experience, and in many cases elite Western military training. High-end weapons and ammunition will be available in abundance on the black market, due to the massive wellspring of arms shipments to Kiev over the course of the conflict. Buckle up!\n\nhttps://thegrayzone.com/2023/05/09/neo-nazi-terror-threat-grows-as-ukraine-fighters-jailed-in-france/",
        "timestamp": "2023-05-09 21:12:18+00:00"
    },
    {
        "message": "Livestream starts in 15 min 👆👆👆",
        "timestamp": "2023-05-09 18:32:50+00:00"
    },
    {
        "message": "https://www.youtube.com/live/zdbP27NzMEA?feature=share",
        "timestamp": "2023-05-09 18:32:15+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/05/09/neo-nazi-terror-threat-grows-as-ukraine-fighters-jailed-in-france/",
        "timestamp": "2023-05-09 17:04:53+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/05/09/ukrainian-media-car-bombing-russian-writer/",
        "timestamp": "2023-05-09 17:04:37+00:00"
    },
    {
        "message": "US troops in Somalia rise to 900, House votes not to withdraw - The Grayzone\nhttps://thegrayzone.com/2023/05/03/us-troops-somalia-house-withdraw/\nThe presence of US troops in Somalia helps the Islamist insurgency Al Shabaab recruit, exacerbating the very violence they claim to be fighting. But the House has voted down a resolution to withdraw.",
        "timestamp": "2023-05-04 12:15:02+00:00"
    },
    {
        "message": "Plans to attack Russia's Victory Day celebrations commemorating the defeat of Nazi Germany this month announced and incentivized 👆",
        "timestamp": "2023-05-02 19:10:18+00:00"
    },
    {
        "message": "https://twitter.com/TheGrayzoneNews/status/1653476546244427826?s=20",
        "timestamp": "2023-05-02 19:09:25+00:00"
    },
    {
        "message": "6:30 PM EST - Grayzone Live 👆",
        "timestamp": "2023-04-29 19:22:27+00:00"
    },
    {
        "message": "https://www.youtube.com/live/q0BV_lf5eHU?feature=share",
        "timestamp": "2023-04-29 19:20:59+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/04/26/bellingcats-ukrainian-forces-killed/",
        "timestamp": "2023-04-27 07:02:51+00:00"
    },
    {
        "message": "https://youtu.be/ZtZJ7HVARnM",
        "timestamp": "2023-04-26 09:31:45+00:00"
    },
    {
        "message": "Grayzone Radio 22: Deep State of Siege - airing this week on Pacifica affiliate stations including KPFK in LA and WBAI in NYC.",
        "timestamp": "2023-04-25 16:58:42+00:00"
    },
    {
        "message": "Just finished up at Zanies in Nashville!",
        "timestamp": "2023-04-24 03:13:56+00:00"
    },
    {
        "message": "🔥🔥 Live today @ 2:15 PM EST 👆👆",
        "timestamp": "2023-04-21 16:49:22+00:00"
    },
    {
        "message": "https://www.youtube.com/live/Q3V53CXAZks?feature=share",
        "timestamp": "2023-04-21 16:48:15+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/04/18/9-11-hijackers-cia-recruits/",
        "timestamp": "2023-04-19 14:21:41+00:00"
    },
    {
        "message": "Grayzone Radio is currently broadcast on Pacifica's KPFK 90.7 FM every Tuesday at 5 PM and New York City's WBAI 99.5 FM each Sunday at 6 PM. Help us break the media blockade at the link above and sure your local affiliate airs our one hour show!",
        "timestamp": "2023-04-18 20:52:03+00:00"
    },
    {
        "message": "Do you want to help fight the information war? Check if there's a Pacifica radio station near you (they're international) and let them know that you want them to broadcast our show:\n\nhttps://pacificanetwork.org/stations-2/",
        "timestamp": "2023-04-18 04:22:49+00:00"
    },
    {
        "message": "Grayzone Radio  20: Israel's ruling fanatics push for Armageddon   \nKPFK FM - 55 min\nBroadcast on April 11, 2023\n\nPart 1: The Grayzone's Max Blumenthal and Aaron Mate examine the role of Israeli religious ultra-nationalists in inflaming violence in the region, their doomsday agenda, and the history of their rise to important positions in Israel's far-right governing coalition.\n\nPart 2: CIA freaks out over Saudi-Iran peace talks\nThe Grayzone's Max Blumenthal and Aaron Mate discuss the recent trip to Saudi Arabia by CIA director William Burns amid Chinese-brokered peace talks between the Saudis and Iran, and the waning influence of the US over the global economy.\n\nPart 3: RFK Jr. declares presidential run, slams Ukraine proxy war\nThe Grayzone's Max Blumenthal and Aaron Mate discuss Robert F. Kennedy Jr.'s declaration of his intention to run for president in 2024 as a Democrat, and his recent statement blasting the neocon proxy war in Ukraine and the US militarization of Taiwan.",
        "timestamp": "2023-04-18 04:16:44+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/04/17/enslavement-african-migrants-libya-eu-funding/",
        "timestamp": "2023-04-18 01:45:05+00:00"
    },
    {
        "message": "Amazing livestream going on now 👆",
        "timestamp": "2023-04-17 20:30:11+00:00"
    },
    {
        "message": "Live from Paris - Jeremy Loffredo at anti-Macron protests - YouTube\nhttps://www.youtube.com/watch?v=q5V1JwC1gAY",
        "timestamp": "2023-04-17 20:13:51+00:00"
    },
    {
        "message": "Live at 9PM EST TODAY!",
        "timestamp": "2023-04-14 22:27:41+00:00"
    },
    {
        "message": "https://www.youtube.com/live/SoIBi72_4tA?feature=share",
        "timestamp": "2023-04-14 22:27:23+00:00"
    },
    {
        "message": "How NATO states sponsored ICC prosecutor's Putin arrest warrant - The Grayzone\nhttps://thegrayzone.com/2023/04/13/nato-states-icc-prosecutor-putin/",
        "timestamp": "2023-04-13 23:20:12+00:00"
    },
    {
        "message": "https://youtu.be/fFI3gnbEpu0",
        "timestamp": "2023-04-11 17:02:59+00:00"
    },
    {
        "message": "https://youtu.be/3OSLLyhsS-A",
        "timestamp": "2023-04-11 17:02:04+00:00"
    },
    {
        "message": "https://youtu.be/yh9UzDHy74g",
        "timestamp": "2023-04-11 17:01:40+00:00"
    },
    {
        "message": "https://youtu.be/gma_jFUpjb0",
        "timestamp": "2023-04-11 17:01:10+00:00"
    },
    {
        "message": "https://youtu.be/WKsZh7YdHdw",
        "timestamp": "2023-04-11 17:00:33+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=X2GjAteIaoA",
        "timestamp": "2023-04-09 16:55:04+00:00"
    },
    {
        "message": "Leaked documents expose US-NATO Ukraine war plans 👈 Read more here",
        "timestamp": "2023-04-08 13:34:21+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/04/07/leaked-documents-us-nato-ukraine-war-plan/",
        "timestamp": "2023-04-07 21:05:08+00:00"
    },
    {
        "message": "https://www.youtube.com/live/fiahNP0ifYc?feature=share",
        "timestamp": "2023-04-07 18:47:38+00:00"
    },
    {
        "message": "Bellingcat’s lead Russia investigator Christo Grozev offered an unapologetic, de facto endorsement of the terror attack at a public event at the Street Food Bar № 1 cafe in St. Petersburg. In order to justify the bombing, Grozev cast it as either a legitimate Ukrainian operation carried out in the context of “hybrid warfare,” or a potential Russian false flag. - Grayzone",
        "timestamp": "2023-04-03 21:03:14+00:00"
    },
    {
        "message": "Read more",
        "timestamp": "2023-04-03 20:55:22+00:00"
    },
    {
        "message": "Christo Grozev of the US government-sponsored Bellingcat endorsed the terror attack that killed a Russian war reporter and injured many others during a public event in St. Petersburg. He also defended Ukraine’s attempt to assassinate a Russian philosopher because he was a “propagandist.”\n\nhttps://thegrayzone.com/2023/04/03/bellingcat-terror-attack-st-petersburg-cafe/",
        "timestamp": "2023-04-03 20:42:19+00:00"
    },
    {
        "message": "☝️☝️☝️☝️☝️Check out Jeremy Loffredo's report exposing the lies about Russia.",
        "timestamp": "2023-04-01 02:56:28+00:00"
    },
    {
        "message": "Inside a Russian youth camp condemned by the ICC\n\nIn this Grayzone exclusive, reporter Jeremy Loffredo visits the Donbas Express, a musical instruction camp for youth from the war torn regions of Donetsk and Lugansk, and reveals the reality of a program described by State Department-funded researchers who inspired the ICC arrest warrant for Vladimir Putin as a \"re-education\" camp.\nWatch on YouTube  \nVisit TheGrayzone.com",
        "timestamp": "2023-04-01 02:53:12+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/31/iccs-putin-arrest-state-dept-report/",
        "timestamp": "2023-03-31 23:18:56+00:00"
    },
    {
        "message": "👆👆👆👆 Livestream Today!👆👆👆👆",
        "timestamp": "2023-03-31 17:35:30+00:00"
    },
    {
        "message": "https://www.youtube.com/live/-3CMhhU_Ejg?feature=share",
        "timestamp": "2023-03-31 17:34:41+00:00"
    },
    {
        "message": "https://youtu.be/v1BCtPgyxYI",
        "timestamp": "2023-03-28 03:13:55+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/27/burying-key-evidence-new-opcw-report-covers-up-doumas-unsolved-deaths/",
        "timestamp": "2023-03-28 03:13:08+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/27/un-report-nicaragua-us-coup/",
        "timestamp": "2023-03-28 03:12:39+00:00"
    },
    {
        "message": "Aaron Mate at UN: OPCW cover-up denies justice to Syria victims - The Grayzone\nhttps://thegrayzone.com/2023/03/24/aaron-mate-at-un-opcw-cover-up-denies-justice-to-syria-victims/",
        "timestamp": "2023-03-25 14:22:51+00:00"
    },
    {
        "message": "I am the \"US-based Kremlin intermediary\" that tried to help Tucker Carlson book an interview with Putin - The Grayzone\nhttps://thegrayzone.com/2023/03/20/kremlin-intermediary-tucker-carlson-putin/",
        "timestamp": "2023-03-22 03:16:29+00:00"
    },
    {
        "message": "https://youtu.be/Z2WCC9pkZzE",
        "timestamp": "2023-03-21 04:20:28+00:00"
    },
    {
        "message": "Live at 7:40 PM EST",
        "timestamp": "2023-03-17 23:11:22+00:00"
    },
    {
        "message": "The Grayzone live, 7 PM EST today https://www.youtube.com/watch?v=6DqKnMRRNdA",
        "timestamp": "2023-03-17 05:15:04+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/15/covid-lockdowns-financial-crisis/",
        "timestamp": "2023-03-15 05:53:39+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/13/us-natsec-advisor-taiwan-semiconductor-china/",
        "timestamp": "2023-03-14 04:36:05+00:00"
    },
    {
        "message": "How Britain Secretly Warped MH17 News Coverage\n\nhttps://thegrayzone.com/2023/03/05/british-intelligence-firm-mh17-news/\n\nIn November of 2022, a final judgment arrived in the trial of alleged perpetrators of the attack on Malaysia Airlines Flight 17 (MH17). Russia and the Donbas separatists having long-been convicted in the court of international public opinion, courtesy of a concerted media campaign waged by the Ukrainian Security Service, and notorious Bellingcat, may explain why mainstream interest in the verdict was virtually non-existent.\n\nI can now reveal there was a hitherto undisclosed dimension to that campaign. Much of the initial news coverage of MH17, which did so much to cement the narrative of Moscow's culpability, was heavily influenced by a shadowy entity called Pilgrims Group, which is closely tied to British intelligence. \n\nStaffed and led by British Special Forces veterans, Pilgrims Group is a private security company offering elite security services to London’s embassies, diplomats, spies, and business interests abroad, particularly in high-risk environments. It also trains foreign militaries and paramilitary groups, and provides protection to reporters and their employers. \n\nIt was in the latter context that Pilgrims Group shaped media coverage – and by extension, official investigations – of MH17. The company had maintained a presence in Kiev since the early days of the US-orchestrated Maidan “revolution” in late 2013, shepherding journalists to and from the scenes of major events in Ukraine. In the process, it maintained control over what the reporters under its watch saw and how they understood the situations they encountered.\n\nAs such, Pilgrims Group played a pivotal role in convicting Russia and the Donbas separatists for MH17’s downing. The operation began while the plane’s wreckage remained smoldering on the ground of rebel-controlled territory, and ultimately prevented the initiation of any genuinely independent investigations.",
        "timestamp": "2023-03-13 23:14:05+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/12/academic-journal-maidan-massacre/",
        "timestamp": "2023-03-13 23:10:00+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/13/oscar-navalny-documentary-misinformation/",
        "timestamp": "2023-03-13 23:09:44+00:00"
    },
    {
        "message": "Nordstream blame game begins\n\nThe Grayzone LIVE at 2 PM EST 3/10/23\n\nMax Blumenthal and Aaron Mate discuss the controlled leaks aiming to deflect blame for the Nordstream attacks onto \"pro-Ukrainian\" elements, the failed attempt by Republican populists and Democratic progressives to withdraw US troops from Syria, and the dramatic congressional Twitter files hearing.\n\nhttps://www.youtube.com/watch?v=wsliWRY5vME",
        "timestamp": "2023-03-10 14:29:15+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/05/british-intelligence-firm-mh17-news/",
        "timestamp": "2023-03-06 04:04:14+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/04/house-resolution-syria-sanctions-earthquake/",
        "timestamp": "2023-03-04 14:13:28+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/03/04/biden-officials-ukraine-rally-nazi/",
        "timestamp": "2023-03-04 14:11:11+00:00"
    },
    {
        "message": "Join @MaxBlumenthal and @aaronjmate live at 4 PM EST to discuss growing pressure in Washington to take NATO's proxy war to Crimea and launch another over Taiwan, while the antiwar movement gathers momentum across the Atlantic",
        "timestamp": "2023-03-03 20:55:20+00:00"
    },
    {
        "message": "https://www.youtube.com/live/wsT7_ewfRUA?feature=share",
        "timestamp": "2023-03-03 19:19:37+00:00"
    },
    {
        "message": "Live Today at 4 PM EST",
        "timestamp": "2023-03-03 19:19:21+00:00"
    },
    {
        "message": "https://youtu.be/b8QRWPxWP0o",
        "timestamp": "2023-03-02 16:07:53+00:00"
    },
    {
        "message": "Be a part of history and honor the president who bombed the Nordstream pipelines, marking the most serious act of industrial and environmental sabotage ever. New Grayzone gear is here! https://www.redbubble.com/shop/ap/141176948?ref=studio-promote",
        "timestamp": "2023-03-02 04:09:36+00:00"
    },
    {
        "message": "Leaked Files Expose Britain's Ambulances for Terrorists Conspiracy \n\nEver since the February 6th earthquake, residents of West Asia have been subjected to a particularly unforgiving - yet illuminating - crash course in Western double standards over humanitarian aid. Genocidal EU and US sanctions on Damascus initially meant countries keen to assist with the quake's dire impact on Syria were unwilling and/or unable to do so. While there's since been an easing of these restrictions due to intense international pressure, the move is temporary, and what can get through is modest.\n\nIn this context, it's relevant to consider a time when the West was only too eager to invest vast sums to flood Syria with humanitarian aid - in service of regime change. In August 2016, a remarkable and never before disclosed covert British intelligence operation began at a secret site in Jordan, run by the CIA and MI6. Violent armed groups funded and armed by London and Washington were trained to provide medical assistance to wounded opposition combatants, creating the false image of a professional fighting force capable of replacing the Syrian government.\n \nhttps://kitklarenberg.substack.com/p/leaked-files-expose-britains-ambulances",
        "timestamp": "2023-03-01 05:26:29+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/02/27/europeans-protest-natos-proxy-war/",
        "timestamp": "2023-02-28 12:57:58+00:00"
    },
    {
        "message": "Packed room for No2Nato, why not join TODAY for free ⬇️\n\nhttps://www.no2nato.org/join-us",
        "timestamp": "2023-02-25 17:16:29+00:00"
    },
    {
        "message": "No2Nato Update ⬆️⬆️⬆️⬆️\n\nSession 1 starts 11:00AM (entry from 10:45am)\n\nSession 2 starts 2.00PM (entry from 1:45pm)\n\nSession 3 starts 4.30PM (entry from 3:45pm)\n\nWe urge you to come early on Saturday 25th February to avoid disappointment, and wait for the announcement of the venue on the day through eventbrite and our social media channels.",
        "timestamp": "2023-02-25 00:23:50+00:00"
    },
    {
        "message": "Live at 2PM EST",
        "timestamp": "2023-02-24 13:30:54+00:00"
    },
    {
        "message": "https://www.youtube.com/live/uOlvY_SN678?feature=share",
        "timestamp": "2023-02-24 13:30:28+00:00"
    },
    {
        "message": "https://www.youtube.com/live/dsTo6hQ_Oos?feature=share",
        "timestamp": "2023-02-19 17:11:36+00:00"
    },
    {
        "message": "Max Blumenthal kicks it off at 12:30 tomorrow at The Lincoln Memorial",
        "timestamp": "2023-02-19 00:15:39+00:00"
    },
    {
        "message": "In a three-part expose, Anya Parampil reveals the character of Nick Fuentes.\n\nhttps://thegrayzone.com/2023/02/16/groyper-wars-america-first-nick-fuentes/\n\nhttps://thegrayzone.com/2023/02/17/how-nick-fuentes-dashed-joe-kents-congressional-hopes-delighting-democrats/\n\nhttps://thegrayzone.com/2023/02/15/nick-fuentes-america-firsts-death/",
        "timestamp": "2023-02-19 00:14:20+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/02/14/us-crushed-struggle-somali-nation/",
        "timestamp": "2023-02-19 00:11:30+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/02/15/trump-empire-they-hated-him/",
        "timestamp": "2023-02-19 00:10:23+00:00"
    },
    {
        "message": "Join our last-minute livestream with Max Blumenthal and Aaron Mate at 2:45 EST today on Biden's war on balloons, the latest on the Nord Stream cover-up, and #RageAgainstWarMachine \n\nhttps://www.youtube.com/watch?v=P3dtI-A59i8",
        "timestamp": "2023-02-17 18:43:55+00:00"
    },
    {
        "message": "Rage Against the War Machine rally this Sunday, February 19, in Washington DC at 1230 PM at the Lincoln Memorial. https://rageagainstwar.com/",
        "timestamp": "2023-02-14 05:21:17+00:00"
    },
    {
        "message": "Rage Against the War Machine rally this Sunday, February 19, in Washington DC at 1230 PM at the Lincoln Memorial. https://rageagainstwar.com/",
        "timestamp": "2023-02-14 04:42:49+00:00"
    },
    {
        "message": "Livestream today at 3pm EST",
        "timestamp": "2023-02-10 17:20:40+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=au3sGTgRpAU&ab_channel=TheGrayzone",
        "timestamp": "2023-02-10 17:20:01+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/02/06/israeli-bennett-us-russia-ukraine-peace/",
        "timestamp": "2023-02-08 00:00:02+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/02/03/opcw-smoking-gun-backfires/",
        "timestamp": "2023-02-07 23:59:23+00:00"
    },
    {
        "message": "https://www.youtube.com/watch?v=Dm4L-PZixtM&ab_channel=TheGrayzone",
        "timestamp": "2023-02-03 20:35:17+00:00"
    },
    {
        "message": "The Grayzone is now live on YouTube",
        "timestamp": "2023-02-03 20:35:01+00:00"
    },
    {
        "message": "https://m.youtube.com/watch?v=MgOp15BE-Pg",
        "timestamp": "2023-02-03 04:15:02+00:00"
    },
    {
        "message": "https://m.youtube.com/watch?v=3BU3MudND8Q",
        "timestamp": "2023-02-03 04:14:12+00:00"
    },
    {
        "message": "https://m.youtube.com/watch?v=7YRWgH1_Knk",
        "timestamp": "2023-02-03 04:13:38+00:00"
    },
    {
        "message": "https://twitter.com/MaxBlumenthal/status/1621041162231619586?s=20&t=hkq1FCuixQ2lTLFnxyn1XA",
        "timestamp": "2023-02-03 04:03:37+00:00"
    },
    {
        "message": "https://thegrayzone.com/2023/02/02/state-security-germanys-far-right-coup/",
        "timestamp": "2023-02-03 04:02:26+00:00"
    },
    {
        "message": "Hosts Christopher Weaver and Setareh Sadeqi shed more light on their piece for @thegrayzonenews regarding the coordinated manipulation campaign against Iran triggered by the 2022 unrest. \n\nOur Special guest in this episode: Keefi, the cat \n\n\n\nhttps://youtu.be/CnCYhzY9hPA",
        "timestamp": "2023-01-24 17:24:01+00:00"
    },
    {
        "message": "British-run spy tech powers Ukraine proxy war, putting civilians at risk\nLeaked files reveal the Anomaly 6 spy firm is providing intelligence to the British military through a cut-out involved in the Kerch Bridge bombing and other acts of dangerous sabotage in the Ukraine conflict.\nhttps://thegrayzone.com/2023/01/03/british-spy-tech-ukraine-war/",
        "timestamp": "2023-01-24 17:17:16+00:00"
    },
    {
        "message": "“I obeyed my conscience rather than the law,” ex-Defense Intelligence Agency analyst Ana Belén Montes declared on her way into a federal prison. Accused of spying for Cuba, she is a hero on the besieged island, where she foiled countless US destabilization operations.\n\nHonored in Cuba and condemned by Washington, Ana Belén Montes walks free from federal prison.\nhttps://thegrayzone.com/2023/01/06/cuba-us-ana-belen-montes-federal-prison/",
        "timestamp": "2023-01-24 17:07:46+00:00"
    },
    {
        "message": "Iran’s unrest triggers explosion of fake news\nSome of the most incendiary accusations made against Iran’s government by corporate media, celebrity influencers and Western leaders in the past months are little more than fabrications. And most remain uncorrected.\nhttps://thegrayzone.com/2023/01/19/irans-unrest-fake-news/",
        "timestamp": "2023-01-24 16:50:53+00:00"
    },
    {
        "message": "US Africa Leaders Summit promises more exploitation for Africa, record profits for US mining firms\nRecent deals between US Secretary of State Tony Blinken and African heads of state promise eye-popping profits for US mining multinationals and fewer protections for African laborers “toiling in subhuman conditions” to drive the digital revolution. \nhttps://thegrayzone.com/2023/01/23/us-africa-summit-profits-mining/",
        "timestamp": "2023-01-24 16:47:38+00:00"
    },
    {
        "message": "BBC Assault on Antiwar Academics Was Apparent Product of UK Intel Plot\n\nNEW: Leaked emails expose the fingerprints of UK intelligence all over a factually challenged BBC special that aimed to deprive antiwar academics of their jobs and destroy their reputations.\n\n➨ thegrayzone.com/2022/08/21/bbc-antiwar-academics-uk-intel\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-22 22:54:58+00:00"
    },
    {
        "message": "\"No Farms, No Food\": Dutch Farmers Confront Billionaire \"Green\" Elite’s Food System Reset Plan\n\nDutch farmers’ protests offer a preview of the resistance to come as transnational “green” billionaires advance a “reset” of the global food system. The elite agenda threatens to deepen an international cost of living crisis and spark unrest well beyond The Netherlands.\n\n➨ thegrayzone.com/2022/08/19/farms-food-dutch-farmers-protests-elite\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-22 15:54:58+00:00"
    },
    {
        "message": "Ukraine War Veterans on How Kiev Plundered U.S. Aid, Wasted Soldiers, Endangered Civilians, and Lost the War\n\n“The weapons are stolen, the humanitarian aid is stolen, and we have no idea where the billions sent to this country have gone,” a Ukrainian complained to The Grayzone.\n\n➨ thegrayzone.com/2022/08/18/ukraine-veterans-us-aid-soldiers-war\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-22 13:49:58+00:00"
    },
    {
        "message": "🎥 Roger Waters Calls for Freeing Julian Assange at DOJ Rally\n\nThe Grayzone’s Max Blumenthal joined Waters and other speakers in front of the Department of Justice in Washington DC to demand the US drop its charges against the Wikileaks founder.\n\n➨ thegrayzone.com/2022/08/18/roger-waters-julian-assange-doj\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-22 12:21:27+00:00"
    },
    {
        "message": "🎥 Nicaragua’s Top Health Advisor on Confronting Covid-19: “The Way to Face This Was to Keep Working”\n\nNEW: Max Blumenthal interviews Sonia Castro, lead advisor to the President of Nicaragua, Daniel Ortega, on the Sandinista government's response to the Covid-19 pandemic. \n\nCastro explains why, despite heavy criticism, her government did not follow World Health Organization guidance to lock down the population and instead kept schools and businesses open. \n\nShe also discusses her government's guidance to prescribe off-patent early treatments against Covid and its ongoing, Cuban and Russian-assisted national vaccination campaign. \n\n➨ youtube.com/watch?v=uGU9gBjUj5w\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-13 19:04:50+00:00"
    },
    {
        "message": "How Britain Fueled Ukraine’s War Machine and Invited Direct Conflict With Russia\n\nNEW: Britain has played a key role in NATO forward troop deployments and training exercises on Russia’s borders. With war underway, the UK sends billions in arms, special forces, and volunteers to ensure escalation.\n\n➨ thegrayzone.com/2022/08/12/britains-military-russia-ukraine\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-13 17:03:46+00:00"
    },
    {
        "message": "Establishment Smear Merchants the Daily Beast, Rolling Stone and Their Perceptible Intelligence Ties\n\nHow did The Daily Beast and Rolling Stone become two of the most aggressive smear factories of the US neoliberal establishment, and did US intelligence play a role?\n\n➨ thegrayzone.com/2022/08/09/establishment-daily-beast-rolling-stone-intelligence-ties\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-12 01:04:38+00:00"
    },
    {
        "message": "🎥 Kim Iversen on Leaving The Hill, Defying Corporate Media Censorship\n\nNEW: Kim Iversen joins The Grayzone to discuss her departure from The Hill's Rising and how she managed to disrupt establishment narratives on war and the pandemic on a corporate network. \n\nAaron Mate will also discuss the Ukraine lobby's meltdown over critical reporting and the killing of AQ leader Ayman al-Zawahiri.\n\n➨ youtube.com/watch?v=i1YbWf_Mrxk \n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-08 21:55:16+00:00"
    },
    {
        "message": "NATO-Backed Network of Syria Dirty War Propagandists Identified\n\nNEW: Defaming journalism on the OPCW’s Syria cover-up scandal, The Guardian and its NATO-funded sources out themselves as the real “network of conspiracy theorists.”\n\n➨ thegrayzone.com/2022/08/01/nato-backed-network-of-syria-dirty-war-propagandists-identified\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-01 20:41:50+00:00"
    },
    {
        "message": "“These Are Animals, Not People”: Zelensky Frees Convicted Child Rapists, Torturers to Reinforce Depleted Military\n\nNEW: Once condemned by Ukrainian officials and imprisoned for sadistic torture and the rape of minors, leaders of the notorious Tornado Battalion are free under Volodymyr Zelensky’s orders.\n\n➨ thegrayzone.com/2022/07/30/zelensky-militants-convicted-child-rape-torture-military\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-08-01 12:35:27+00:00"
    },
    {
        "message": "🎥 Grayzone Challenges Guardian Reporter Over U.S. State-Funded Syria Smears\n\nNEW: A recent article in The Guardian parroted a US state-funded group's evidence-free allegations that The Grayzone’s Aaron Maté — who has reported extensively on the OPCW’s Syria cover-up scandal — is \"the most prolific spreader of disinformation\" about Syria among a \"network\" of \"conspiracy theorists.\"\n\nAaron called Guardian reporter Mark Townsend on the phone to ask him to substantiate these defamatory claims, and why he didn’t reach out before printing them. \n\nGuest: Mark Townsend. Reporter for The Guardian who wrote the story, “Network of Syria conspiracy theorists identified”—now updated with Aaron Maté’s response.\n\n➨ youtube.com/watch?v=I0L7LvsiyzE\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-07-19 15:10:57+00:00"
    },
    {
        "message": "Is Paul Mason’s Parliamentary Run a Trojan Horse for British Intelligence?\n\nNEW: Leaked emails raise serious questions about whether Paul Mason’s run for parliament is, in fact, part of a UK intelligence operation to destroy the anti-war left.\n\n➨ thegrayzone.com/2022/07/16/paul-masons-parliamentary-trojan-horse-british-intelligence\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-07-19 14:33:47+00:00"
    },
    {
        "message": "🎥 U.S. Intel Officer Targeted by John Bolton Reacts to Coup-Plot Confession\n\nNEW: In a live interview with CNN, former senior US official John Bolton admitted that he has \"helped plan coups d’etat\" in a number of foreign countries, including Venezuela. \n\nFulton Armstrong, a former senior US intelligence official, has a unique perspective on Bolton's coup confession. In 2002, Bolton unsuccessfully tried to have Armstrong removed from his post after the US intelligence community refused to back Bolton's allegations of an advanced Cuban biological weapons program. \n\nArmstrong joins Aaron Maté to discuss his personal experience with Bolton and perspective on the legacy of US-backed coup plots, from Venezuela to Haiti, that Bolton candidly admitted to.\n\nGuest: Fulton Armstrong. Former National Intelligence Officer for Latin America — the U.S. Intelligence Community's most senior analyst. Also a former CIA analyst and senior staffer on the Senate Foreign Relations Committee. Currently a Lecturer at American University's School of International Service.\n\n➨ youtube.com/watch?v=FIbiR6q5Zbk \n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-07-16 14:45:00+00:00"
    },
    {
        "message": "🎥 Germany Criminalizes Journalist for Exposing Ukrainian War Crimes\n\nNEW: Independent Donetsk-based journalist Alina Lipp of Germany speaks to Max Blumenthal about being prosecuted by the German state for violating new speech codes through her reporting in the breakaway Donetsk Republic. \n\nAs the only German reporter on the ground in Donetsk, Lipp has exposed Ukrainian forces shelling civilians, attacking a maternity ward, mining harbors, and bombing a granary filled with corn for export. She faces three years in prison if she returns to her home country.\n\n➨ youtube.com/watch?v=a4-1qhGvbu4\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-07-13 21:54:56+00:00"
    },
    {
        "message": "Ilhan Omar’s Meddling in Horn of Africa Earns Boos at Somali American Concert\n\nNEW: Framed by Republican media as a backlash against Ilhan Omar’s “woke” politics, the boos of a Somali American crowd expressed growing anger over the congresswoman’s role in US meddling in the Horn of Africa.\n\n➨ thegrayzone.com/2022/07/13/ilhan-omar-booed-somali-concert-africa\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-07-13 19:43:19+00:00"
    },
    {
        "message": "🎥 The Woke Imperium: The Confluence Between Neoconservatism and Social Justice\n\nNEW: Christopher Mott of the Institute for Peace and Diplomacy joins Max Blumenthal to discuss his provocative white paper on the Woke Imperium. \n\nAccording to Mott, \"The rise of a ‘woke’ activist-driven, social justice-oriented politics—particularly among the members of academia, media, and the professional managerial class—has provided the latest ideological justification for interventionism, and it has become readily adopted by the U.S. foreign policy establishment.\"\n\n➨ youtube.com/watch?v=cFTbohtyRYY\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-07-13 17:35:56+00:00"
    },
    {
        "message": "🎥 Ecuador’s Government Buckles Under Indigenous Strike Pressure\n\nNEW: In part 3 of our documentary series on the indigenous-led rebellion against the neoliberal policies of Ecuador’s billionaire president, Guillermo Lasso, we examine the government’s agreement with the strikers and the tactics that overcame Quito’s harsh repression.\n\n➨ youtube.com/watch?v=tX_rTgZgMzQ\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-07-05 21:29:56+00:00"
    },
    {
        "message": "🎥 How UK’s Intelligence Services Target Dissident Academics\n\nNEW: Dissident antiwar UK academics Piers Robinson and David Miller describe being targeted by the British intelligence services through media proxies and infiltrators. They examine The Grayzone’s revelations of journalist Paul Mason’s collusion with a top intelligence officer to destroy the careers of “rogue academics” like them.\n\n➨ youtube.com/watch?v=KubRAwn7-CM\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-07-05 19:46:02+00:00"
    },
    {
        "message": "Right-Wing Intelligence Cabal Seeks UK Home Secretary Priti Patel’s Help to \"Neutralize\" Environmentalist Enemies\n\nNEW: Leaked emails expose Tory intelligence cabal scheming for Priti Patel’s authorization of MI6-style “counter-intelligence” operation against UK environmentalists. The cabal has turned on Boris Johnson and believes Patel is set to replace him.\n\n➨ thegrayzone.com/2022/06/28/intelligence-cabal-uk-home-secretary-priti-patels-enemies\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-30 12:54:54+00:00"
    },
    {
        "message": "🎥 Ecuador’s Uprising Escalates Despite Violent Government Repression\n\nNEW: The Grayzone interviews leaders of Ecuador’s indigenous-led revolt against the neoliberal policies of billionaire banker and President Guillermo Lasso, documenting how his security forces have escalated violent repression against demonstrators, and treated them as enemy combatants while protest ranks fill with society’s most desperate members.\n\n➨ youtube.com/watch?v=9IJNJ61vtlg\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-30 04:42:51+00:00"
    },
    {
        "message": "British ‘Watchdog’ Journalists Mason and Cadwalladr Unmasked as Security State Lapdogs\n\nNEW: Events of the past few days suggest British journalism – the so-called Fourth Estate – is not what it purports to be: a watchdog monitoring the centers of state power. It is quite the opposite.\n\n➨ thegrayzone.com/2022/06/21/british-journalists-mason-cadwalladr-security-state-lapdogs\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-22 14:37:59+00:00"
    },
    {
        "message": "🎥 Ecuador’s Indigenous Revolt Against a Neoliberal President\n\nNEW: The Grayzone spoke with leaders of Ecuador’s indigenous movements, now engaged in ferocious street protests against the privatization policies of President Guillermo Lasso, a billionaire banker. The activists defended their demands and detailed the brutal repression they have witnessed as their rebellion spreads across one of the last right-wing controlled countries on the South American continent.\n\n➨ thegrayzone.com/2022/06/20/ecuadors-indigenous-revolt-neoliberal-president\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-21 15:27:32+00:00"
    },
    {
        "message": "Pfizer Reportedly Sponsored Miami Yacht Party for Failed Colombian Presidential Contender Rodolfo Hernández\n\nJust days before the second round of the presidential elections in Colombia, a Colombian media outlet released images and video of an exotic party in which Rodolfo Hernández, the candidate of the League of Anti-corruption Governors, participated, with a number of businessmen and several young women on a yacht in Miami. The images generated controversy not only due to the attitude of the candidate, but also because the luxurious party was paid for by the US Pharmaceutical company Pfizer, interested in expanding its business in Colombia.\n\nThe images were revealed by the Colombian outlet Cambio which cited a confidential source that stated that the party had taken place on October 9, 2021, when Hernández had not yet revealed, at least publicly, his intention to run for the presidency of Colombia. However, the media outlet drew attention to the fact that “lobbyists interested in doing business with Colombia” participated in the event.\n\nAccording to the revelation by Cambio, the party was held on a yacht, valued at $4.5 million, and its rental for six hours is about $5,000. On the night of October 9, 2021, the boat made a tour of Biscayne Bay, in Miami, with Hernández, several men—including two of the candidate’s sons—and 11 young women in bikinis.\n\nRodolfo Hernández, lauded in US mainstream media as an “anti-corruption” crusader, was defeated by left-wing politician Gustavo Petro in his bid for the presidency on June 19, 2022.\n\n➨ thegrayzone.com/2022/06/19/pfizer-miami-yacht-colombia-presidential-rodolfo-hernandez\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-20 11:55:00+00:00"
    },
    {
        "message": "🎥 Max Blumenthal on Jimmy Dore: U.K. Government Ordered Censoring of YouTube Videos, Leaked Emails Reveal\n\nNEW: Max Blumenthal and Jimmy Dore discuss damning revelations about the Deep State operation to silence any voices critical of the dominant neoliberal narrative on imperialist wars. \n\nLeaked emails have revealed the extent to which celebrity British journalist Paul Mason has been colluding with members of U.K. intelligence to smear, deplatform and bankrupt left-wing and anti-war journalistic outlets like The Grayzone. Mason has even generated a bizarre “mindmap” connecting Russian psyops to Jeremy Corbyn, the Muslim community, trade unions and black people.\n\n➨ youtube.com/watch?v=VKZ5ksMg2Q4\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-17 05:40:30+00:00"
    },
    {
        "message": "🎥 “Intel by Proxy”: The Real Bellingcat Story\n\nNEW: Max Blumenthal and Aaron Mate excavate the hidden truth behind the widely celebrated Bellingcat website, from the US and UK government funding the media never mentions to its not-so-organic rise as the darling of Western intelligence agents, along with the dubious reporting practices of its founder.\n\n➨ youtube.com/watch?v=rffh3_VrtWM\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-15 21:14:55+00:00"
    },
    {
        "message": "🎥 Bill Gates Plans Personal Pandemic Army as Davos Ignores Epstein Ties\n\nJournalist Jeremy Loffredo joins Max Blumenthal to discuss Bill Gates' plans for a supranational pandemic \"GERM\" force, and to discuss his reporting from Davos, where he questioned World Economic Forum attendees on Gates' well-documented ties to the late sex trafficker Jeffrey Epstein.\n\n➨ youtube.com/watch?v=8LQLtXvWHx0\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-15 18:14:55+00:00"
    },
    {
        "message": "🎥 Davos Goes to War for Ukraine\n\nJournalist Jeremy Loffredo joins Max Blumenthal to discuss his reporting from Davos, site of the World Economic Forum. \n\nThey discuss the global 1%'s zealous embrace of the NATO proxy war in Ukraine and Loffredo's visit to a \"Russian War Crimes House\" paid for by a notorious Ukrainian oligarch.\n\n➨ youtube.com/watch?v=V_9tw3tBh68\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-15 16:14:56+00:00"
    },
    {
        "message": "🎥 The World Economic Forum’s Transhumanist Class War\n\nJournalist Jeremy Loffredo joins Max Blumenthal to discuss his reporting from Davos, site of the World Economic Forum.\n\nLoffredo and Blumenthal analyze the WEF's role in engineering a \"useless class\" of humanity through a so-called transhumanist revolution, and its promotion of an unprecedented apparatus of digital surveillance and control. \n\n➨ youtube.com/watch?v=EnQeyXDyQ3E\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-15 14:16:12+00:00"
    },
    {
        "message": "https://thegrayzone.com/2022/06/13/paul-masons-collusion-british-intelligence-agent/",
        "timestamp": "2022-06-14 04:08:14+00:00"
    },
    {
        "message": "Paul Mason’s Covert Intelligence-Linked Plot to Destroy The Grayzone Exposed\n\nNEW: Leaked emails reveal British journalist Paul Mason plotting with an intelligence contractor to destroy The Grayzone through “relentless deplatforming” and a “full nuclear legal” attack. The scheme is part of a wider planned assault on the UK left.\n\n➨ thegrayzone.com/2022/06/07/paul-masons-covert-intelligence-grayzone\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-08 01:29:45+00:00"
    },
    {
        "message": "Ukraine Volunteer Fighter and U.S. Citizen Craig Lang Armed by Colombia to Overthrow Venezuela’s Gov’t, FBI Source Says\n\nNEW: An FBI affidavit against an American fighting in Ukraine, Craig Lang, states he was previously armed by Colombian police to attack the Venezuelan government. Lang is wanted by the US for murdering a couple in Florida and robbing them to pay for his trip to the Venezuelan border. He is also accused by the FBI of torture and murder in Ukraine.\n\nAnother American fighting in Ukraine, white nationalist Paul Gray, was also involved in a plot to topple Venezuela’s government, according to a former associate of coup leader Juan Guaidó. Gray has been associated with four neo-Nazi organizations in the US, and now serves with the Georgian Foreign Legion in Ukraine.\n\n➨ thegrayzone.com/2022/06/05/ukraine-fighter-craig-lang-armed-colombia-overthrow-venezuelas\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-06 13:25:25+00:00"
    },
    {
        "message": "We will speak live with Dr. Gerald Horne today at 6 PM EST about the historical and political context behind the wave of mass shootings across the US, new revelations about the imperial plunder of Haiti, and the crisis sparked by NATO’s Ukraine proxy war \nJoin us here: https://www.youtube.com/watch?v=GfhgIGDjDOk",
        "timestamp": "2022-06-01 19:58:02+00:00"
    },
    {
        "message": "A New Generation of U.S.-Trained Extremists is Fighting Russia. Are We Prepared for the Blowback?\n\nNEW: US agencies have directly and indirectly trained and empowered Nazis and ultra-nationalists at home and abroad to fight Russians in Ukraine. This program follows the blueprint established by Western intelligence agencies in Afghanistan and Syria.\n\n➨ thegrayzone.com/2022/05/31/us-trained-extremists-fighting-russia-blowback\n\nFollow The Grayzone: \n👉@TheGrayzoneNews",
        "timestamp": "2022-06-01 18:15:12+00:00"
    },
    {
        "message": "DHS “Concerned” Over Nazis Returning to U.S. After Fighting in Ukraine. Why Isn’t the Media?\n\nNEW: US corporate media has provided glowing coverage to Paul Gray, a notorious American white nationalist fighting in Ukraine. A DHS document warns he’s not the only US fascist drawn to Kiev.\n\n➨ thegrayzone.com/2022/05/31/american-neo-nazi-ukraine-hero-corporate-media",
        "timestamp": "2022-05-31 14:17:52+00:00"
    },
    {
        "message": "🎥 Before the Mass Shootings, They Killed the Hope\n\nMax Blumenthal's impromptu reaction to a wave of mass shootings, addressing the bloodshed against the backdrop of US empire and the country's history of political assassinations.\n\n➨ youtube.com/watch?v=gACWzCEJiyI",
        "timestamp": "2022-05-28 21:46:01+00:00"
    },
    {
        "message": "🎥 Bernie and the Squad Surrender to the War Machine’s Ukraine Scam\n\nMax Blumenthal and Aaron Mate skewer Bernie Sanders and the progressive Squad's vote in favor of the $40 billion package of Ukraine military aid – a titanic scam channeling public money into the pockets of the arms industry and Beltway defense contractors.\n\n➨ youtube.com/watch?v=iCP6AxQqZd8",
        "timestamp": "2022-05-28 12:51:25+00:00"
    },
    {
        "message": "🎥 Ex-CIA Officer Ray McGovern on Confronting War Criminals\n\nRay McGovern, veteran antiwar activist and ex-CIA officer, reflects to Max Blumenthal and Aaron Mate on his famous confrontation with Donald Rumsfeld during the height of the US war on Iraq, and his reception by corporate media hacks like Anderson Cooper. McGovern has also grilled Hillary Clinton,  getting assaulted in the process, and warmongers including James Clapper.\n\n➨ youtube.com/watch?v=G873hq4gwiU",
        "timestamp": "2022-05-28 03:54:51+00:00"
    },
    {
        "message": "🎥 Minister of Truth Nina Jankowicz Goes Down\n\nFormer CIA officer and veteran antiwar activist Ray McGovern joins Aaron Mate and Max Blumenthal to discuss explosive new revelations.\n\n➨ youtube.com/watch?v=-1bTSIMLczk",
        "timestamp": "2022-05-28 03:44:51+00:00"
    },
    {
        "message": "🎥 How Hillary Personally Oversaw One of Russiagate’s Biggest Fakes\n\nFormer CIA officer and veteran antiwar activist Ray McGovern joins Aaron Mate and Max Blumenthal to discuss explosive new revelations showing the direct role of Hillary Clinton and her top staffers in ginning up one of the key deceptions of the Russiagate intelligence scam, and selling it to uncritical corporate media hacks.\n\n➨ youtube.com/watch?v=Vb7ueg2R5cw",
        "timestamp": "2022-05-28 03:36:14+00:00"
    },
    {
        "message": "🎥Intel-Gate Exposed, Nina’s Disinfo Board ‘Paused’ w/ Ray McGovern\n\nNEW: Former CIA officer and longtime antiwar activist Ray McGovern joins Aaron Mate and Max Blumenthal for a livestream on new revelations of Hillary Clinton's direct involvement in Russiagate lies, the demise of DHS Minister of Truth Nina Jankowicz, how Bernie Sanders backed a giant giveaway to the arms industry in the form of Ukraine aid, and the latest on the Russian-Ukrainian war.\n\n➨ youtube.com/watch?v=sIYSo61YGig",
        "timestamp": "2022-05-25 18:35:56+00:00"
    },
    {
        "message": "A History of Naked Imperialism Continues as Biden Approves Somalia Redeployment\n\nNEW: Biden has reversed Donald Trump’s withdrawal of US forces from Somalia and will redeploy Special Operations Forces. It is just the latest move in a long history of destructive US-UK meddling in the Horn of Africa.\n\n➨ thegrayzone.com/2022/05/21/us-somalia-imperialism-military-biden-redeploy",
        "timestamp": "2022-05-22 11:55:20+00:00"
    },
    {
        "message": "Leaked Emails Expose UK Home Secretary Priti Patel’s Connection to MI6-Style \"Research and Influence Operation\"\n\nNEW: A deeply anti-democratic MI6-linked cabal’s apparent influence on Priti Patel raises serious questions about her fitness to rule on Julian Assange’s extradition to the US.\n\n➨ thegrayzone.com/2022/05/18/leaked-emails-uk-home-secretary-priti-patels-mi6-operation",
        "timestamp": "2022-05-18 22:40:08+00:00"
    },
    {
        "message": "🎥 “Texas” Bentley and Fergie Chambers Report From Donbas Front Lines\n\nNEW: Russell \"Texas\" Bentley returns to The Grayzone alongside fellow US socialist Fergie Chambers to detail their experiences documenting the Russian-Ukrainian war in the Donbas region.\n\nChambers discusses his recent visit to a dungeon of the Ukrainian state-backed Aidar Battalion, and his interviews with Donetsk-based communists, while Texas describes being on the front lines with the Donetsk People's Republic militia.\n\n➨ youtube.com/watch?v=jjz-a4D20z4",
        "timestamp": "2022-05-18 19:50:02+00:00"
    },
    {
        "message": "Operation Surprise: Leaked Emails Expose Secret Intelligence Coup to Install Boris Johnson\n\nNEW: Leaked emails reviewed by The Grayzone reveal possibly criminal plot by pro-Leave elites to sabotage Theresa May’s Brexit deal, infiltrate government, spy on campaign groups, and replace May with Boris Johnson.\n\n➨ thegrayzone.com/2022/05/15/operation-leaked-emails-intelligence-coup-boris-johnson",
        "timestamp": "2022-05-16 01:51:30+00:00"
    },
    {
        "message": "🎥 U.S. Pours Billions Into Ukraine Proxy War While Keeping Public in the Dark\n\nNEW: The US House has approved another $40 billion for the proxy war in Ukraine, all while the realities on the ground are being concealed. Seth Harp, an investigative journalist and US Army veteran who recently reported from Ukraine, on the hidden realities of the dangerous conflict. \n\nGuest: Seth Harp. Journalist, contributing editor at Rolling Stone, and US Army veteran who served in Iraq. \n\n➨ youtube.com/watch?v=hQaO678_XSg",
        "timestamp": "2022-05-14 03:23:43+00:00"
    },
    {
        "message": "🎥 U.S. People’s Convoy Blocked From Protesting in D.C.\n\nNEW: The Grayzone's Max Blumenthal visited the US People's Convoy this March as it disembarked from its base in Hagerstown, Maryland to Washington DC, where it was blocked by DC Metro Police and federal authorities from entering the city for a planned peaceful protest. Convoy participants explained to Blumenthal why they took to the road to protest vaccine mandates and Covid-related restrictions, while some voiced grievances about the leadership's cautious strategy. \n\n➨ youtube.com/watch?v=c2dorhC6uPc",
        "timestamp": "2022-05-09 02:52:25+00:00"
    },
    {
        "message": "Before the Biden administration introduced its Disinformation Governance Board, it openly pushed social media platforms to ban people for challenging the Covidian narrative, accusing them of \"misinformation.\"\n\nI'll speak live at 3 PM today to Jenin Younes, an attorney for three people banned by Twitter for their opinions on the federal Covid response. Younes is leading an important legal action against Biden's HHS Department that aims to establish its role in censorship campaigns on private social media platforms. https://rokfin.com/stream/17911/Challenging-the-Big-TechBiden-censorship-complex-wJenin-Younes",
        "timestamp": "2022-05-05 17:00:20+00:00"
    },
    {
        "message": "Tonight, Tucker Carlson highlighted my response to the Pentagon and Big Pharma-backed censorship racket Newsguard, which is threatening to blacklist The Grayzone.\nI once believed liberals opposed state suppression of alternative media. Today, it's their agenda.",
        "timestamp": "2022-04-29 03:03:18+00:00"
    },
    {
        "message": "Pentagon-Backed “Newsguard” Threatening YouTube’s Anti-War Voices — Including The Grayzone\n\nNEW: An organization called Newsguard Technology has taken to evaluating traditional and independent news organizations and rating the outlets for their trustworthiness and independence from outside influence. The only problem? Newsguard is itself controlled by national security apparatchiks, former administration officials and others with decided biases of their own. \n\nAs The Grayzone’s Max Blumenthal explains to Jimmy Dore in this video, an outfit like Newsguard isn’t interested in promoting good journalism so much as preventing the public from accessing journalism that threatens the establishment’s grip on power.\n\n➨ youtube.com/watch?v=ZnnymVFiGFU",
        "timestamp": "2022-04-29 02:12:30+00:00"
    },
    {
        "message": "The Real Zelensky: From Celebrity Populist to Unpopular Pinochet-Style Neoliberal\n\nNEW: Ukrainian academic Olga Baysha details Volodymyr Zelensky’s embrace of widely loathed neoliberal policies, his repression of rivals, and how his actions fueled the current war with Russia.\n\n➨ thegrayzone.com/2022/04/28/zelensky-celebrity-populist-pinochet-neoliberal",
        "timestamp": "2022-04-28 19:55:56+00:00"
    },
    {
        "message": "Max is now on Telegram!\n\nFollow: 👉 t.me/realmaxblumenthal",
        "timestamp": "2022-04-28 00:07:42+00:00"
    },
    {
        "message": "Madeleine Albright’s Funeral Buried Her Legacy of War-Making and Extraordinary Deceit\n\nNEW: The word “Iraq” was not uttered once during the three hour funeral of Madeleine Albright, who laid the groundwork for the US invasion of the country and helped set the stage for the current war in Ukraine.\n\n➨ thegrayzone.com/2022/04/27/madeleine-albrights-funeral-war-deceit",
        "timestamp": "2022-04-27 19:35:42+00:00"
    },
    {
        "message": "🎥 Reporting From the Ground in Donbas\n\nNEW: In a live interview with Max Blumenthal and Anya Parampil, reporter Alejandro Kirk details what he's seen inside and around the strategic battlefront city of Mariupol. \n\nKirk has been reporting from the front lines of Donbas for HispanTV, and puncturing the one-sided narrative fed to Western audiences.\n\n➨ youtube.com/watch?v=s-SubcsJRtI",
        "timestamp": "2022-04-25 18:54:17+00:00"
    },
    {
        "message": "🎥 U.S. Weapons, European Supplicants Block Peace in Ukraine\n\nNEW: As the Russia-Ukraine war opens a new phase in the Donbas, scholar Richard Sakwa on the absence of diplomacy; the Western media's veneration of Zelensky; the European Union's self-implosion over the war; and the crackdown on dissent in both Ukraine and Russia. \n\nGuest: Richard Sakwa. Professor of Russian and European politics at the University of Kent. His books include \"Frontline Ukraine: Crisis in the Borderlands” and his latest, “Deception: Russiagate and the New Cold War.\"\n\n➨ youtube.com/watch?v=4PBVa4XJEFE",
        "timestamp": "2022-04-21 21:27:14+00:00"
    },
    {
        "message": "“A Historic Sham”: Zelensky’s Speech to Greece’s Parliament Sparks National Outrage, Opens WWII-Era Wounds\n\nNEW: By inviting an Azov fighter to address Greece’s parliament, Zelensky opened the country’s historic wounds and triggered angry demonstrations that have shaken its pro-US government.\n\n➨ thegrayzone.com/2022/04/20/nazis-us-greece-route-russia",
        "timestamp": "2022-04-20 14:40:21+00:00"
    },
    {
        "message": "“One Less Traitor”: Zelensky Oversees Campaign of Assassination, Kidnapping and Torture of Political Opposition\n\nNEW: While claiming to defend democracy, Ukraine’s Volodymyr Zelensky has outlawed his opposition, ordered his rivals’ arrest, and presided over the disappearance and assassination of dissidents across the country.\n\n➨ thegrayzone.com/2022/04/17/traitor-zelensky-assassination-kidnapping-arrest-political-opposition",
        "timestamp": "2022-04-18 00:31:39+00:00"
    },
    {
        "message": "🎥 Mass Protests in Pakistan as Ousted Prime Minister Accuses U.S. of Regime Change\n\nNEW: Pakistani Prime Minister Imran Khan has been ousted in a parliamentary no-confidence vote that he alleges was induced by US pressure. Massive protests have been held across the country to oppose Khan's removal. Scholar Junaid Ahmad analyzes Pakistan's new political crisis. \n\nGuest: Junaid Ahmad. Professor of religion and world politics at the University of Lahore in Pakistan and Director of the Center for the Study of Islam and Decoloniality.\n\n➨ youtube.com/watch?v=3jFNJtjm-wI",
        "timestamp": "2022-04-14 16:04:07+00:00"
    },
    {
        "message": "🎥 The U.S. and E.U. Are Sacrificing Ukraine to “Weaken Russia”: Former NATO Adviser\n\nNEW: As the Russia-Ukraine war enters a new phase, former Swiss intelligence officer, senior United Nations official, and NATO advisor Jacques Baud analyzes the conflict and argues that the US and its allies are exploiting Ukraine in a longstanding campaign to bleed its Russian neighbor. \n\nGuest: Jacques Baud. Former intelligence officer with the Swiss Strategic Intelligence Service who has served in a number of senior security and advisory positions at NATO, the United Nations, and with the Swiss military.\n\n➨ youtube.com/watch?v=r4zReg7Bhu8",
        "timestamp": "2022-04-12 17:34:58+00:00"
    },
    {
        "message": "🎥 Max Blumenthal Slams the Corporate State at Defeat The Mandates LA\n\nNEW: The Grayzone's Max Blumenthal addresses the April 10, 2022 Defeat The Mandates rally in Los Angeles, demanding public workers who refused the jab be given back their jobs and slamming the corporate state that generated $65,000 per minute for Pfizer and Moderna while millions sank into destitution. \n\nBlumenthal also urged solidarity for Julian Assange, describing his silencing as a precedent for the current wave of censorship: \"In a corporate state, character assassination, censorship, and official silencing is the price of telling the truth.\"\n\n➨ youtube.com/watch?v=aLhyAxfN4-A",
        "timestamp": "2022-04-12 16:41:46+00:00"
    },
    {
        "message": "🎥 Max Blumenthal on Jimmy Dore: Clinton Campaign Fined for Lying About Trump & Russia!\n\nNEW: Max Blumenthal and Jimmy Dore discuss this vestige of the Russiagate madness that gripped the Democratic Party and the mainstream media for the entirety of the Trump administration. \n\nNow that the so-called Steele Dossier describing alleged evidence of collusion between Donald Trump and Russia has been debunked, the chips are beginning to fall. The latest casualty is none other than Hillary Clinton who, along with the DNC, was fined $113,000 by the Federal Elections Commission for mislabeling money spent on the dossier as “legal funds” rather than opposition research, which it clearly was.\n\n➨ youtube.com/watch?v=lMIU5y1n668",
        "timestamp": "2022-04-09 22:07:33+00:00"
    },
    {
        "message": "🎥 Max Blumenthal on Jimmy Dore: CNN Host Confronted Over Misinformation by College Student\n\nNEW: In this video, Max Blumenthal and Jimmy Dore eviscerate CNN host Brian Stelter and Washington Post columnist Anne Applebaum for their evasive answers and shoddy “journalism.”\n\nStelter and Applebaum both recently appeared on stage at a journalism forum at the University of Chicago, and fielded questions about their participation and involvement in the dissemination of propaganda and disinformation. Not surprisingly, both offered up dissembling, off-topic responses rather than confront how they serve as mouthpieces for powerful establishment interests and the security state.\n\n➨ youtube.com/watch?v=qlRwMU2_mq0",
        "timestamp": "2022-04-09 19:02:27+00:00"
    },
    {
        "message": "🎥 Max Blumenthal on Jimmy Dore: Sean Penn Pushes Using Nuclear Weapons in Ukraine War\n\nNEW: In this video, Max Blumenthal and Jimmy Dore discuss Hollywood icon Sean Penn's bizarre sideways call for nuclear annihilation.\n\nThe Academy Award-winning actor and acclaimed director recently appeared on Sean Hannity’s Fox News Channel show to discuss the Ukraine war and the options available to NATO in assisting with the Ukrainians’ cause. \n\nSurprisingly, the noted “leftist” Penn expresses concern that the United States might be “intimidated” by Russia into NOT deploying nuclear weapons and launching World War III.\n\n➨ youtube.com/watch?v=LboKlvhxdqE",
        "timestamp": "2022-04-09 17:47:50+00:00"
    },
    {
        "message": "🎥 Max Blumenthal on Jimmy Dore: Irish Politician Eviscerates Pro-Ukraine Warmongers & NATO\n\nNEW: In this video, Max Blumenthal and Jimmy Dore discuss Irish representative Clare Daly's recent fiery pro-peace speech in front of her fellow members of the European Parliament. \n\nDaly is among the few willing to speak out against NATO, call out the organization’s lengthy history of aggression around the globe and criticize western nations’ role in fomenting the Ukraine crisis. \n\n➨ youtube.com/watch?v=ANoZI3tpVmA",
        "timestamp": "2022-04-09 17:28:35+00:00"
    },
    {
        "message": "U.S. Lawmakers Welcomed Notorious Georgian Warlord Now Boasting of War Crimes in Ukraine\n\nNEW: Top lawmakers in US Congress hosted Mamuka Mamulashvili, an infamous Georgian Legion warlord who has boasted of authorizing field executions of captive Russian soldiers in Ukraine. \n\n➨ thegrayzone.com/2022/04/08/lawmakers-georgian-warlord-war-crimes-ukraine",
        "timestamp": "2022-04-08 22:01:15+00:00"
    },
    {
        "message": "New Witness Testimony About Mariupol Maternity Hospital ‘Airstrike’ Follows Pattern of Ukrainian Deceptions, Media Malpractice\n\nNEW: A key witness to the widely publicized incident at the Mariupol maternity hospital has punctured the official narrative of a Russian airstrike on the facility, and raised serious questions about Western media ethics. Meanwhile, news of a massacre in the city of Bucha contains suspicious elements.\n\n➨ thegrayzone.com/2022/04/03/testimony-mariupol-hospital-ukrainian-deceptions-media-malpractice",
        "timestamp": "2022-04-04 02:19:38+00:00"
    },
    {
        "message": "“Gods of War”: How the U.S. Weaponized Ukraine Against Russia\n\nNEW: Since the US-engineered 2013-14 coup in Ukraine, American forces have taught Ukrainians, including neo-Nazi units, how to fight in urban and other civilian areas. Weaponizing Ukraine is part of Washington’s quest for what the Pentagon calls “full spectrum dominance.”\n\n➨ thegrayzone.com/2022/04/01/war-us-weaponized-ukraine-russia",
        "timestamp": "2022-04-02 16:53:39+00:00"
    },
    {
        "message": "How the Organized Left Got COVID Wrong, Learned to Love Lockdowns and Lost Its Mind: An Autopsy\n\nNEW: It is hard to destroy your own cause and feel righteous while doing so, yet the American left has done it. After more than two centuries at the vanguard of the struggle for freedom, the American left, broadly defined, executed a volte face and embraced anti-working-class policies marketed as purely technical public health measures.\n\n➨ thegrayzone.com/2022/03/31/left-covid-lockdowns-mind-autopsy",
        "timestamp": "2022-04-01 19:19:56+00:00"
    },
    {
        "message": "U.S. Veteran Who Volunteered to Fight for Ukraine Describes \"Suicide Mission\"\n\nNEW: An American volunteer for Ukraine tells The Grayzone how his foreign legion tried to use him as cannon fodder.\n\n➨ thegrayzone.com/2022/03/30/us-veteran-fight-ukraine-suicide-mission",
        "timestamp": "2022-03-30 23:52:47+00:00"
    },
    {
        "message": "🎥 Poland's Covert War on Ukraine w/Michael Tracey\n\nNEW: The Grayzone's Anya Parampil is joined by journalist Michael Tracey for a live discussion of his trip to the Polish-Ukrainian border, where journalists alike have been blocked from receiving information about the network of US bases and escalating presence of American troops as President Joe Biden clamors for regime change against Moscow.\n\n➨ youtube.com/watch?v=wiGvQ6UGRIA",
        "timestamp": "2022-03-29 14:59:22+00:00"
    },
    {
        "message": "BBC Correspondent-Fixer Shaping Ukraine War Coverage is PR Operative Involved in “War-Messaging Tool”\n\nNEW: BBC reports on the suspicious destruction of a theater in the Ukrainian city of Mariupol were co-authored by a Ukrainian PR agent tied to a firm at the forefront of her country’s information warfare efforts.\n\n➨ thegrayzone.com/2022/03/25/bbc-fixer-war-ukrainian-nationalist-pr-operative",
        "timestamp": "2022-03-26 01:40:27+00:00"
    },
    {
        "message": "British Intelligence Operative’s Involvement in Ukraine Crisis Signals False Flag Attacks Ahead\n\nNEW: Shadowy UK intel figure Hamish de Bretton-Gordon was at the forefront of chemical weapons deceptions in Syria. Now in Ukraine, he’s up to his old tricks again.\n\n➨ thegrayzone.com/2022/03/24/british-intelligence-ukraine-false-flag",
        "timestamp": "2022-03-25 16:53:59+00:00"
    },
    {
        "message": "🎥 The Battle for Ukraine, With Ex-UN Weapons Inspector Scott Ritter\n\nNEW: The Grayzone's Max Blumenthal and Aaron Mate talk live with ex-UN weapons inspector and military expert Scott Ritter about the Russia-Ukraine war. Ritter provides a detailed analysis of the battlefield that stands in stark contrast to the rose-colored perspective of most Western analysts, and offers his perspective on the political follies that drove the conflict.\n\n➨ youtube.com/watch?v=OSkpIq3T-Zc",
        "timestamp": "2022-03-23 19:15:47+00:00"
    },
    {
        "message": "🎥 U.S. Fighting Russia \"To The Last Ukrainian\": Veteran U.S. Diplomat\n\nNEW: Chas Freeman, a retired senior US diplomat, analyzes Russia's invasion of Ukraine, the US role, and the geopolitical fallout. \"Everything we are doing, rather than accelerate an end to the fighting and some compromise, seems to be aimed at prolonging the fighting,\" Freeman says. \n\nGuest: Chas Freeman. Veteran U.S. diplomat and public servant who has served in many senior positions, including as Assistant Secretary of Defense for International Security Affairs, U.S. Ambassador to Saudi Arabia, Director for Chinese Affairs at the U.S. Department of State, and as the principal US interpreter during President Nixon’s historic visit to China in 1972.\n\n➨ youtube.com/watch?v=0vxufUeqnuc",
        "timestamp": "2022-03-22 22:26:20+00:00"
    },
    {
        "message": "U.S. and NATO Allies Arm Neo-Nazi Units in Ukraine as Foreign Policy Elites Yearn for Afghan-Style Insurgency \n\nNEW: Corporate US media and foreign policy hardliners want to create a new Afghanistan in the middle of Europe by flooding Ukraine with weapons. The arms industry is very pleased.\n\n➨ thegrayzone.com/2022/03/20/us-neo-nazi-ukraine-afghan-insurgency",
        "timestamp": "2022-03-21 01:23:12+00:00"
    },
    {
        "message": "🎥 Former Top Pentagon Advisor Col. Doug Macgregor on Russia-Ukraine War\n\nNEW: Former senior advisor the Secretary of Defense Col. Doug Macgregor joins Max Blumenthal and Aaron Mate for a candid, live discussion of the Russia-Ukraine war and his time in the Trump administration when an Afghan withdrawal was sabotaged and conflict with Iran and Syria continued.\n\n➨ youtube.com/watch?v=NFngc_8RiVc",
        "timestamp": "2022-03-20 23:25:25+00:00"
    },
    {
        "message": "Was Bombing of Mariupol Theater Staged by Ukrainian Azov Extremists to Trigger NATO Intervention?\n\nNEW: Testimony by evacuated Mariupol residents and warnings of a false flag attack undermine the Ukrainian government’s claims about a Russian bombing of a local theater sheltering civilians.\n\n➨ thegrayzone.com/2022/03/18/bombing-mariupol-theater-ukrainian-azov-nato-intervention",
        "timestamp": "2022-03-20 19:01:25+00:00"
    },
    {
        "message": "🎥 How U.S.-Backed Maidan Coup, Russiagate Led to War in Ukraine\n\nAs the wife of key Russiagate figure George Papadopoulos, attorney Simona Mangiante Papadopoulos had a front-row seat to the Trump-Russia saga. Mangiante discusses the role of Russiagate in sabotaging diplomacy with Russia and fueling the post-2014 proxy war in Ukraine, as well her new documentary film, \"Ukraine: The Everlasting Present.\"\n\nGuest: Simona Mangiante Papadopoulos. Attorney and former EU legal advisor. \n\n➨ youtube.com/watch?v=M_Gzgu47wAc",
        "timestamp": "2022-03-17 16:13:58+00:00"
    },
    {
        "message": "🎥 U.S.-Russia Conflict Threatens Economic Havoc Worldwide\n\nRussia has accused the US of waging 'economic war' as it faces crippling sanctions, the seizure of its foreign reserves, and an exodus of Western corporations. Ben Aris of bne IntelliNews discusses the economic consequences of the Russian invasion of Ukraine, inside Russia and around the world. \n\nGuest: Ben Aris. Founder and editor of bne IntelliNews.  \n\n➨ youtube.com/watch?v=NTLXe8qId5A",
        "timestamp": "2022-03-17 02:14:54+00:00"
    },
    {
        "message": "🎥 The Ukraine Tragedy, From U.S.Backed Coup to Russian Assault\n\nAfter eight years of civil war in the Donbas triggered by the US-backed, far-right-led Maidan coup and fueled by US weapons, Ukraine is now under a catastrophic Russian assault. Scholar Nicolai Petro on the tragedy of Ukraine. \n\nGuest: Nicolai Petro. Professor of political science at the University of Rhode Island, editor of \"Ukraine in Crisis,\" and the author of the forthcoming \"The Tragedy of Ukraine.\" He is also a member of the board of the American Committee for U.S.-Russia Accord.\n\n➨ youtube.com/watch?v=e_HxR5GU518",
        "timestamp": "2022-03-17 00:08:40+00:00"
    },
    {
        "message": "🎥 Former Top Pentagon Advisor Col. Doug Macgregor on Russia-Ukraine War\n\nNEW: Former senior advisor the Secretary of Defense Col. Doug Macgregor joins Max Blumenthal and Aaron Mate for a candid, live discussion of the Russia-Ukraine war and his time in the Trump administration when an Afghan withdrawal was sabotaged and conflict with Iran and Syria continued.\n\n➨ youtube.com/watch?v=NFngc_8RiVc",
        "timestamp": "2022-03-16 19:47:32+00:00"
    },
    {
        "message": "🎥 Congress Screws American Workers To Escalate War on Russia\n\nNEW: As gas prices and inflation surge, Max Blumenthal questions members of Congress on the economic toll American workers face from escalating sanctions on Russia, and on their support for escalating the war in Ukraine.\n\n➨ youtube.com/watch?v=17ycp1PCB2w",
        "timestamp": "2022-03-11 14:10:54+00:00"
    },
    {
        "message": "🎥 Why Rep. Thomas Massie Stood Against “Stand With Ukraine” Resolution\n\nNEW: Max Blumenthal asks libertarian Rep. Thomas Massie why he joined only two other members of Congress in voting against a resolution declaring that “the United States stands fervently with the Ukrainian people,” and urging open-ended military aid to Kiev in its fight against Russia.\n\n➨ youtube.com/watch?v=7ZnIUSvPtdo",
        "timestamp": "2022-03-11 04:40:56+00:00"
    },
    {
        "message": "Victoria Nuland Declares U.S. is Protecting \"Biological Research Facilities\" in Ukraine From Russian Forces\n\nNEW: Days before Nuland’s comment, the Russian military claimed it had uncovered 30 biological laboratories in Ukraine linked to the Pentagon’s Defense Threat Reduction Agency.\n\n➨ thegrayzone.com/2022/03/09/victoria-nuland-us-biological-research-facilities-ukraine",
        "timestamp": "2022-03-09 17:39:53+00:00"
    },
    {
        "message": "🎥 Forever War in Ukraine or an End to the Unipolar World?\n\nNEW: Red Lines host Anya Parampil speaks with Moscow-based international affairs analyst Mark Sleboda about the Russia-Ukraine conflict and the possibility of a prolonged war.\n\nMark Sleboda offers a critical assessment of Russia’s military maneuvers in the early days of the conflict in Ukraine and evaluates the possibility of a Syria-style dirty war erupting in the country. Sleboda also explains how the war has ushered in a “great decoupling” between Russia and the West and why he believes it could represent the “end of the unipolar world.”\n\n➨ youtube.com/watch?v=l9RSsvTR06k",
        "timestamp": "2022-03-05 19:32:55+00:00"
    },
    {
        "message": "How Ukraine’s Jewish President Zelensky Made Peace With Neo-Nazi Paramilitaries on Front Lines of War With Russia\n\nNEW: While Western media deploys Volodymyr Zelensky’s Jewish heritage to refute accusations of Nazi influence in Ukraine, the president has ceded to neo-Nazi forces and now depends on them as front line fighters.\n\n➨ thegrayzone.com/2022/03/04/nazis-ukrainian-war-russia",
        "timestamp": "2022-03-04 17:48:17+00:00"
    },
    {
        "message": "🎥 Washington’s “Rules Based” Disorder w/ U.N. Expert Alfred de Zayas\n\nNEW: Max Blumenthal speaks live with Alfred de Zayas, former United Nations Independent Expert on the Promotion of a Democratic and professor at Geneva University school of diplomacy. De Zayas addresses international law in the context of Russia's recognition of Donetsk and Lugansk as independent republics, and its military incursion in Ukraine. He also offers his unvarnished views on NATO, the EU, and the role of the human rights industry in bolstering US power. \n\n➨ youtube.com/watch?v=21h_2RyQKRU",
        "timestamp": "2022-02-28 22:24:25+00:00"
    },
    {
        "message": "🎥 Rejecting NATO Expansion, Putin Recognizes Forgotten Donbas Civilians\n\nNEW: After weeks of US claims that a Russian invasion of Ukraine was imminent, Vladimir Putin instead recognized the breakaway republics of Luhansk and Donetsk. The decision has triggered a new round of US-led sanctions while bringing attention to rebel-held areas, where,  according to UN figures on the Donbas war, 80% of civilian casualties have occurred since 2018.\n\nProfessor Richard Sakwa analyzes the factors behind Putin's move, and its likely consequences. Putin's decision, he says, comes after Kiev refused to implement the 2015 Minsk accords, which could have ended the conflict, and a longstanding US-driven project to expand NATO to Russia's borders. \n\nGuest: Richard Sakwa. Professor of Russian and European politics at the University of Kent. His books include “Frontline Ukraine: Crisis in the Borderlands” and his latest, “Deception: Russiagate and the New Cold War.”\n\n➨ youtube.com/watch?v=TqVCMZdnb3k",
        "timestamp": "2022-02-23 23:28:17+00:00"
    },
    {
        "message": "Was the Hacking of Ottawa Trucker Convoy Donors a U.S.-Canadian Intelligence Operation?\n\nNEW: Aubrey Cottle, the hacker claiming credit for stealing convoy donor info, has boasted of work with the FBI and Canadian law enforcement. The data was published by DDoSecrets, an anti-Wikileaks non-profit which has targeted states in the crosshairs of US intelligence.\n\n➨ thegrayzone.com/2022/02/18/hacking-canadian-trucker-convoy-us-canadian-intelligence-operation",
        "timestamp": "2022-02-19 04:26:12+00:00"
    },
    {
        "message": "🎥 Russian U.N. Ambassador Responds to U.S. \"War Propaganda\" in Exclusive Interview With The Grayzone\n\nNEW: Aaron Mate and Max Blumenthal speak with Deputy Permanent Representative of Russia to the U.N. Dmitri Polyanskiy on escalated tensions around the Russian-Ukraine border, U.S. accusations of an imminent Russian invasion, and the context missing from a U.S. media that refuses to interview Russian officials.\n\n➨ youtube.com/watch?v=K6lO0kppQkk \n\n➨ thegrayzone.com/2022/02/15/russian-un-ambassador-us-war-propaganda-grayzone",
        "timestamp": "2022-02-17 22:52:19+00:00"
    },
    {
        "message": "Propagandist for Syria Terror Proxies Compromised Amnesty International, Leaked Documents Show\n\nNEW: Amnesty International was listed as a client of a professional propagandist for Syrian terror groups backed by the UK and US governments—the same militias once condemned by Amnesty.\n\nhttps://thegrayzone.com/2022/02/08/leaked-documents-syrian-terror-amnesty-international-syria/",
        "timestamp": "2022-02-15 18:26:49+00:00"
    },
    {
        "message": "How U.S. Meddling Split Sudan, Creating an Oil Republic Drowning in Poverty and Conflict\n\nNEW: Following decades of US soft power aid interventions to exploit South Sudan’s energy reserves and counter China’s influence, the republic is trapped in humanitarian crisis, writes T.J. Coles.\n\nhttps://thegrayzone.com/2022/02/01/us-meddling-sudan-oil-republic-poverty/",
        "timestamp": "2022-02-02 04:24:16+00:00"
    },
    {
        "message": "New Gates Foundation Trustee Led Plot To Overthrow Zimbabwean Leader Alongside U.S. Government\n\nNEW: Listed as a US asset while spearheading Zimbabwean regime change plans, billionaire Strive Masiyiwa joins a cast of technocratic zealots on Gates’ new board of trustees, writes Alex Rubinstein.\n\nhttps://thegrayzone.com/2022/01/31/gates-foundation-trustee-overthrow-zimbabwean-covert-us-uk-govt/",
        "timestamp": "2022-02-01 03:19:04+00:00"
    },
    {
        "message": "US and UK Escalate Russia War Fever, but NATO Splits Over Ukraine Emerge\n\nThe US and UK are ramping up threats to Russia over Ukraine by sending more weapons, vowing more sanctions, and lodging evidence-free claims of a Russian plot to install a pro-Kremlin leader. But comments by Germany's navy chief that Russia \"deserves respect\"—leading to his resignation—underscore that not everyone is on board with Washington and London's war fever. Scholar and author Richard Sakwa discusses the latest in the Ukraine crisis. \n\nGuest: Richard Sakwa. Professor of Russian and European politics at the University of Kent. His books include “Frontline Ukraine: Crisis in the Borderlands” and his latest, “Deception: Russiagate and the New Cold War.”\n\nhttps://www.youtube.com/watch?v=lBMKhhdg4jk",
        "timestamp": "2022-01-26 02:35:37+00:00"
    }
]